{
    "Algeria": "Algeria, officially the People's Democratic Republic of Algeria, is a country in the Maghreb region of North Africa. It is bordered to the northeast by Tunisia; to the east by Libya; to the southeast by Niger; to the southwest by Mali, Mauritania, and Western Sahara; to the west by Morocco; and to the north by the Mediterranean Sea. The capital and largest city is Algiers, located in the far north on the Mediterranean coast. Inhabited since prehistory, Algeria has been at the crossroads of numerous cultures and civilizations, including the Phoenicians, Romans, Vandals, Byzantine Greeks, and Turks. Its modern identity is rooted in centuries of Arab Muslim migration waves since the seventh century and the subsequent Arabization of the indigenous populations. Following a succession of Islamic Arab and Berber dynasties between the eighth and 15th centuries, the Regency of Algiers was established in 1516 as a largely independent tributary state of the Ottoman Empire. After nearly three centuries as a major power in the Mediterranean, the country was invaded by France in 1830 and formally annexed in 1848, though it was not fully conquered and pacified until 1903. French rule brought mass European settlement that displaced the local population, which was reduced by up to one-third due to warfare, disease, and starvation. The Sétif and Guelma massacre in 1945 catalysed local resistance that culminated in the outbreak of the Algerian War in 1954. Algeria gained its independence in 1962. The country descended into a bloody civil war from 1992 to 2002. Spanning 2,381,741 square kilometres (919,595 sq mi), Algeria is the world's tenth-largest nation by area, and the largest nation in Africa. It has a semi-arid climate, with the Sahara desert dominating most of the territory except for its fertile and mountainous north, where most of the population is concentrated.",
    "Angola": "Angola, officially the Republic of Angola, is a country on the west-central coast of Southern Africa. It is the second-largest Lusophone (Portuguese-speaking) country in both total area and population and is the seventh-largest country in Africa. It is bordered by Namibia to the south, the Democratic Republic of the Congo to the north, Zambia to the east, and the Atlantic Ocean to the west. Angola has an exclave province, the province of Cabinda, that borders the Republic of the Congo and the Democratic Republic of the Congo. The capital and most populous city is Luanda. Angola has been inhabited since the Paleolithic Age. After the Bantu expansion reached the region, states were formed by the 13th century and organised into confederations. The Kingdom of Kongo ascended to achieve hegemony among the other kingdoms from the 14th century. Portuguese explorers established relations with Kongo in 1483. To the south were the kingdoms of Ndongo and Matamba, with the Ovimbundu kingdoms further south, and the Mbunda Kingdom in the east. The Portuguese began colonising the coast in the 16th century. Kongo fought three wars against the Portuguese, ending in the Portuguese conquest of Ndongo. The banning of the slave trade in the 19th century severely disrupted Kongo's undiversified economic system. European settlers gradually began to establish themselves in the interior. The Portuguese colony that became Angola did not achieve its present borders until the early 20th century. There had been strong resistance by native groups such as the Cuamato, the Kwanyama, and the Mbunda. After a protracted anti-colonial struggle (1961–1974), Angola achieved independence in 1975 as a one-party Republic. But competing movements still struggled for power in the new nation. The country descended into a devastating civil war the same year, between the ruling People's Movement for the Liberation of Angola (MPLA),",
    "Benin": "Benin ( ben-EEN, bin-EEN; French: Bénin [benɛ̃] , Fon: Benɛ, Fula: Benen), officially the Republic of Benin (French: République du Bénin), is a country in West Africa. It was formerly known as Dahomey. It is bordered by Togo to the west, Nigeria to the east, Burkina Faso to the north-west, and Niger to the north-east. The majority of its population lives on the southern coastline of the Bight of Benin, part of the Gulf of Guinea in the northernmost tropical portion of the Atlantic Ocean. The capital is Porto-Novo, and the seat of government is in Cotonou, the most populous city and economic capital. Benin covers an area of 114,763 km2 (44,310 sq mi), and its population in 2021 was estimated to be approximately 13 million. It is a tropical country with an economy heavily dependent on agriculture, and is an exporter of palm oil and cotton. From the 17th to the 19th century, political entities in the area included the Kingdom of Dahomey, the city-state of Porto-Novo, and other states to the north. This region was referred to as the Slave Coast of West Africa from the early 17th century due to the high number of people who were sold and trafficked during the Atlantic slave trade to the New World. France took over the territory in 1894, incorporating it into French West Africa as French Dahomey. In 1960, Dahomey gained full independence from France. As a sovereign state, Benin has had democratic governments, military coups, and military governments. A self-described Marxist–Leninist state called the People's Republic of Benin existed between 1975 and 1990. In 1991, it was replaced by the multi-party Republic of Benin. The official language of Benin is French, with indigenous languages such as Fon, Bariba, Yoruba and Dendi also spoken. The largest religious group in",
    "Botswana": "Botswana, officially the Republic of Botswana, is a landlocked country in Southern Africa. Botswana is topographically flat, with approximately 70 per cent of its territory part of the Kalahari Desert. It is bordered by South Africa to the south and southeast, Namibia to the west and north, Zambia to the north and Zimbabwe to the northeast. With a population of slightly over 2.4 million people and a comparable land area to France, Botswana is one of the most sparsely populated countries in the world. It is essentially the nation-state of the Tswana people, who constitute nearly 80 per cent of the population. The Tswana ethnic group are descended mainly from Bantu-speaking peoples who migrated into southern Africa, including modern Botswana, in several waves before AD 600. In 1885, the British colonised the area and declared a protectorate named Bechuanaland. As part of the Decolonisation of Africa, Bechuanaland became an independent Commonwealth republic under its current name on 30 September 1966. Since then, it has been a parliamentary republic with a consistent record of uninterrupted democratic elections, although the Botswana Democratic Party had been the only ruling party from independence until 2024. As of 2024, Botswana is the third-least corrupt country in Africa, according to the Corruption Perceptions Index published by Transparency International. The economy is dominated by mining and tourism. Botswana has a per capita GDP (purchasing power parity) of about $20,158 as of 2024. Botswana is the world's biggest diamond-producing country. Its relatively high gross national income per capita (by some estimates the fourth-largest in Africa) gives the country a relatively high standard of living and the second-highest Human Development Index of continental Sub-Saharan Africa (after South Africa). Despite this, Botswana continues to grapple with high unemployment rates. Botswana is a member of the Southern African Customs Union, the",
    "Burkina Faso": "Burkina Faso, is a landlocked country in West Africa, bordered by Mali to the northwest, Niger to the northeast, Benin to the southeast, Togo and Ghana to the south, and Ivory Coast to the southwest. It covers an area of 274,223 km2 (105,878 sq mi). In 2021, the country had an estimated population of approximately 23,674,480. Previously called the Republic of Upper Volta (1958–1984), it was renamed Burkina Faso by former president Thomas Sankara. Its citizens are known as Burkinabè, and its capital and largest city is Ouagadougou. The largest ethnic group in Burkina Faso is the Mossi people, who settled the area in the 11th and 13th centuries. They established powerful kingdoms such as the Ouagadougou, Tenkodogo, and Yatenga. In 1896, it was colonized by the French as part of French West Africa; in 1958, Upper Volta became a self-governing colony within the French Community. In 1960, it gained full independence with Maurice Yaméogo as president. Since it gained its independence, the country has been subject to instability, droughts, famines and corruption. There have also been various coups, in 1966, 1980, 1982, 1983, 1987, and twice in 2022 (January and September). There were also unsuccessful coup attempts in 1989, 2015, and 2023. Thomas Sankara came to power following a successful coup in 1983. As president, Sankara embarked on a series of ambitious socioeconomic reforms which included a nationwide literacy campaign, land redistribution to peasants, vaccinations for over 2 million children, railway and road construction, equalized access to education, and the outlawing of female genital mutilation, forced marriages, and polygamy. He served as the country's president until 1987 when he was deposed and assassinated in a coup led by Blaise Compaoré, who became president and ruled the country until his removal on 31 October 2014. Since the mid-2010s, Burkina Faso",
    "Burundi": "Burundi, officially the Republic of Burundi, is a landlocked country in the Great Rift Valley at the junction between the African Great Lakes region and Southeast Africa, with population of over 14 million people. It is bordered by Rwanda to the north, Tanzania to the east and southeast, and the Democratic Republic of the Congo to the west; Lake Tanganyika lies along its southwestern border. The capital city is Gitega and the largest city is Bujumbura. The Twa, Hutu and Tutsi peoples have lived in Burundi for at least 500 years. For more than 200 of those years, Burundi was an independent kingdom. In 1885, it became part of the German colony of German East Africa. After the First World War and Germany's defeat, the League of Nations mandated the territories of Burundi and neighboring Rwanda to Belgium in a combined territory called Rwanda-Urundi. After the Second World War, this transformed into a United Nations Trust Territory. Burundi gained independence in 1962 and initially retained the monarchy; a 1966 coup replaced the monarchy with a one-party republic. Over the next 27 years, Burundi was ruled by a series of Tutsi dictators and notably experienced a genocide of Hutus in 1972. In July 1993, Melchior Ndadaye became Burundi's first Hutu president following the country's first multi-party presidential election. His assassination three months later during a coup attempt provoked the 12-year Burundian Civil War. In 2000, the Arusha Agreement was adopted, which was largely integrated in a new constitution in 2005. Since the 2005 post-war elections, the country's dominant party has been the National Council for the Defense of Democracy – Forces for the Defense of Democracy (CNDD–FDD), widely accused of authoritarian governance and perpetuating the country's poor human rights record. Burundi remains primarily a rural society, with just 13.4% of the",
    "Cabo Verde": "Cape Verde ( , VURD(-ee)) or Cabo Verde ( KAH-boh VUR-day, KAB-oh -⁠, local Portuguese: [ˈkabu ˈveɾdɨ]), officially the Republic of Cabo Verde, is an island country and archipelagic state of West Africa in the central Atlantic Ocean, consisting of ten volcanic islands with a combined land area of about 4,033 square kilometres (1,557 sq mi). These islands lie between 600 and 850 kilometres (320 and 460 nautical miles) west of Cap-Vert, the westernmost point of continental Africa. The Cape Verde islands form part of the Macaronesia ecoregion, along with the Azores, the Canary Islands, Madeira and the Savage Isles. The Cape Verde archipelago was uninhabited until the 15th century, when Portuguese explorers discovered and colonized the islands, thus establishing the first European settlement in the tropics. Because the Cape Verde islands were conveniently located to play a role in the Atlantic slave trade, Cape Verde became economically prosperous during the 16th and 17th centuries, attracting merchants, privateers, and pirates. It declined economically in the 19th century after the suppression of the Atlantic slave trade by the British Empire, and many of its inhabitants emigrated during that period. However, Cape Verde gradually recovered economically by becoming an important commercial center and useful stopover point along major shipping routes. Cape Verde became independent in 1975. Since the early 1990s, Cape Verde has been a stable representative democracy and has remained one of the most developed and democratic countries in Africa. Lacking natural resources, its developing economy is mostly service-oriented, with a growing focus on tourism and foreign investment. Its population of around 596,000 (as of 2022) is of mostly of Sub-Saharan African and minor European heritage, and predominantly Catholic, reflecting the legacy of Portuguese rule. A sizeable Cape Verdean diaspora community exists across the world, especially in the United States and",
    "Cameroon": "Cameroon, officially the Republic of Cameroon, is a country in Central Africa. It shares boundaries with Nigeria to the west and north, Chad to the northeast, the Central African Republic to the east, and Equatorial Guinea, Gabon, and the Republic of the Congo to the south. Its coastline lies on the Bight of Biafra, part of the Gulf of Guinea, and the Atlantic Ocean. Due to its strategic position at the crossroads between West Africa and Central Africa, it has been categorized as being in both camps. Cameroon's population of nearly 31 million people speak 250 native languages, in addition to the national tongues of English and French, or both. Early inhabitants of the territory included the Sao civilisation around Lake Chad and the Baka hunter-gatherers in the southeastern rainforest. Portuguese explorers reached the coast in the 15th century and named the area Rio dos Camarões (Shrimp River), which became Cameroon in English. Fulani soldiers founded the Adamawa Emirate in the north in the 19th century, and various ethnic groups of the west and northwest established powerful chiefdoms and fondoms. Cameroon became a German colony in 1884 known as Kamerun. After World War I, it was divided between France and the United Kingdom as League of Nations mandates. France took 4/5 and the United Kingdom 1/5 of the territory and both ruled it under mandate until independence in 1960 and 1961 respectively. The Union des Populations du Cameroun (UPC) political party advocated independence but was outlawed by France in the 1950s, leading to the national liberation insurgency fought between French and UPC militant forces until early 1971. In 1960, the French-administered part of Cameroon became independent, as the Republic of Cameroun, under President Ahmadou Ahidjo. The southern part of British Cameroons federated with it in 1961 to form the Federal",
    "Central African Republic": "The Central African Republic (CAR), formerly known as Ubangi-Shari, is a landlocked country in Central Africa. It is bordered by Chad to the north, Sudan to the northeast, South Sudan to the east, the Democratic Republic of the Congo to the south, the Republic of the Congo to the southwest, and Cameroon to the west. Bangui is the country's capital and largest city, bordering the Democratic Republic of the Congo. The Central African Republic covers a land area of about 620,000 square kilometres (240,000 sq mi). As of 2024, it has a population of 5,357,744, and is in the scene of a civil war, which has been ongoing since 2012. As a former French colony, French is the official language, with Sango, a Ngbandi based-creole language as the national and co-official language. The Central African Republic mainly consists of Sudano-Guinean savannas, but the country also includes a Sahelo-Sudanian zone in the north and an equatorial forest zone in the south. Two-thirds of the country is within the Ubangi River basin (which flows into the Congo), while the remaining third lies in the basin of the Chari, which flows into Lake Chad. What is today the Central African Republic has been inhabited since at least 8,000 BCE. The country's borders were established by France, which ruled the country as a colony starting in the late 19th century. After gaining independence from France in 1960, the Central African Republic was ruled by a series of autocratic leaders, including an abortive attempt at a monarchy under the regime of Jean-Bedel Bokassa. By the 1990s, calls for democracy led to the first multi-party democratic elections in 1993. Ange-Félix Patassé became president, but was later removed by General François Bozizé in a 2003 coup. The Central African Republic Bush War began in 2004 and, despite",
    "Chad": "Chad, officially the Republic of Chad, is a landlocked country located at the crossroads of North and Central Africa. It is bordered by Libya to the north, Sudan to the east, the Central African Republic to the south, Cameroon to the southwest, Nigeria to the southwest (at Lake Chad), and Niger to the west. Chad has a population of 16 million, of which 1.6 million live in the capital and largest city of N'Djamena. With a total area of around 1,300,000 km2 (500,000 sq mi), Chad is the fifth-largest country in Africa and the twentieth largest nation by area in the world. Chad has several regions: the Sahara desert in the north, an arid zone in the centre known as the Sahel and a more fertile Sudanian Savanna zone in the south. Lake Chad, after which the country is named, is the second-largest wetland in Africa. Chad's official languages are Arabic and French. It is home to over 200 different ethnic and linguistic groups. Islam (55.1%) and Christianity (41.1%) are the main religions practiced in Chad. Beginning in the 7th millennium BC, human populations moved into the Chadian basin in great numbers. By the end of the 1st millennium AD, a series of states and empires had risen and fallen in Chad's Sahelian strip, each focused on controlling the trans-Saharan trade routes that passed through the region. France conquered the territory by 1920 and incorporated it as part of French Equatorial Africa. In 1960, Chad obtained independence under the leadership of François Tombalbaye. Resentment towards his policies in the Muslim north culminated in the eruption of a long-lasting civil war in 1965. In 1979 the rebels conquered the capital and put an end to the South's hegemony. The rebel commanders then fought amongst themselves until Hissène Habré defeated his rivals.",
    "Comoros": "The Comoros, officially the Union of the Comoros, is an archipelagic country made up of three islands in Southeastern Africa, located at the northern end of the Mozambique Channel in the Indian Ocean. Its capital and largest city is Moroni. The religion of the majority of the population, and the official state religion, is Sunni Islam. Comoros proclaimed its independence from France on 6 July 1975. The Comoros is the only country of the Arab League which is entirely in the Southern Hemisphere. It is a member state of the African Union, the Organisation internationale de la Francophonie, the Organisation of Islamic Co-operation, and the Indian Ocean Commission. The country has three official languages: Shikomori, French and Arabic. At 1,659 km2 (641 sq mi), the Comoros is the third-smallest African country by area. In 2019, its population was estimated to be 850,886. The sovereign state consists of three major islands and numerous smaller islands, all of the volcanic Comoro Islands with the exception of Mayotte. Mayotte voted against independence from France in a referendum in 1974, and continues to be administered by France as an overseas department. France has vetoed a United Nations Security Council resolution that would have affirmed Comorian sovereignty over the island. Mayotte became an overseas department and a region of France in 2011 following a referendum which was passed overwhelmingly. The Comoros were likely first settled by Austronesian/Malagasy peoples, Bantu speakers from East Africa, and seafaring Arab traders. From 1500 the Sultanate of Anjouan dominated the islands, with Grande Comore split between several sultans. It became part of the French colonial empire during the 19th century, before its independence in 1975. It has experienced more than 20 coups or attempted coups, with various heads of state assassinated. Along with this constant political instability, it has one",
    "Democratic Republic of the Congo": "DR Congo, officially the Democratic Republic of the Congo, also known as the DRC, Congo-Kinshasa or simply Congo, is a country in Central Africa. By land area the Congo is the second-largest country in Africa and the 11th-largest in the world. With a population of around 109 million, the Democratic Republic of the Congo is the most populous Francophone country in the world. The national capital and largest city is Kinshasa, which is also the economic center. The country is bordered by the Republic of the Congo, Central African Republic, South Sudan, Uganda, Rwanda, Burundi, Tanzania (across Lake Tanganyika), Zambia, Angola, the Cabinda exclave of Angola, and the South Atlantic Ocean. Centered on the Congo Basin, the territory of the Congo was first inhabited by Central African foragers around 90,000 years ago and was settled in the Bantu expansion about 3000 to 2000 years ago. In the west, the Kingdom of Kongo ruled around the mouth of the Congo River from the 14th to 19th centuries. In the center and east, the empires of Mwene Muji, Luba, and Lunda ruled from the 15th, 16th, and 17th centuries to the late 19th and early 20th centuries. King Leopold II of Belgium formally acquired rights to the Congo territory from the colonial nations of Europe in 1885 and declared the land his private property, naming it the Congo Free State. From 1885 to 1908, his colonial military forced the local population to produce rubber and committed widespread atrocities. In 1908, Leopold ceded the territory, which thus became a Belgian colony. Congo achieved independence from Belgium on 30 June 1960 and was immediately confronted by a series of secessionist movements, the assassination of Prime Minister Patrice Lumumba, and the seizure of power by Mobutu Sese Seko in a 1965 coup d'état. Mobutu renamed",
    "Republic of the Congo": "Congo, officially the Republic of the Congo or Congo Republic, also known as Congo-Brazzaville, is a country located on the western coast of Central Africa to the west of the Congo River. It is bordered to the west by Gabon, to the northwest by Cameroon, to the northeast by the Central African Republic, to the southeast by the Democratic Republic of the Congo, to the south by the Angolan exclave of Cabinda, and to the southwest by the Atlantic Ocean. The region was dominated by Bantu-speaking tribes at least 3,000 years ago, who built trade links leading into the Congo River basin. From the 13th century the present day territory was dominated by a confederation led by Vungu which included Kakongo and Ngoyo. Loango emerged in the 16th century. In the late 19th century France colonised the region and incorporated it into French Equatorial Africa. The Republic of the Congo was established on 28 November 1958 and gained independence from France in 1960. It was a Marxist–Leninist state from 1969 to 1992, under the name People's Republic of the Congo (PRC). The country has had multi-party elections since 1992, but a democratically elected government was ousted in the 1997 Republic of the Congo Civil War. President Denis Sassou Nguesso, who first came to power in 1979, ruled until 1992 and then again since after his reinstatement. The Republic of the Congo is a member of the African Union, the United Nations, La Francophonie, the Economic Community of Central African States, and the Non-Aligned Movement. It has become the 4th-largest oil producer in the Gulf of Guinea, providing the country with a degree of prosperity, with political and economic instability in some areas, and unequal distribution of oil revenue nationwide. Its economy is dependent on the oil sector. and economic growth",
    "Djibouti": "Djibouti, officially the Republic of Djibouti, is a country in the Horn of Africa, bordered by Somalia to the south, Ethiopia to the southwest, Eritrea in the north, and the Red Sea and the Gulf of Aden to the east. The country has an area of 23,200 km2 (8,958 sq mi). In antiquity, the territory, together with Ethiopia, Eritrea and Somaliland, was part of the Land of Punt. Nearby Zeila, now in Somaliland, was the seat of the medieval Adal and Ifat Sultanates. In the late 19th century, the colony of French Somaliland was established after the ruling Dir Somali and Afar sultans signed treaties with the French, and its railroad to Dire Dawa (and later Addis Ababa) allowed it to quickly supersede Zeila as the port for southern Ethiopia and the Ogaden. It was renamed the French Territory of the Afars and the Issas in 1967. A decade later, the Djiboutian people voted for independence. This officially marked the establishment of the Republic of Djibouti, named after its capital city. The new state joined the United Nations in its first year. In the early 1990s, tensions over government representation led to armed conflict, which ended in a power-sharing agreement in 2000 between the ruling party and the opposition. Djibouti is a multi-ethnic nation with a population of 1,066,809 at the Census held on 20 May 2024 (the smallest in mainland Africa). French and Arabic are its two official languages, Afar and Somali are national languages. About 94% of Djiboutians adhere to Islam, which is the official religion and has been predominant in the region for more than 1,000 years. The Somalis and Afar make up the two largest ethnic groups, with the former comprising the majority of the population. Both speak a language of the Cushitic branch of the",
    "Egypt": "Egypt (Arabic: مصر Miṣr [mesˁr], Egyptian Arabic pronunciation: [mɑsˤr]), officially the Arab Republic of Egypt, is a transcontinental country spanning the northeast corner of Africa and the Sinai Peninsula in the southwest corner of Asia. It is bordered by the Mediterranean Sea to the north, the Gaza Strip of Palestine and Israel to the northeast, the Red Sea to the east, Sudan to the south, and Libya to the west. The Gulf of Aqaba in the northeast separates Egypt from Jordan and Saudi Arabia. Cairo is the capital and largest city of Egypt, while Alexandria, the second-largest city, is an important industrial and tourist hub at the Mediterranean coast. At approximately 110 million inhabitants, Egypt is the 14th-most populated country in the world, and the third-most populated in Africa. Egypt has one of the longest histories of any country, tracing its heritage along the Nile Delta back to the 6th–4th millennia BCE. Considered a cradle of civilisation, Ancient Egypt saw some of the earliest developments of writing, agriculture, urbanisation, organised religion and central government. Egypt was an early and important centre of Christianity, later adopting Islam from the seventh century onwards. Cairo became the capital of the Fatimid Caliphate in the tenth century, and of the Mamluk Sultanate in the 13th century. Egypt then became part of the Ottoman Empire in 1517, before its local ruler Muhammad Ali established modern Egypt as an autonomous Khedivate in 1867. The country was then occupied by the British Empire and gained independence in 1922 as a monarchy. Following the 1952 revolution, Egypt declared itself a republic. For a brief period between 1958 and 1961 Egypt merged with Syria to form the United Arab Republic. Egypt fought several armed conflicts with Israel in 1948, 1956, 1967 and 1973, and occupied the Gaza Strip intermittently",
    "Equatorial Guinea": "Equatorial Guinea, officially the Republic of Equatorial Guinea, is a country on the west coast of Central Africa, with an area of 28,000 square kilometres (11,000 sq mi). Formerly the colony of Spanish Guinea, its post-independence name refers to its location near both the Equator and in the African region of Guinea. As of 2024, the country had a population of 1,795,834, over 85% of whom are members of the Fang people, the country's dominant ethnic group. The Bubi people, indigenous to Bioko, are the second largest group at approximately 6.5% of the population. Equatorial Guinea consists of two parts, an insular and a mainland region. The insular region consists of the islands of Bioko (formerly Fernando Pó) in the Gulf of Guinea and Annobón, a small volcanic island which is the only part of the country south of the equator. Bioko Island is the northernmost part of Equatorial Guinea and is the site of the country's capital, Malabo. The Portuguese-speaking island nation of São Tomé and Príncipe is located between Bioko and Annobón. The mainland region, Río Muni, is bordered by Cameroon to the north and Gabon to the south and east. It is the location of Bata, Equatorial Guinea's second largest city, and Ciudad de la Paz, the country's planned future capital. Río Muni also includes several small offshore islands, such as Corisco, Elobey Grande, and Elobey Chico. The country is a member of the African Union, Francophonie, OPEC, and the CPLP. After becoming independent from Spain in 1968, Equatorial Guinea was ruled by Francisco Macías Nguema. He declared himself president for life in 1972, but was overthrown in a coup in 1979 by his nephew, Teodoro Obiang Nguema Mbasogo, who has served as the country's president since. Both presidents have been widely characterized as dictators by foreign",
    "Eritrea": "Eritrea ( ERR-ih-TREE-ə or -⁠TRAY-; Tigrinya: ኤርትራ, romanized: Ertra, Arabic: إريتريا, romanized: Erytrya pronounced [ʔer(ɨ)trä] ), officially the State of Eritrea, is a country in the Horn of Africa region of Eastern Africa, with its capital and largest city being Asmara. It is bordered by Ethiopia in the south, Sudan in the west, and Djibouti in the southeast. The northeastern and eastern parts of Eritrea have an extensive coastline along the Red Sea. The nation has a total area of approximately 117,600 km2 (45,406 sq mi), and includes the Dahlak Archipelago and several of the Hanish Islands. Human remains found in Eritrea have been dated to 1 million years old and anthropological research indicates that the area may contain significant records related to the evolution of humans. The Kingdom of Aksum, covering much of modern-day Eritrea and northern Ethiopia, was established during the first or second century AD. It adopted Christianity around the middle of the fourth century. Beginning in the 12th century, the Ethiopian Zagwe and Solomonid dynasties held sway to a fluctuating extent over the entire plateau and the Red Sea coast. Eritrea's central highlands, known as Mereb Melash (\"Beyond the Mereb\"), were the northern frontier region of the Ethiopian kingdoms and were ruled by a governor titled the Bahri Negasi (\"lord of the sea\"). In the 16th century, the Ottomans conquered the Eritrean coastline, then in May 1865 much of the coastal lowlands came under the rule of the Khedivate of Egypt, until it was transferred to Italy in February 1885. Beginning in 1885–1890, Italian troops systematically spread out from Massawa toward the highlands, eventually resulting in the formation of the colony of Italian Eritrea in 1889, establishing the present-day boundaries of the country. Italian rule continued until 1942 when Eritrea was placed under British Military Administration",
    "Eswatini": "Eswatini ( ESS-wah-TEE-nee; Swazi: eSwatini [ɛswáˈtʼiːni]), formally the Kingdom of Eswatini and also known by its former official name Swaziland ( SWAH-zee-land) and formerly the Kingdom of Swaziland, is a landlocked country in Southern Africa. It is bordered by Mozambique to its northeast and South Africa to its north, west, south, and southeast. At no more than 200 km (120 mi) north to south and 130 km (81 mi) east to west, Eswatini is one of the smallest countries in Africa; despite this, its climate and topography are diverse, ranging from a cool and mountainous highveld to a hot and dry lowveld. The population is composed primarily of ethnic Swazis. The prevalent language is Swazi (siSwati in native form). The Swazis established their kingdom in the mid-18th century under the leadership of Ngwane III. The country and the Swazi take their names from Mswati II, the 19th-century king under whose rule the country was expanded and unified; its boundaries were drawn up in 1881 in the midst of the Scramble for Africa. After the Second Boer War, the kingdom, under the name of Swaziland, was a British high commission territory from 1903 until it regained its full independence on 6 September 1968. In April 2018, the official name was changed from Kingdom of Swaziland to Kingdom of Eswatini, mirroring the name commonly used in Swazi. Eswatini is a developing country that is classified as having a lower-middle income economy. As a member of the Southern African Customs Union and the Common Market for Eastern and Southern Africa, its main local trading partner is South Africa; to ensure economic stability, Eswatini's currency, the lilangeni, is pegged to the South African rand. Eswatini's major overseas trading partners are the United States and the European Union. The majority of the country's employment is",
    "Ethiopia": "Ethiopia, officially the Federal Democratic Republic of Ethiopia, is a landlocked country located in the Horn of Africa region of East Africa. It shares borders with Eritrea to the north, Djibouti to the northeast, Somalia to the East, Kenya to the South, South Sudan to the West, and Sudan to the Northwest. Ethiopia covers a land area of 1,104,300 square kilometres (1,104,300 square kilometres (426,400 sq mi)). As of 2024, it is home to around 132 million inhabitants, making it the 10th-most populous country in the world, the 2nd-most populous in Africa after Nigeria, and the most populated landlocked country on Earth. The national capital and largest city, Addis Ababa, lies several kilometres west of the East African Rift that splits the country into the African and Somali tectonic plates. Anatomically modern humans emerged from modern-day Ethiopia and set out for the Near East and elsewhere in the Middle Paleolithic period. Southwestern Ethiopia has been proposed as a possible homeland of the Afroasiatic language family. In 980 BC, the Kingdom of D'mt extended its realm over Eritrea and the northern region of Ethiopia, while the Kingdom of Aksum maintained a unified civilization in the region for 900 years. Christianity was embraced by the kingdom in 330, and Islam arrived by the first Hijra in 615. After the collapse of Aksum in 960, the Zagwe dynasty ruled the north-central parts of Ethiopia until being overthrown by Yekuno Amlak in 1270, inaugurating the Ethiopian Empire and the Solomonic dynasty, claimed descent from the biblical Solomon and Queen of Sheba under their son Menelik I. By the 14th century, the empire had grown in prestige through territorial expansion and fighting against adjacent territories; most notably, the Ethiopian–Adal War (1529–1543) contributed to fragmentation of the empire, which ultimately fell under a decentralization known as",
    "Gabon": "Gabon ( gə-BON; French pronunciation: [ɡabɔ̃] ), officially the Gabonese Republic, is a country on the Atlantic coast of Central Africa, on the equator, bordered by Equatorial Guinea to the northwest, Cameroon to the north, the Republic of the Congo on the east and south, and the Gulf of Guinea to the west. It has an area of 270,000 square kilometres (100,000 sq mi) and a population of 2.3 million people. There are coastal plains, mountains (the Cristal Mountains and the Chaillu Massif in the centre), and a savanna in the east. Libreville is the country's capital and largest city. Gabon's original inhabitants were the pygmy peoples. Beginning in the 14th century, Bantu migrants began settling in the area as well. The Kingdom of Orungu was established around 1700. The region was colonised by France in the late 19th century. Since its independence from France in 1960, Gabon has had three presidents. In the 1990s, it introduced a multi-party system and a democratic constitution that aimed for a more transparent electoral process and reformed some governmental institutions. Despite this, the Gabonese Democratic Party (PDG) remained the dominant party until its removal from the 2023 Gabonese coup d'état. Gabon is a developing country, ranking 123rd in the Human Development Index. It is one of the wealthiest countries in Africa in terms of per capita income; however, large parts of the population are very poor. Omar Bongo came to office in 1967 and created a dynasty, which stabilized its power through a clientist network, Françafrique. The official language of Gabon is French, and Bantu ethnic groups constitute around 95% of the country's population. Christianity is the nation's predominant religion, practised by about 80% of the population. With petroleum and foreign private investment, it has the fourth highest HDI (after Mauritius, Seychelles, and",
    "Gambia": "The Gambia, officially the Republic of The Gambia, is a country in West Africa. Geographically, The Gambia is the smallest country in continental Africa; it is surrounded by Senegal on all sides except for the western part, which is bordered by the Atlantic Ocean. Its territory is on both sides of the lower reaches of the Gambia River, which flows through the centre of the country and empties into the Atlantic. The national namesake river demarcates the elongated shape of the country, which has an area of 11,300 square kilometres (4,400 sq mi) and a population of 2,769,075 people in 2024 which is a 2.30% population increase from 2013. The capital city is Banjul, which has the most extensive metropolitan area in the country. The second and third-largest cities are Serekunda and Brikama. Arab Muslim merchants traded with native West Africans in The Gambia throughout the 9th and 10th centuries. In 1455, the Portuguese were the first Europeans to enter The Gambia, although they never established significant trade there. The British Empire established a colony in 1765. In 1965, 200 years later, The Gambia gained independence under the leadership of Dawda Jawara. Yahya Jammeh seized power in a bloodless 1994 coup. Adama Barrow was elected as The Gambia's third president in the December 2016, he defeated Yahya Jammeh with the help of a coalition of other opposition political parties. Jammeh initially accepted the results, but then refused to leave office, triggering a constitutional crisis. The Economic Community of West African States (ECOWAS) conducted a military intervention and achieved Jammeh's removal two days after his term was initially scheduled to end. The Gambia's economy is dominated by farming, fishing, and especially tourism. In 2022, 17.2% of the population lived in extreme poverty, defined as living on less than US$2.15 (2017 PPP)",
    "Ghana": "Ghana, officially the Republic of Ghana, is a country in West Africa. It lies adjacent to the Gulf of Guinea and the Atlantic Ocean to the south, sharing a border with Ivory Coast in the west, Burkina Faso in the north, and Togo in the east. Ghana covers an area of 239,567 km2 (92,497 sq mi), spanning diverse ecologies, from coastal savannas to tropical rainforests. With nearly 35 million inhabitants, Ghana is the second-most populous country in West Africa. The capital and largest city is Accra; other significant cities include Kumasi, Tamale, and Sekondi-Takoradi. In 1957 Ghana became the first colony in Sub-Saharan Africa to achieve sovereignty, under the leadership of Kwame Nkrumah. The earliest kingdoms to emerge in Ghana were the Kingdom of Dagbon in the north and the Bonoman in the south, with Bonoman existing in the area during the 11th century. The Ashanti Empire and other Akan kingdoms in the south emerged over the centuries. Beginning in the 15th century, the Portuguese Empire, followed by other European powers, contested the area for trading rights, until the British ultimately established control of the coast by the 19th century. Following more than a century of colonial resistance, the current borders of the country took shape, encompassing four separate British colonial territories: Gold Coast, Ashanti, the Northern Territories, and British Togoland. These were unified as an independent dominion within the Commonwealth of Nations. On 6 March 1957 Ghana became the first colony in Sub-Saharan Africa to achieve sovereignty - that is, gain independence. Under President Kwame Nkrumah, it became influential in decolonisation efforts and the Pan-African movement. Ghana is a multi-ethnic country with linguistic and religious groups; while the Akan are the largest ethnic group, they constitute a plurality. Most Ghanaians are Christians (71.3%); almost a fifth are Muslims; a",
    "Guinea": "Guinea ( GHIN-ee), officially the Republic of Guinea (French: République de Guinée), is a coastal country in West Africa. It borders the Atlantic Ocean to the west, Guinea-Bissau to the northwest, Senegal to the north, Mali to the northeast, Côte d'Ivoire to the southeast, and Sierra Leone and Liberia to the south. It is sometimes referred to as Guinea-Conakry, after its capital Conakry, to distinguish it from other territories in the eponymous region, such as Guinea-Bissau and Equatorial Guinea. Guinea has a population of 14 million and an area of 245,857 square kilometres (94,926 sq mi). Formerly French Guinea, it achieved independence in 1958. Guinea has a history of military coups d'état. After decades of authoritarian rule, it held its first democratic election in 2010. As it continued to hold multi-party elections, the country still faces ethnic conflicts, corruption, and abuses by the military and police. In 2011, the United States government claimed that torture by security forces and abuse of women and children (including female genital mutilation) were ongoing human rights issues. In 2021, a military faction overthrew president Alpha Condé and suspended the constitution. Muslims represent 90% of the population. The country is divided into four geographic regions: Maritime Guinea on the Atlantic coast, the Fouta Djallon or Middle Guinea highlands, the Upper Guinea savanna region in the northeast, and the Guinée forestière region of tropical forests. French, the official language of Guinea, is a language of communication in schools, government administration, and the media. More than 24 indigenous languages are spoken, and the largest are Susu, Pular, and Maninka, which dominate respectively in Maritime Guinea, Fouta Djallon, and Upper Guinea, while Guinée forestière is ethnolinguistically diverse. Guinea's economy is mostly dependent on agriculture and mineral production. It is the world's second-largest producer of bauxite and has deposits",
    "Guinea-Bissau": "Guinea-Bissau ( ; Portuguese: Guiné-Bissau; Fula: 𞤘𞤭𞤲𞤫 𞤄𞤭𞤧𞤢𞥄𞤱𞤮, romanized: Gine-Bisaawo; Mandinka: ߖߌ߬ߣߍ߫ ߓߌߛߊߥߏ߫ Gine-Bisawo), officially the Republic of Guinea-Bissau (Portuguese: República da Guiné-Bissau [ʁɛˈpuβlikɐ ðɐ ɣiˈnɛ βiˈsaw]), is a country in West Africa that covers 36,125 square kilometres (13,948 sq mi) with an estimated population of 2,026,778. It borders Senegal to its north and Guinea to its southeast. Guinea-Bissau was once part of the kingdom of Kaabu, as well as part of the Mali Empire. Parts of this kingdom persisted until the 18th century, while a few others had been under some rule by the Portuguese Empire since the 16th century. In the 19th century, it was colonised as Portuguese Guinea. Portuguese control was restricted and weak until the early 20th century, when its pacification campaigns solidified Portuguese sovereignty in the area. The final Portuguese victory over the last remaining bastion of mainland resistance came in 1915, with the conquest of the Papel-ruled Kingdom of Bissau by the Portuguese military officer Teixeira Pinto and the Wolof mercenary Abdul Injai. The Bissagos, islands off the coast of Guinea-Bissau, were officially conquered in 1936, ensuring Portuguese control of both the mainland and islands of the region. Upon independence, declared in 1973 and recognised in 1974, the name of its capital, Bissau, was added to the country's name to prevent confusion with Guinea (formerly French Guinea). Guinea-Bissau has had a history of political instability since independence. The current president is Umaro Sissoco Embaló, who was elected on 29 December 2019. About 2% of the population speaks Portuguese, the official language, as a first language, and 33% speak it as a second language. Guinea-Bissau Creole, a Portuguese-based creole, is the national language and also considered the language of unity. According to a 2012 study, 54% of the population speak Creole as a first language",
    "Ivory Coast": "Ivory Coast, also known as Côte d'Ivoire and officially the Republic of Côte d'Ivoire, is a country on the southern coast of West Africa. Its capital city of Yamoussoukro is located in the centre of the country, while its largest city and economic centre is the port city of Abidjan. It borders Guinea to the northwest, Liberia to the west, Mali to the northwest, Burkina Faso to the northeast, Ghana to the east, and the Atlantic Ocean's Gulf of Guinea to the south. With 30.9 million inhabitants in 2023, Ivory Coast is the third-most populous country in West Africa. Its official language is French, and indigenous languages are also widely used, including Bété, Baoulé, Dyula, Dan, Anyin, and Cebaara Senufo. In total, there are around 78 different languages spoken in Ivory Coast. The country has a religiously diverse population, including numerous followers of Islam, Christianity, and traditional faiths often entailing animism. Before its colonization, Ivory Coast was home to several states, including Gyaaman, the Kong Empire, and Baoulé. The area became a protectorate of France in 1843 and was consolidated as a French colony in 1893 amid the Scramble for Africa. It achieved independence in 1960, led by Félix Houphouët-Boigny, who ruled the country until 1993. Relatively stable by regional standards, Ivory Coast established close political-economic ties with its West African neighbours while maintaining close relations with the West, especially France. Its stability was diminished by a coup d'état in 1999 and two civil wars—first between 2002 and 2007 and again during 2010–2011. It adopted a new constitution in 2016. Ivory Coast is a republic with strong executive power vested in its president. Through the production of coffee and cocoa, it was an economic powerhouse in West Africa during the 1960s and 1970s, then experienced an economic crisis in the",
    "Kenya": "Kenya, officially the Republic of Kenya (Swahili: Jamhuri ya Kenya), is a country in East Africa. With a population of more than 47.6 million in the 2019 census, Kenya is the 28th-most-populous country in the world and 7th most populous in Africa. Kenya's capital and largest city is Nairobi, while its oldest and second-largest city, is the major port city of Mombasa, situated on Mombasa Island in the Indian Ocean and the surrounding mainland. Mombasa was the capital of the British East Africa Protectorate, which included most of what is now Kenya and southwestern Somalia, from 1889 to 1907. Other important cities include Kisumu and Nakuru. Kenya is bordered by South Sudan to the northwest, Ethiopia to the north, Somalia to the east, Uganda to the west, Tanzania to the south, and the Indian Ocean to the southeast. Kenya's geography, climate and population vary widely, ranging from cold snow-capped mountaintops (Batian, Nelion and Point Lenana on Mount Kenya) with vast surrounding forests, wildlife and fertile agricultural regions to temperate climates in western and rift valley counties and further on to dry less fertile arid and semi-arid areas and absolute deserts (Chalbi Desert and Nyiri Desert). Kenya's earliest inhabitants were hunter-gatherers, like the present-day Hadza people. According to archaeological dating of associated artifacts and skeletal material, Cushitic speakers first settled in Kenya's lowlands between 3,200 and 1,300 BC, a phase known as the Lowland Savanna Pastoral Neolithic. Nilotic-speaking pastoralists (ancestral to Kenya's Nilotic speakers) began migrating from present-day South Sudan into Kenya around 500 BC. Bantu people settled at the coast and the interior between 250 BC and 500 AD. European contact began in 1500 AD with the Portuguese Empire, and effective colonisation of Kenya began in the 19th century during the European exploration of Africa. Modern-day Kenya emerged from a",
    "Lesotho": "Lesotho ( lih-SOO-too, Sotho pronunciation: [lɪˈsʊːtʰʊ]), formally the Kingdom of Lesotho, formerly known as Basutoland, is a landlocked country in Southern Africa. As an enclave of South Africa, with which it shares a 1,106 km (687 mi) border, it is the largest sovereign enclave in the world, and the only one outside of the Italian Peninsula. It is situated in the Maloti Mountains and contains the highest peak in Southern Africa. It has an area of over 30,000 km2 (11,600 sq mi) and has a population of about two million. Its capital and largest city is Maseru. The country is also known by the nickname The Mountain Kingdom. The Sotho ethnic group (also known as Basotho), from which the country derives its name, composes 99.7% of the country's current population, making it one of the most ethnically homogeneous in the world. Their native language, Sesotho, is the official language along with English. The name Lesotho translates to \"land of the Sesotho speakers\". Lesotho was formed in 1824 by King Moshoeshoe I. Continuous encroachments by Dutch settlers made the King enter into an agreement with the British Empire to become a protectorate in 1868 and, in 1884, a crown colony. It achieved independence in 1966, and was subsequently ruled by the Basotho National Party (BNP) for two decades. Its constitutional government was restored in 1993 after seven years of military rule. King Moshoeshoe II was exiled in 1990 but returned in 1992 and was reinstated in 1995. One year later, Moshoeshoe II died and his son Letsie III took the throne, which he still holds. Lesotho is considered a lower middle income country with significant socioeconomic challenges. Almost half of its population is below the poverty line, and the country's HIV/AIDS prevalence rate is the second-highest in the world. However, it",
    "Liberia": "Liberia ( ), officially the Republic of Liberia, is a country on the West African coast. It is bordered by Sierra Leone to its northwest, Guinea to its north, Ivory Coast to its east, and the Atlantic Ocean to its south and southwest. It has a population of around 5.5 million and covers an area of 43,000 square miles (111,369 km2). The official language is English. Over 20 indigenous languages are spoken, reflecting the country's ethnic and cultural diversity. The capital and largest city is Monrovia. Liberia began in the early 19th century as a project of the American Colonization Society (ACS), which believed that black people would face better chances for freedom and prosperity in Africa than in the United States. Between 1822 and the outbreak of the American Civil War in 1861, more than 15,000 freed and free-born African Americans, along with 3,198 Afro-Caribbeans, relocated to Liberia. Gradually developing an Americo-Liberian identity, the settlers carried their culture and tradition with them while colonizing the indigenous population. Led by the Americo-Liberians, Liberia declared independence on July 26, 1847, which the U.S. did not recognize until February 5, 1862. Liberia was the first African republic to proclaim its independence and is Africa's first and oldest modern republic. Along with Ethiopia, it was one of the two African countries to maintain its sovereignty and independence during the European colonial \"Scramble for Africa\". During World War II, Liberia supported the U.S. war effort against Nazi Germany and in turn received considerable American investment in infrastructure, which aided the country's wealth and development. President William Tubman encouraged economic and political changes that heightened the country's prosperity and international profile; Liberia was a founding member of the League of Nations, United Nations, and the Organisation of African Unity. The Americo-Liberian settlers did not relate",
    "Libya": "Libya, officially the State of Libya, is a country in the Maghreb region of North Africa. It borders the Mediterranean Sea to the north, Egypt to the east, Sudan to the southeast, Chad to the south, Niger to the southwest, Algeria to the west, and Tunisia to the northwest, as well as maritime borders with Greece, Italy and Malta to the north. Libya comprises three historical regions: Tripolitania, Fezzan, and Cyrenaica. With an area of almost 1.8 million km2 (700,000 sq mi), it is the fourth-largest country in Africa and the Arab world, and the 16th-largest in the world. Libya claims 32,000 square kilometres of southeastern Algeria, south of the Libyan town of Ghat. The country's official religion is Islam, with 96.6% of the Libyan population being Sunni Muslims. The official language of Libya is Arabic, with vernacular Libyan Arabic being spoken most widely. The majority of Libya's population is Arab. The largest city and capital, Tripoli, is located in northwestern Libya and contains over a million of Libya's seven million people. Libya has been inhabited by Berbers since the late Bronze Age as descendants from Iberomaurusian and Capsian cultures. In classical antiquity, the Phoenicians established city-states and trading posts in western Libya, while several Greek cities were established in the East. Parts of Libya were variously ruled by Carthaginians, Numidians, Persians, and Greeks before the entire region becoming a part of the Roman Empire. Libya was an early centre of Christianity. After the fall of the Western Roman Empire, the area of Libya was mostly occupied by the Vandals until the 7th century when invasions brought Islam to the region. From then on, centuries of Arab migration to the Maghreb shifted the demographic scope of Libya in favour of Arabs. In the 16th century, the Spanish Empire and the",
    "Madagascar": "Madagascar, officially the Republic of Madagascar, is an island country comprising the island of Madagascar and numerous smaller peripheral islands. Lying off the southeastern coast of Africa, it is the world's fourth largest island, the second-largest island country and the 46th largest country in the world. Its capital and largest city is Antananarivo. Following the prehistoric breakup of the supercontinent Gondwana, Madagascar split from Africa during the Early Jurassic, around 180 million years ago, and split from the Indian subcontinent around 90 million years ago, allowing native plants and animals to evolve in relative isolation; consequently, it is a biodiversity hotspot and one of the world's 17 megadiverse countries, with over 90% of wildlife being endemic. The island has a subtropical to tropical maritime climate. Madagascar was first settled during or before the mid-first millennium AD by Austronesian peoples, presumably arriving on outrigger canoes from present-day Indonesia. These were joined around the ninth century AD by Bantu migrants crossing the Mozambique Channel from East Africa. Other groups continued to settle on Madagascar over time, each one making lasting contributions to Malagasy cultural life. Consequently, there are 18 or more classified peoples of Madagascar, the most numerous being the Merina of the central highlands. Until the late 18th century, the island of Madagascar was ruled by a fragmented assortment of shifting sociopolitical alliances. Beginning in the early 19th century, most of it was united and ruled as the Kingdom of Madagascar by a series of Merina nobles. The monarchy was ended in 1897 by the annexation by France, from which Madagascar gained independence in 1960. The country has since undergone four major constitutional periods, termed republics, and has been governed as a constitutional democracy since 1992. Following a political crisis and military coup in 2009, Madagascar underwent a protracted transition towards",
    "Malawi": "Malawi (; lit. 'flames' in Chichewa and Chitumbuka), officially the Republic of Malawi and formerly known as Nyasaland, is a landlocked country in Southeastern Africa. It is bordered by Zambia to the west, Tanzania to the north and northeast, and Mozambique to the east, south, and southwest. Malawi spans over 118,484 km2 (45,747 sq mi) and has an estimated population of 21,240,689 (as of 2024). Malawi's capital and largest city is Lilongwe. Its second-largest is Blantyre, its third-largest is Mzuzu, and its fourth-largest is Zomba, the former capital. The part of Africa now known as Malawi was settled around the 10th century by migrating Bantu groups. They formed the Maravi kingdom which flourished from the 16th century. In 1891, the area was colonised by the British as the British Central African Protectorate, and it was renamed Nyasaland in 1907. In 1964, the protectorate was ended: Nyasaland became an independent country as a Commonwealth realm under Prime Minister Hastings Banda, and was renamed Malawi. Two years later, Banda became president by converting the country into a one-party presidential republic. Banda was declared President for life in 1971, and Malawi's next few decades of independence were characterized by Banda's highly repressive dictatorship. Following the introduction of a multiparty system in 1993, Banda lost the 1994 general election. Today, Malawi has a democratic, multi-party republic headed by an elected president. According to the 2024 V-Dem Democracy indices, Malawi is ranked 74th electoral democracy worldwide and 11th electoral democracy in Africa. The country maintains positive diplomatic relations with most countries, and participates in several international organisations, including the United Nations, the Commonwealth of Nations, the Southern African Development Community (SADC), the Common Market for Eastern and Southern Africa (COMESA), and the African Union (AU). Malawi is one of the world's least-developed countries. The economy",
    "Mali": "Mali, officially the Republic of Mali, is a landlocked country in West Africa. It is the eighth-largest country in Africa, with an area of over 1,241,238 square kilometres (479,245 sq mi). The country is bordered to the north by Algeria, to the east by Niger, to the northwest by Mauritania, to the south by Burkina Faso and Ivory Coast, and to the west by Guinea and Senegal. The population of Mali is 24,478,595, 47.19% of which are estimated to be under the age of 15 in 2024. Its capital and largest city is Bamako. The country has 13 official languages, of which Bambara is the most commonly spoken. The sovereign state's northern borders reach deep into the middle of the Sahara Desert. The country's southern part, where the majority of inhabitants live, is in the Sudanian savanna and has the Niger and Senegal rivers running through it. The country's economy centres on agriculture and mining with its most prominent natural resources including gold (of which it is the third largest producer in Africa) and salt. Mali was part of three successive powerful and wealthy West African empires that controlled trans-Saharan trade: the Ghana Empire (for which Ghana is named), the Mali Empire (for which Mali is named), and the Songhai Empire. At its peak in 1300, the Mali Empire was the wealthiest country in Africa with its 14th-century emperor Mansa Musa believed to be one of the wealthiest individuals in history. Besides being a hub of trade and mining, medieval Mali was a centre of Islam, culture and knowledge, with Timbuktu becoming a renowned place of learning with its university, one of the oldest in the world and still active. The expanding Songhai Empire absorbed the empire in 1468, followed by a Saadian army which defeated the Songhai in 1591.",
    "Mauritania": "Mauritania, formally the Islamic Republic of Mauritania, is a sovereign country in Northwest Africa. It is bordered by the Atlantic Ocean to the west, Western Sahara to the north and northwest, Algeria to the northeast, Mali to the east and southeast, and Senegal to the southwest. By land area Mauritania is the 11th-largest country in Africa and 28th-largest in the world; 90% of its territory is in the Sahara. Most of its population of some 4.3 million lives in the temperate south of the country, with roughly a third concentrated in the capital and largest city, Nouakchott, on the Atlantic coast. The country's name derives from Mauretania, the Latin name for a region in the ancient Maghreb. It extended from central present-day Algeria to the Atlantic. Berbers occupied what is now Mauritania by beginning of the third century AD. Groups of Arab tribes migrated to this area in the late seventh century, bringing with them Islam, Arab culture, and the Arabic language. In the early 20th century, Mauritania was colonized by France as part of French West Africa. It achieved independence in 1960, but has since experienced recurrent coups and periods of military dictatorship. The 2008 Mauritanian coup d'état was led by General Mohamed Ould Abdel Aziz, who won subsequent presidential elections in 2009 and 2014. He was succeeded by General Mohamed Ould Ghazouani following the 2019 elections, head of an autocratic government with a very poor human rights record, particularly because of its perpetuation of slavery; the 2018 Global Slavery Index estimates there are about 90,000 slaves in the country (or 2.1% of the population).. Despite an abundance of natural resources, including iron ore and petroleum, Mauritania remains poor; its economy is based primarily on agriculture, livestock, and fishing. Mauritania is culturally and politically part of the Arab world;",
    "Mauritius": "Mauritius, officially the Republic of Mauritius, is an island country in the Indian Ocean, about 2,000 kilometres (1,100 nautical miles) off the southeastern coast of East Africa, east of Madagascar. It includes the main island (also called Mauritius), as well as Rodrigues, Agaléga, and St. Brandon (Cargados Carajos shoals). The islands of Mauritius and Rodrigues, along with nearby Réunion (a French overseas department), are part of the Mascarene Islands. The main island of Mauritius, where the population is concentrated, hosts the capital and largest city, Port Louis. The country spans 2,040 square kilometres (790 sq mi) and has an exclusive economic zone covering 2,300,000 square kilometres (670,000 square nautical miles). Based on the only surviving map of the Portuguese discoveries dated 1502 called the Cantino planisphere, it is generally accepted that Arab sailors first discovered the uninhabited island, around 975, naming it Dina Arobi. In 1507, Portuguese sailors visited the uninhabited island, which bore the Portuguese names Cirne or Do-Cerne on early Portuguese maps. A Dutch fleet, under the command of Admiral Van Warwyck, landed at what is now the Grand Port District and took possession of the island in 1598, renaming the uninhabited islands after Maurice, Prince of Orange. A succession of short-lived Dutch attempts at permanent settlement took place over a century with the aim of exploiting the local ebony forests, establishing a consistent sugar and arrack production using cane plant cuttings imported from Java together with over three hundred Malagasy slaves, before abandoning their efforts. France took the uninhabited island in 1715, renaming the island \"Isle de France\". In 1810, the United Kingdom seized the island, and four years later, under the Treaty of Paris, France ceded Mauritius and its dependencies to the United Kingdom. The British colony of Mauritius now included Rodrigues, Agaléga, St. Brandon, the",
    "Morocco": "Morocco, officially the Kingdom of Morocco, is a country in the Maghreb region of North Africa. It overlooks the Mediterranean Sea to the north and the Atlantic Ocean to the west, and has land borders with Algeria to the east, and the disputed territory of Western Sahara to the south. Morocco also claims the Spanish exclaves of Ceuta, Melilla and Peñón de Vélez de la Gomera, and several small Spanish-controlled islands off its coast. It has a population of approximately 37 million. Islam is both the official and predominant religion, while Arabic and Berber are the official languages. Additionally, French and the Moroccan dialect of Arabic are widely spoken. The culture of Morocco is a mix of Arab, Berber, African and European cultures. Its capital is Rabat, while its largest city is Casablanca. The region constituting Morocco has been inhabited since the Paleolithic era over 300,000 years ago. The Idrisid dynasty was established by Idris I in 788 and was subsequently ruled by a series of other independent dynasties, reaching its zenith as a regional power in the 11th and 12th centuries, under the Almoravid and Almohad dynasties, when it controlled most of the Iberian Peninsula and the Maghreb. Centuries of Arab migration to the Maghreb since the 7th century shifted the demographic scope of the region. In the 15th and 16th centuries, Morocco faced external threats to its sovereignty, with Portugal seizing some territory and the Ottoman Empire encroaching from the east. The Marinid and Saadi dynasties otherwise resisted foreign domination, and Morocco was the only North African nation to escape Ottoman dominion. The 'Alawi dynasty, which rules the country to this day, seized power in 1631, and over the next two centuries expanded diplomatic and commercial relations with the Western world. Morocco's strategic location near the mouth of",
    "Mozambique": "Mozambique, officially the Republic of Mozambique, is a country located in southeast Africa bordered by the Indian Ocean to the east, Tanzania to the north, Malawi and Zambia to the northwest, Zimbabwe to the west, and Eswatini and South Africa to the southwest. The sovereign state is separated from the Comoros, Mayotte and Madagascar by the Mozambique Channel to the east. The capital and largest city is Maputo. Between the 7th and 11th centuries, a series of Swahili port towns developed on that area, which contributed to the development of a distinct Swahili culture and dialect. In the late medieval period, these towns were frequented by traders from Somalia, Ethiopia, Egypt, Arabia, Persia, and India. The voyage of Vasco da Gama in 1498 marked the arrival of the Portuguese, who began a gradual process of colonisation and settlement in 1505. After over four centuries of Portuguese rule, Mozambique gained independence in 1975, becoming the People's Republic of Mozambique shortly thereafter. After only two years of independence, the country descended into an intense and protracted civil war lasting from 1977 to 1992. In 1994, Mozambique held its first multiparty elections and has since remained a relatively stable presidential republic, although it still faces a low-intensity insurgency distinctively in the farthermost regions from the southern capital and where Islam is dominant. Mozambique is endowed with rich and extensive natural resources, notwithstanding the country's economy is based chiefly on fishery—substantially molluscs, crustaceans and echinoderms—and agriculture with a growing industry of food and beverages, chemical manufacturing, aluminium and oil. The tourism sector is expanding. South Africa remains Mozambique's main trading partner, preserving a close relationship with Portugal with a perspective on other European markets. Since 2001, Mozambique's GDP growth has been thriving, but since 2014/15, both a significant decrease in household real consumption and",
    "Namibia": "Namibia ( , ), officially the Republic of Namibia, is a country in Southern Africa. Its western border is the Atlantic Ocean. It shares land borders with Angola and Zambia to the north, Botswana to the east and South Africa to the east and south. Although it does not border Zimbabwe, less than 200 metres (660 feet) of the Botswanan right bank of the Zambezi River separates the two countries. Its capital and largest city is Windhoek. The driest country in sub-Saharan Africa, Namibia has been inhabited since pre-historic times by the Khoi, San, Damara and Nama people. Around the 14th century, immigrating Bantu peoples arrived as part of the Bantu expansion. From 1600 the Ovambo formed kingdoms, such as Ondonga and Oukwanyama. In 1884, the German Empire established rule over most of the territory, forming a colony known as German South West Africa. Between 1904 and 1908, German troops waged a punitive campaign against the Herero and Nama which escalated into the first genocide of the 20th century. German rule ended during the First World War with a 1915 defeat by South African forces. In 1920, after the end of the war, the League of Nations mandated administration of the colony to South Africa. From 1948, with the National Party elected to power, this included South Africa applying apartheid to what was then known as South West Africa. In the later 20th century, uprisings and demands for political representation resulted in the United Nations assuming direct responsibility over the territory in 1966, but South Africa maintained de facto rule until 1973, when the UN recognised the South West Africa People's Organisation (SWAPO) as the official representative of the Namibian people. Namibia gained independence from South Africa on 21 March 1990, following the South African Border War. However, Walvis Bay",
    "Niger": "Niger, officially the Republic of the Niger, is a landlocked country in West Africa. It is a unitary state bordered by Libya to the northeast, Chad to the east, Nigeria to the south, Benin and Burkina Faso to the southwest, Mali to the west, and Algeria to the northwest. It covers a land area of almost 1,270,000 km2 (490,000 sq mi), making it the largest landlocked country in West Africa and the second largest landlocked nation in Africa behind Chad. Over 80% of its land area lies in the Sahara. Its predominantly Muslim population of about 25 million lives mostly in clusters in the south and west of the country. The capital Niamey is located in Niger's southwest corner along the namesake Niger River. Following the spread of Islam to the region, Niger was on the fringes of some states, including the Kanem–Bornu Empire and the Mali Empire before more significant parts of its territory became included in states such as the Sultanate of Agadez and the Songhai Empire. It was colonized by France during the Scramble for Africa as part of French West Africa, becoming a distinct colony in 1922. Since obtaining independence in 1960, Niger has experienced five coups d'état and four periods of military rule. Niger's seventh and most recent constitution was enacted in 2010, establishing a multiparty, unitary semi-presidential system. Following the most recent coup in 2023, the country is once again under a military junta. Its society reflects a diversity drawn from the independent histories of some ethnic groups and regions and their period living in a single state. The Hausa are the country's largest ethnic group, making up more than half the population. French is the country's official language, and ten indigenous languages have the status of national language. According to the UN's Multidimensional",
    "Nigeria": "Nigeria, officially the Federal Republic of Nigeria, is a country in West Africa. It is situated between the Sahel to the north and the Gulf of Guinea to the south in the Atlantic Ocean. It covers an area of 923,769 square kilometres (356,669 sq mi). With a population of more than 230 million, it is the most populous country in Africa, and the world's sixth-most populous country. Nigeria borders Niger in the north, Chad in the northeast, Cameroon in the east, and Benin in the west. Nigeria is a federal republic comprising 36 states and the Federal Capital Territory, where its capital, Abuja, is located. The largest city in Nigeria is Lagos, one of the largest metropolitan areas in the world and the largest in Africa. Nigeria has been home to several indigenous pre-colonial states and kingdoms since the second millennium BC, with the Nok civilization in the 15th century BC marking the first internal unification. The modern state originated with British colonialization in the 19th century, taking its present territorial shape with the merging of the Southern Nigeria Protectorate and the Northern Nigeria Protectorate in 1914. The British set up administrative and legal structures while practicing indirect rule through traditional chiefdoms. Nigeria became a formally independent federation on 1 October 1960. It experienced a civil war from 1967 to 1970, followed by a succession of military dictatorships and democratically elected civilian governments until achieving a stable government in the 1999 Nigerian presidential election, with the election of Olusegun Obasanjo of the Peoples Democratic Party. However, the country frequently experiences electoral fraud, and corruption is rampant in various levels of Nigerian politics. Nigeria is a multinational state inhabited by more than 250 ethnic groups speaking 500 distinct languages, all identifying with a wide variety of cultures. The three largest ethnic",
    "Rwanda": "Rwanda, officially the Republic of Rwanda, is a landlocked country in the Great Rift Valley of East Africa, where the African Great Lakes region and Southeast Africa converge. Located a few degrees south of the Equator, Rwanda is bordered by Uganda, Tanzania, Burundi, and the Democratic Republic of the Congo. It is highly elevated, giving it the sobriquet \"land of a thousand hills\" (French: pays des mille collines), with its geography dominated by mountains in the west and savanna to the southeast, with numerous lakes throughout the country. The climate is temperate to subtropical, with two rainy seasons and two dry seasons each year. It is the most densely populated mainland African country; among countries larger than 10,000 km2, it is the fifth-most densely populated country in the world. Its capital and largest city is Kigali. Hunter-gatherers settled the territory in the Stone and Iron Ages, followed later by Bantu peoples. The population coalesced first into clans, and then into kingdoms. In the 15th century, one kingdom, under King Gihanga, managed to incorporate several of its close neighbor territories establishing the Kingdom of Rwanda. The Kingdom of Rwanda dominated from the mid-eighteenth century, with the Tutsi kings conquering others militarily, centralising power, and enacting unifying policies. In 1897, Germany colonized Rwanda as part of German East Africa, followed by Belgium, which took control in 1916 during World War I. Both European nations ruled through the Rwandan king and perpetuated a pro-Tutsi policy. The Hutu population revolted in 1959. They massacred numerous Tutsi and ultimately established an independent, Hutu-dominated republic in 1962 led by President Grégoire Kayibanda. A 1973 military coup overthrew Kayibanda and brought Juvénal Habyarimana to power, who retained the pro-Hutu policy. The Tutsi-led Rwandan Patriotic Front (RPF) launched a civil war in 1990. Habyarimana was assassinated in April",
    "Sao Tome and Principe": "São Tomé and Príncipe, officially the Democratic Republic of São Tomé and Príncipe, is an island country in the Gulf of Guinea, off the western equatorial coast of Central Africa. It consists of two archipelagos around the two main islands of São Tomé and Príncipe, about 150 km (93.21 mi) apart and about 250 and 225 km (155 and 140 mi) off the northwestern coast of Gabon. With a population of 201,800 (2018 official estimate), São Tomé and Príncipe is the second-smallest and second-least populous African sovereign state after Seychelles. The islands were uninhabited until their discovery in 1470 by Portuguese explorers João de Santarém and Pedro Escobar. Gradually colonized and settled throughout the 16th century, they collectively served as a vital commercial and trade centre for the Atlantic slave trade. The rich volcanic soil and proximity to the equator made São Tomé and Príncipe ideal for sugar cultivation, followed later by cash crops such as coffee and cocoa; the lucrative plantation economy was heavily dependent upon enslaved Africans. Cycles of social unrest and economic instability throughout the 19th and 20th centuries culminated in peaceful independence in 1975. São Tomé and Príncipe has since remained one of Africa's most stable and democratic countries. São Tomé and Príncipe is a developing economy with a medium Human Development Index. The people of São Tomé and Príncipe are predominantly of African and mestiço descent, with most practicing Christianity. The legacy of Portuguese rule is also visible in the country's culture, customs, and music, which fuse European and African influences. São Tomé and Príncipe is a founding member state of the Community of Portuguese Language Countries.",
    "Senegal": "Senegal, officially the Republic of Senegal, is the westernmost country in West Africa, situated on the Atlantic Ocean coastline. Senegal is bordered by Mauritania to the north, Mali to the east, Guinea to the southeast and Guinea-Bissau to the southwest. Senegal nearly surrounds The Gambia, a country occupying a narrow sliver of land along the banks of the Gambia River, which separates Senegal's southern region of Casamance from the rest of the country. Senegal also shares a maritime border with Cape Verde. Senegal's economic and political capital is Dakar. Senegal is the westernmost country in the mainland of the Old World, or Afro-Eurasia. It owes its name to the Senegal River, which borders it to the east and north. The climate is typically Sahelian, though there is a rainy season. Senegal covers a land area of almost 197,000 square kilometres (76,000 sq mi) and has a population of around 18 million. The state is a unitary presidential republic; since the country's foundation in 1960, it has been recognized as one of the most stable countries on the African continent. On the 2023 V-Dem Democracy Indices, Senegal is ranked 52nd in electoral democracy worldwide and 4th in electoral democracy in Africa. The state was formed as part of the independence of French West Africa from French colonial rule. Because of this history, French is the official language, but it is understood by only a minority of the population. Over 30 languages are spoken in Senegal. Wolof is the most widely spoken one, with 80% of the population speaking it as a first or second language, acting as Senegal's lingua franca alongside French. Like other African nations, the country includes a wide mix of ethnic and linguistic communities, with the largest being the Wolof, Fula, and Serer people. Senegalese people are predominantly",
    "Seychelles": "Seychelles ( , ; French: [sɛʃɛl] or [seʃɛl]), officially the Republic of Seychelles (French: République des Seychelles; Seychellois Creole: Repiblik Sesel), is an island country and archipelagic state consisting of 155 islands (as per the Constitution) in the Indian Ocean. Its capital and largest city, Victoria, is 1,500 kilometres (800 nautical miles) east of mainland Africa. Nearby island countries and territories include the Comoros, Madagascar, Mauritius, and the French overseas departments of Mayotte and Réunion to the south; and the Chagos Archipelago and Maldives to the east and borders Kenya to the far east. Seychelles is the smallest country in Africa as well as the least populated sovereign African country, with an estimated population of 100,600 in 2022. Seychelles was uninhabited prior to being encountered by Europeans in the 16th century. It faced competing French and British interests until it came under full British control in the late 18th century. Since proclaiming independence from the United Kingdom in 1976, it has developed from a largely agricultural society to a market-based diversified economy, characterized by service, public sector, and tourism activities. From 1976 to 2015, nominal GDP grew nearly 700%, and purchasing power parity nearly 1600%. Since the late 2010s, the government has taken steps to encourage foreign investment. As of the early 21st century, Seychelles has the highest nominal per capita GDP of any African nation. It has the highest Human Development Index ranking of any African country. According to the 2023 V-Dem Democracy indices, Seychelles is the 43rd-ranked electoral democracy worldwide and 1st-ranked electoral democracy in Africa. Seychellois culture and society is an eclectic mix of French, British, and African influences, with infusions of Chinese and Indian elements. The country is a member of the United Nations, the African Union, the Southern African Development Community, and the Commonwealth of",
    "Sierra Leone": "Sierra Leone, ( , also UK: , US: ; Krio: Salone) officially the Republic of Sierra Leone, is a country on the southwest coast of West Africa. It is bordered to the southeast by Liberia and by Guinea to the north. Its land area is 71,740 km2 (27,699 sq mi). It has a tropical climate and environments ranging from savannas to rainforests. As of the 2023 census, Sierra Leone has a population of 8,908,040. Freetown is both its capital and its largest city. The country is divided into five administrative regions, which are further subdivided into 16 districts. Sierra Leone is a presidential republic, with a unicameral parliament and a directly elected president. It is a secular state. Its constitution provides for the separation of state and religion and freedom of conscience (which encompasses both freedom of thought and religion). Muslims constitute three-quarters of the population, and there is a significant Christian minority. Notably, religious tolerance is very high: it is both a social norm and part of the nation's cultural identity. Sierra Leone's current territorial configuration was established in two phases: in 1808, the coastal Sierra Leone Colony was founded as a place to resettle returning Africans after the abolition of the slave trade; then in 1896, the inland Protectorate was created as a result of the Berlin Conference of 1884–1885. This led to the formal recognition of the territory as the Sierra Leone Colony and Protectorate. Sierra Leone attained independence from the United Kingdom in 1961 under the leadership of Prime Minister Sir Milton Margai of the Sierra Leone People's Party (SLPP). In 1971, under Prime Minister Siaka Stevens of the All People's Congress (APC), the country adopted a new constitution, transforming Sierra Leone into a presidential republic, with Stevens as the inaugural president. In 1978, Stevens declared",
    "Somalia": "Somalia, officially the Federal Republic of Somalia, is the easternmost country in continental Africa. The country is located in the Horn of Africa and is bordered by Ethiopia to the west, Djibouti to the northwest, Kenya to the southwest, the Gulf of Aden to the north, and the Indian Ocean to the east. Somalia has the longest coastline on Africa's mainland. Somalia has an estimated population of 18.1 million, of which 2.7 million live in the capital and largest city, Mogadishu. Around 85% of its residents are ethnic Somalis and the official languages of the country are Somali and Arabic, though the former is the primary language. Somalia has historic and religious ties to the Arab world. As such the people in Somalia are Muslims, the majority of them Sunni. In antiquity, Somalia was an important commercial center. During the Middle Ages, several powerful Somali empires dominated the regional trade, including the Ajuran Sultanate, Adal Sultanate, and the Sultanate of the Geledi. In the late 19th century, Somali sultanates were colonized by the Italian and British Empires, who merged all of these tribal territories into two colonies: Italian Somaliland and British Somaliland. In 1960, the two territories united to form the independent Somali Republic under a civilian government. Siad Barre of the Supreme Revolutionary Council (SRC) seized power in 1969 and established the Somali Democratic Republic, brutally attempting to squash the Somaliland War of Independence in the north of the country. The SRC collapsed in 1991 with the onset of the Somali Civil War. The Transitional National Government of Somalia (TNG) was established in 2000, followed by the formation of the Transitional Federal Government of Somalia (TFG) in 2004, which reestablished the Somali Armed Forces. In 2006, with a US-backed Ethiopian intervention, the TFG assumed control of most of the",
    "South Africa": "South Africa, officially the Republic of South Africa (RSA), is the southernmost country in Africa. Its nine provinces are bounded to the south by 2,798 kilometres (1,739 miles) of coastline that stretches along the South Atlantic and Indian Ocean; to the north by the neighbouring countries of Namibia, Botswana, and Zimbabwe; to the east and northeast by Mozambique and Eswatini; and it encloses Lesotho. Covering an area of 1,221,037 square kilometres (471,445 square miles), the country has over 62 million people. Pretoria is the administrative capital, while Cape Town, as the seat of Parliament, is the legislative capital. Bloemfontein has traditionally been regarded as the judicial capital. The largest and most populous city is Johannesburg, followed by Cape Town and the busiest port city in sub-Saharan Africa, Durban. Archaeological findings suggest that various hominid species existed in South Africa about 2.5 million years ago, and modern humans inhabited the region over 100,000 years ago. The first known people were the indigenous Khoisan, and Bantu-speaking peoples who expanded from West and Central Africa later settled in the region 2,000 to 1,000 years ago. In 1652, the Dutch established the first European settlement at Table Bay, and in 1795 and 1806, the British occupied it. The Mfecane, a period of significant upheaval, led to the formation of various African kingdoms, including the Zulu Kingdom. The region was further colonised, and diamonds and gold were discovered, bringing a shift towards industrialisation and urbanisation. The Union of South Africa was created in 1910 out of the former Cape, Natal, Transvaal, and Orange River colonies, becoming a republic in 1961. Though a system of non-racial franchise had existed in the Cape, it was gradually eroded, and the vast majority of Black South Africans were not enfranchised until 1994. The National Party imposed apartheid in 1948,",
    "South Sudan": "South Sudan (), officially the Republic of South Sudan, is a landlocked country in Central/East Africa. It is bordered on the north by Sudan; on the east by Ethiopia; on the south by the Democratic Republic of the Congo, Uganda and Kenya; and on the west by Central African Republic. South Sudan's diverse landscape includes vast plains and plateaus, dry and tropical savannahs, inland floodplains, and forested mountains. The Nile River system is the defining physical feature of the country, running south to north across its center, which is dominated by a large swamp known as the Sudd. South Sudan has a population of 12.7 million. Juba is the capital and largest city. Sudan was occupied by Egypt under the Muhammad Ali dynasty and governed as an Anglo-Egyptian condominium until Sudanese independence in 1956. Following the First Sudanese Civil War, the Southern Sudan Autonomous Region was formed in 1972 and lasted until 1983. A second Sudanese civil war soon broke out in 1983 and ended in 2005 with the Comprehensive Peace Agreement. Later that year, southern autonomy was restored when an Autonomous Government of Southern Sudan was formed. South Sudan became an independent state on 9 July 2011, following 98.8% support for independence in a January 2011 referendum and is the most recent country to be formed. It is the most recent sovereign state with widespread recognition as of 2024. South Sudan descended into a civil war from 2013 to 2020, enduring rampant human rights abuses, including forced displacement, ethnic massacres, and killings of journalists by various parties. It has since been governed by a coalition formed by leaders of the former warring factions, Salva Kiir Mayardit and Riek Machar. The country continues to recover from the war while experiencing ongoing and systemic ethnic violence. The South Sudanese population is",
    "Sudan": "Sudan, officially the Republic of the Sudan, is a country in Northeast Africa. It borders the Central African Republic to the southwest, Chad to the west, Libya to the northwest, Egypt to the north, the Red Sea to the east, Eritrea and Ethiopia to the southeast, and South Sudan to the south. Sudan has a population of 50 million people as of 2024 and occupies 1,886,068 square kilometres (728,215 square miles), making it Africa's third-largest country by area and the third-largest by area in the Arab League. It was the largest country by area in Africa and the Arab League until the secession of South Sudan in 2011; since then both titles have been held by Algeria. Sudan's capital and most populous city is Khartoum. The area that is now Sudan witnessed the Khormusan (c. 40000–16000 BC), Halfan culture (c. 20500–17000 BC), Sebilian (c. 13000–10000 BC), Qadan culture (c. 15000–5000 BC), the war of Jebel Sahaba, the earliest known war in the world, around 11500 BC, A-Group culture (c. 3800–3100 BC), Kingdom of Kerma (c. 2500–1500 BC), the Egyptian New Kingdom (c. 1500–1070 BC), and the Kingdom of Kush (c. 785 BC – 350 AD). After the fall of Kush, the Nubians formed the three Christian kingdoms of Nobatia, Makuria, and Alodia. Between the 14th and 15th centuries, most of Sudan was gradually settled by Arab nomads. From the 16th to the 19th centuries, central and eastern Sudan were dominated by the Funj sultanate, while Darfur ruled the west and the Ottomans the east. In 1811, Mamluks established a state at Dunqulah as a base for their slave trading. Under Turco-Egyptian rule of Sudan after the 1820s, the practice of trading slaves was entrenched along a north–south axis, with slave raids taking place in southern parts of the country and",
    "Tanzania": "Tanzania, officially the United Republic of Tanzania, is a country in East Africa within the African Great Lakes region. It is bordered by Uganda to the northwest; Kenya to the northeast; the Indian Ocean to the east; Mozambique and Malawi to the south; Zambia to the southwest; and Rwanda, Burundi, and the Democratic Republic of the Congo to the west. Mount Kilimanjaro, Africa's highest mountain, is in northeastern Tanzania. According to the 2022 national census, Tanzania has a population of around 62 million, making it the most populous country located entirely south of the equator. Many important hominid fossils have been found in Tanzania. In the Stone and Bronze Age, prehistoric migrations into Tanzania included Southern Cushitic speakers who moved south from present-day Ethiopia; Eastern Cushitic people who moved into Tanzania from north of Lake Turkana about 2,000 and 4,000 years ago; and the Southern Nilotes, including the Datoog, who originated from the present-day South Sudan–Ethiopia border region between 2,900 and 2,400 years ago.: page 18 These movements took place at about the same time as the settlement of the Mashariki Bantu from West Africa in the Lake Victoria and Lake Tanganyika areas. In the late 19th century, the mainland came under German rule as German East Africa, and this was followed by British rule after World War I when it was governed as Tanganyika, with the Zanzibar Archipelago remaining a separate colonial jurisdiction. Following their respective independence in 1961 and 1963, the two entities merged in 1964 to form the United Republic of Tanzania. Tanganyika joined the British Commonwealth and Tanzania remains a member of the Commonwealth as a unified republic. Today, the country is a presidential constitutional republic with the federal capital located in Government City (Dodoma); the former capital, Dar es Salaam, retains most government offices and",
    "Togo": "Togo, officially the Togolese Republic, is a country in West Africa. It is bordered by Ghana to the west, Benin to the east and Burkina Faso to the north. It is one of the least developed countries and extends south to the Gulf of Guinea, where its capital, Lomé, is located. It is a small, tropical country, which covers 57,000 square kilometres (22,000 square miles) and has a population of approximately 8 million, and it has a width of less than 115 km (71 mi) between Ghana and its eastern neighbour Benin. Various people groups settled the boundaries of present day Togo between the 11th and 16th centuries. Between the 16th and 18th centuries, the coastal region served primarily as a European slave trading outpost, earning Togo and the surrounding region the name \"The Slave Coast\". In 1884, Germany declared a region including a protectorate called Togoland. After World War I, rule over Togo is transferred to France. Togo gained its independence from France in 1960. In 1967, Gnassingbé Eyadéma led a successful military coup d'état, after which he became president of an anti-communist, single-party state. In 1993, Eyadéma faced multiparty elections marred by irregularities, and won the presidency three times. At the time of his death, Eyadéma was the \"longest-serving leader in modern African history\", having been president for 38 years. In 2005, his son Faure Gnassingbé was elected president. Togo is a tropical, sub-Saharan nation whose economy depends mostly on agriculture. The official language is French, but other languages are spoken, particularly those of the Gbe family. 47.8% of the population adhere to Christianity, making it the largest religion in the country. Togo is a member of the United Nations, African Union, Organisation of Islamic Cooperation, South Atlantic Peace and Cooperation Zone, Francophonie, Commonwealth of Nations, and Economic",
    "Tunisia": "Tunisia, officially the Republic of Tunisia, is the northernmost country in Africa. It is a part of the Maghreb region of North Africa, bordered by Algeria to the west and southwest, Libya to the southeast, and the Mediterranean Sea to the north and east. Tunisia also shares maritime borders with Italy through the islands of Sicily and Sardinia to the north and Malta to the east. It features the archaeological sites of Carthage dating back to the 9th century BC, as well as the Great Mosque of Kairouan. Known for its ancient architecture, souks, and blue coasts, it covers 163,610 km2 (63,170 sq mi), and has a population of 12.1 million. It contains the eastern end of the Atlas Mountains and the northern reaches of the Sahara desert; much of its remaining territory is arable land. Its 1,300 km (810 mi) of coastline includes the African conjunction of the western and eastern parts of the Mediterranean Basin. Tunisia is home to Africa's northernmost point, Cape Angela. Located on the northeastern coast, Tunis is the capital and largest city of the country, which is itself named after Tunis. The official language of Tunisia is Modern Standard Arabic. The vast majority of Tunisia's population is Arab and Muslim. Vernacular Tunisian Arabic is the most spoken, and French also serves as an administrative and educational language in some contexts, but it has no official status. Beginning in early antiquity, Tunisia was inhabited by the indigenous Berbers. The Phoenicians, a Semitic people, began to arrive in the 12th century BC, settling on the coast and establishing several settlements, of which Carthage emerged as the most powerful by the 7th century BC. The descendants of the Phoenician settlers came to be known as the Punic people. Ancient Carthage was a major mercantile empire and a",
    "Uganda": "Uganda, officially the Republic of Uganda, is a landlocked country in East Africa. It is bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by Rwanda, and to the south by Tanzania. The southern part includes a substantial portion of Lake Victoria, shared with Kenya and Tanzania. Uganda is in the African Great Lakes region, it lies within the Nile basin, and has a varied equatorial climate. As of 2024, it has a population of over 49 million, of which 8.5 million live in the capital and largest city, Kampala. Uganda is named after the Buganda kingdom, which encompasses a large portion of the south, including Kampala, and whose language Luganda is widely spoken; the official language is English. The region was populated by various ethnic groups, before Bantu and Nilotic groups arrived around 3,000 years ago. These groups established influential kingdoms such as the Empire of Kitara. The arrival of Arab traders in the 1830s and British explorers in the late 19th century, marked the beginning of foreign influence. The British established the Protectorate of Uganda in 1894, incorporating various kingdoms and setting the stage for future political dynamics. Uganda gained independence in 1962, with Milton Obote as the first prime minister. The 1966 Mengo Crisis marked a significant conflict with the Buganda kingdom. Idi Amin's military coup in 1971 led to a brutal regime characterized by mass killings and economic decline, until his overthrow in 1979. Yoweri Museveni's National Resistance Movement (NRM) took power in 1986 after a six-year guerrilla war. This brought stability and growth, but authoritarian practices and human rights abuses. The abolition of presidential term limits, allegations of electoral fraud and repression, have raised concerns about Uganda's democratic future.",
    "Zambia": "Zambia, officially the Republic of Zambia, is a landlocked country at the crossroads of Central, Southern and East Africa. It is typically referred to being in South-Central Africa or Southern Africa. It is bordered to the north by the Democratic Republic of the Congo, Tanzania to the north-east, Malawi to the east, Mozambique to the southeast, Zimbabwe and Botswana to the south, Namibia to the southwest, and Angola to the west. The capital city of Zambia is Lusaka, located in the south-central part of Zambia. The population is concentrated mainly around Lusaka in the south and the Copperbelt Province to the north, the core economic hubs of the country. Originally inhabited by Khoisan peoples, the region was affected by the Bantu expansion of the thirteenth century. Following European colonizers in the 18th century, the British colonised the region into the British protectorates of Barotziland–North-Western Rhodesia and North-Eastern Rhodesia towards the end of the 19th century. These were merged in 1911 to form Northern Rhodesia. For most of the colonial period, Zambia was governed by an administration appointed from London with the advice of the British South Africa Company. On 24 October 1964, Zambia became independent of the United Kingdom and prime minister Kenneth Kaunda became the inaugural president. Kaunda's socialist United National Independence Party (UNIP) maintained power from 1964 until 1991 with him playing a key role in regional diplomacy, cooperating closely with the United States in search of solutions to conflicts in Southern Rhodesia (Zimbabwe), Angola, and Namibia. From 1972 to 1991, Zambia was a one-party state with UNIP as the sole legal political party under the motto \"One Zambia, One Nation\" coined by Kaunda. Kaunda was succeeded by Frederick Chiluba of the social-democratic Movement for Multi-Party Democracy in 1991, beginning a period of socio-economic development and government decentralisation.",
    "Zimbabwe": "Zimbabwe ( ; Shona pronunciation: [zi.ᵐba.ɓwe]), officially the Republic of Zimbabwe, is a landlocked country in Southeast Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa to the south, Botswana to the southwest, Zambia to the north, and Mozambique to the east. The capital and largest city is Harare, and the second largest is Bulawayo. A country of roughly 16.6 million people as per 2024 census, Zimbabwe's largest ethnic group are the Shona, who make up 80% of the population, followed by the Northern Ndebele and other smaller minorities. Zimbabwe has 16 official languages, with English, Shona, and Ndebele the most common. Zimbabwe is a member of the United Nations, the Southern African Development Community, the African Union, and the Common Market for Eastern and Southern Africa. Beginning in the 9th century, during its late Iron Age, the Bantu people (who would become the ethnic Shona) built the city-state of Great Zimbabwe; the city-state became one of the major African trade centres by the 11th century but was abandoned by the mid 15th century. From there, the Kingdom of Zimbabwe was established, followed by the Rozvi and Mutapa empires. The British South Africa Company of Cecil Rhodes demarcated the Rhodesia region in 1890 when they conquered Mashonaland and later in 1893 Matabeleland after the First Matabele War. Company rule ended in 1923 with the establishment of Southern Rhodesia as a self-governing British colony. In 1965, the white minority government unilaterally declared independence as Rhodesia. The state endured international isolation and a 15-year guerrilla war with black nationalist forces; this culminated in a peace agreement that established de jure sovereignty as Zimbabwe in April 1980. Robert Mugabe became Prime Minister of Zimbabwe in 1980, when his ZANU–PF party won the general election following the end of white minority rule"
}