{
    "Afghanistan": "Afghanistan, officially the Islamic Emirate of Afghanistan, is a landlocked country located at the crossroads of Central Asia and South Asia. It is bordered by Pakistan to the east and south, Iran to the west, Turkmenistan to the northwest, Uzbekistan to the north, Tajikistan to the northeast, and China to the northeast and east. Occupying 652,864 square kilometers (252,072 sq mi) of land, the country is predominantly mountainous with plains in the north and the southwest, which are separated by the Hindu Kush mountain range. Kabul is the country's capital and largest city. According to the World Population review, as of 2023, Afghanistan's population is 43 million. The National Statistics Information Authority of Afghanistan estimated the population to be 32.9 million as of 2020. Human habitation in Afghanistan dates to the Middle Paleolithic era. Popularly referred to as the graveyard of empires, the land has witnessed numerous military campaigns, including those by the Persians, Alexander the Great, the Maurya Empire, Arab Muslims, the Mongols, the British, the Soviet Union, and a US-led coalition. Afghanistan also served as the source from which the Greco-Bactrians and the Mughals, among others, rose to form major empires. Because of the various conquests and periods in both the Iranian and Indian cultural spheres, the area was a center for Zoroastrianism, Buddhism, Hinduism, and later Islam. The modern state of Afghanistan began with the Durrani Afghan Empire in the 18th century, although Dost Mohammad Khan is sometimes considered to be the founder of the first modern Afghan state. Afghanistan became a buffer state in the Great Game between the British Empire and the Russian Empire. From India, the British attempted to subjugate Afghanistan but were repelled in the First Anglo-Afghan War; the Second Anglo-Afghan War saw a British victory. Following the Third Anglo-Afghan War in 1919,",
    "Armenia": "Armenia officially the Republic of Armenia, is a landlocked country in the Armenian Highlands of West Asia. It is a part of the Caucasus region and is bordered by Turkey to the west, Georgia to the north and Azerbaijan to the east, and Iran and the Azerbaijani exclave of Nakhchivan to the south. Yerevan is the capital, largest city and financial center. Armenia is a unitary, multi-party, democratic nation-state with an ancient cultural heritage. The Armenian Highlands has been home to the Hayasa-Azzi, Shupria and Nairi. By at least 600 BC, an archaic form of Proto-Armenian, an Indo-European language, had diffused into the Armenian Highlands. The first Armenian state of Urartu was established in 860 BC, and by the 6th century BC it was replaced by the Satrapy of Armenia. The Kingdom of Armenia reached its height under Tigranes the Great in the 1st century BC and in the year 301 became the first state in the world to adopt Christianity as its official religion. Armenia still recognises the Armenian Apostolic Church, the world's oldest national church, as the country's primary religious establishment. The ancient Armenian kingdom was split between the Byzantine and Sasanian Empires around the early 5th century. Under the Bagratuni dynasty, the Bagratid Kingdom of Armenia was restored in the 9th century before falling in 1045. Cilician Armenia, an Armenian principality and later a kingdom, was located on the coast of the Mediterranean Sea between the 11th and 14th centuries. Between the 16th and 19th centuries, the traditional Armenian homeland composed of Eastern Armenia and Western Armenia came under the rule of the Ottoman and Persian empires, repeatedly ruled by either of the two over the centuries. By the 19th century, Eastern Armenia had been conquered by the Russian Empire, while most of the western parts of",
    "Azerbaijan": "Azerbaijan, officially the Republic of Azerbaijan, is a transcontinental country at the boundary of Eastern Europe and West Asia. It is a part of the South Caucasus region and is bounded by the Caspian Sea to the east, Russia's republic of Dagestan to the north, Georgia to the northwest, Armenia and Turkey to the west, and Iran to the south. Baku is the capital and largest city. The territory of what is now Azerbaijan was first ruled by Caucasian Albania and later various Persian empires. Until the 19th century, it remained part of Qajar Iran, but the Russo-Persian wars of 1804–1813 and 1826–1828 forced the Qajar Empire to cede its Caucasian territories to the Russian Empire; the treaties of Gulistan in 1813 and Turkmenchay in 1828 defined the border between Russia and Iran. The region north of the Aras was part of Iran until it was conquered by Russia in the 19th century, where it was administered as part of the Caucasus Viceroyalty. By the late 19th century, an Azerbaijani national identity emerged when the Azerbaijan Democratic Republic proclaimed its independence from the Transcaucasian Democratic Federative Republic in 1918, a year after the Russian Empire collapsed, and became the first secular democratic Muslim-majority state. In 1920, the country was conquered and incorporated into the Soviet Union as the Azerbaijan SSR. The modern Republic of Azerbaijan proclaimed its independence on 30 August 1991, shortly before the dissolution of the Soviet Union. In September 1991, the ethnic Armenian majority of the Nagorno-Karabakh region formed the self-proclaimed Republic of Artsakh, which became de facto independent with the end of the First Nagorno-Karabakh War in 1994, although the region and seven surrounding districts remained internationally recognized as part of Azerbaijan. Following the Second Nagorno-Karabakh War in 2020, the seven districts and parts of Nagorno-Karabakh",
    "Bahrain": "Bahrain, officially the Kingdom of Bahrain, is an island country in West Asia. It is situated on the Persian Gulf, and comprises a small archipelago made up of 50 natural islands and an additional 33 artificial islands, centered on Bahrain Island which makes up around 83 percent of the country's landmass. Bahrain is situated between Qatar and the northeastern coast of Saudi Arabia, to which it is connected by the King Fahd Causeway. The population of Bahrain is 1,501,635 as of May 14, 2023, based on elaborations of the United Nations data, of whom 712,362 are Bahraini nationals. Bahrain spans some 760 square kilometres (290 sq mi), and is the third-smallest nation in Asia after the Maldives and Singapore. The capital and largest city is Manama. According to archeologist Geoffrey Bibby, Bahrain is the site of the ancient Dilmun civilization. It has been famed since antiquity for its pearl fisheries, which were considered the best in the world into the 19th century. Bahrain was one of the earliest areas to be influenced by Islam, during the lifetime of Muhammad in 628 AD. Following a period of Arab rule, Bahrain was ruled by the Portuguese Empire from 1521 until 1602, when they were expelled by Shah Abbas the Great of the Safavid Iran. In 1783, the Bani Utbah and allied tribes captured Bahrain from Nasr Al-Madhkur and it has since been ruled by the Al Khalifa royal family, with Ahmed al Fateh as Bahrain's first hakim. In the late 1800s, following successive treaties with the British, Bahrain became a protectorate of the United Kingdom. In 1971, it declared independence. Formerly an emirate, Bahrain was declared a semi-constitutional monarchy in 2002, and Article 2 of the newly adopted constitution made Sharia a principal source for legislation. In 2011, the country experienced protests",
    "Bangladesh": "Bangladesh, officially the People's Republic of Bangladesh, is a country in South Asia. It is the eighth-most populous country in the world and among the most densely populated with a population of more than 170 million in an area of 148,460 square kilometres (57,320 sq mi). Bangladesh shares land borders with India to the north, west, and east, and Myanmar to the southeast. To the south, it has a coastline along the Bay of Bengal. To the north, it is separated from Bhutan and Nepal by the Siliguri Corridor, and from China by the mountainous Indian state of Sikkim. Dhaka, the capital and largest city, is the nation's political, financial, and cultural centre. Chittagong is the second-largest city and the busiest port. The official language is Bengali, with Bangladeshi English also used in government. Bangladesh is part of the historic and ethnolinguistic region of Bengal, which was divided during the Partition of British India in 1947 as the eastern enclave of the Dominion of Pakistan, from which it gained independence in 1971 after a bloody war. The country has a Bengali Muslim majority. Ancient Bengal was known as Gangaridai and was a stronghold of pre-Islamic kingdoms. The Muslim conquest after 1204 led to the sultanate and Mughal periods, during which an independent Bengal Sultanate and wealthy Mughal Bengal transformed the region into an important centre of regional affairs, trade, and diplomacy. The Battle of Plassey in 1757 marked the beginning of British rule. The creation of Eastern Bengal and Assam in 1905 set a precedent for the emergence of Bangladesh. The All-India Muslim League was founded in Dhaka in 1906. The Lahore Resolution in 1940 was supported by A. K. Fazlul Huq, the first Prime Minister of Bengal. The present-day territorial boundary was established with the announcement of the Radcliffe",
    "Bhutan": "Bhutan, officially the Kingdom of Bhutan, is a landlocked country in South Asia situated in the Eastern Himalayas between China in the north and India in the south. With a population of over 727,145 and a territory of 38,394 square kilometres (14,824 sq mi), Bhutan ranks 133rd in land area and 160th in population. Bhutan is a constitutional monarchy with a king (Druk Gyalpo) as the head of state and a prime minister as the head of government. The Je Khenpo is the head of the state religion, Vajrayana Buddhism. The subalpine Himalayan mountains in the north rise from the country's lush subtropical plains in the south. In the Bhutanese Himalayas, there are peaks higher than 7,000 metres (23,000 ft) above sea level. Gangkhar Puensum is Bhutan's highest peak and is the highest unclimbed mountain in the world. The wildlife of Bhutan is notable for its diversity, including the Himalayan takin and golden langur. The capital and largest city is Thimphu, holding close to 15% of the population. Bhutan and neighbouring Tibet experienced the spread of Buddhism, which originated in the Indian subcontinent during the lifetime of Gautama Buddha. In the first millennium, the Vajrayana school of Buddhism spread to Bhutan from the southern Pala Empire of Bengal. During the 16th century, Ngawang Namgyal unified the valleys of Bhutan into a single state. Namgyal defeated three Tibetan invasions, subjugated rival religious schools, codified the Tsa Yig legal system, and established a government of theocratic and civil administrators. Namgyal became the first Zhabdrung Rinpoche and his successors acted as the spiritual leaders of Bhutan, like the Dalai Lama in Tibet. During the 17th century, Bhutan controlled large parts of northeast India, Sikkim and Nepal; it also wielded significant influence in Cooch Behar State. Bhutan ceded the Bengal Duars to British India",
    "Brunei": "Brunei, officially Brunei Darussalam, is a country in Southeast Asia, situated on the northern coast of the island of Borneo. Apart from its coastline on the South China Sea, it is completely surrounded by the Malaysian state of Sarawak, with its territory bifurcated by the Sarawak district of Limbang. Brunei is the only sovereign state entirely on Borneo; the remainder of the island is divided between its multi-landmass neighbours of Malaysia and Indonesia. As of 2023, the country had a population of 455,858, of whom approximately 180,000 resided in the capital and largest city of Bandar Seri Begawan. Its official language is Malay and Islam is the state religion of the country, although other religions are nominally tolerated. The government of Brunei is a constitutional absolute monarchy ruled by the Sultan, and it implements a fusion of English common law and jurisprudence inspired by Islam, including sharia. At the Bruneian Empire's peak during the reign of Sultan Bolkiah (1485–1528), the state is claimed to have had control over the most of Borneo, including modern-day Sarawak and Sabah, as well as the Sulu archipelago and the islands off the northwestern tip of Borneo. There are also claims to its historical control over Seludong, the site of the modern Philippine capital of Manila, but Southeast Asian scholars believe the name of the location in question is actually in reference to Mount Selurong, in Indonesia. The maritime state of Brunei was visited by the surviving crew of the Magellan Expedition in 1521, and in 1578 it fought against Spain in the Castilian War. During the 19th century, the Bruneian Empire began to decline. The Sultanate ceded Sarawak (Kuching) to James Brooke and installed him as the White Rajah, and it ceded Sabah to the British North Borneo Chartered Company. In 1888, Brunei became",
    "Cambodia": "Cambodia, officially the Kingdom of Cambodia, is a country in Mainland Southeast Asia. It borders Thailand to the northwest, Laos to the north, Vietnam to the east, and has a coastline along the Gulf of Thailand in the southwest. It spans an area of 181,035 square kilometres (69,898 square miles), and has a population of about 17 million. Its capital and most populous city is Phnom Penh. In 802 AD, Jayavarman II declared himself king, uniting the warring Khmer princes of Chenla under the name \"Kambuja\". This marked the beginning of the Khmer Empire. The Indianised kingdom facilitated the spread of first Hinduism and then Buddhism to Southeast Asia and undertook religious infrastructural projects throughout the region. In the 15th century, it began a decline in power (the Post-Angkor Period) until, in 1863, it became the French Protectorate of Cambodia. After the Japanese occupation of Cambodia during the Second World War, it gained independence in 1953. The Vietnam War extended into the country in 1965 via the Ho Chi Minh and Sihanouk trails. A 1970 coup installed the US-aligned Khmer Republic, which was overthrown by the Khmer Rouge in 1975. The Khmer Rouge ruled the country and carried out the Cambodian genocide from 1975 until 1979, when they were ousted in the Cambodian–Vietnamese War. The Vietnamese-occupied People's Republic of Kampuchea became the de facto government. Following the 1991 Paris Peace Accords which formally ended the war with Vietnam, Cambodia was governed by a United Nations mission (1992–93). The UN withdrew after the 1993 Cambodian general election, decided by around 90% of registered voters. The 1997 coup d'état consolidated power under Prime Minister Hun Sen and the Cambodian People's Party (CPP). While constitutionally a multi-party state, CPP dominates the political system and dissolved its main opposition party in 2017, making it",
    "China": "China, officially the People's Republic of China (PRC), is a country in East Asia. With a population exceeding 1.4 billion, it is the second-most populous country after India, representing 17.4% of the world population. China spans the equivalent of five time zones and borders fourteen countries by land. With an area of nearly 9.6 million square kilometers (3,700,000 sq mi), it is the third-largest country by total land area. The country is divided into 33 province-level divisions: 22 provinces, five autonomous regions, four municipalities, and two semi-autonomous special administrative regions. Beijing is the country's capital, while Shanghai is its most populous city by urban area and largest financial center. China is considered one of the cradles of civilization: the first human inhabitants in the region arrived during the Paleolithic. By the late 2nd millennium BCE, the earliest dynastic states had emerged in the Yellow River basin. The 8th–3rd centuries BCE saw a breakdown in the authority of the Zhou dynasty, accompanied by the emergence of administrative and military techniques, literature, philosophy, and historiography. In 221 BCE, China was unified under an emperor, ushering in more than two millennia of imperial dynasties including the Qin, Han, Tang, Yuan, Ming, and Qing. With the invention of gunpowder and paper, the establishment of the Silk Road, and the building of the Great Wall, Chinese culture flourished and has heavily influenced both its neighbors and lands further afield. However, China began to cede parts of the country in the late 19th century to various European powers by a series of unequal treaties. After decades of struggle, the 1911 Revolution resulted in the overthrow of the monarchy and the establishment of the Republic of China (ROC) the following year. The country under the nascent Beiyang government was unstable and ultimately fragmented during the Warlord Era,",
    "Cyprus": "Cyprus ( ), officially the Republic of Cyprus, is an island country in the eastern Mediterranean Sea. It is geographically a part of West Asia, but its cultural ties and geopolitics are overwhelmingly Southeast European. Cyprus is the third largest and third-most populous island in the Mediterranean. It is east of Greece, north of Egypt, south of Turkey, and west of Lebanon and Syria. Its capital and largest city is Nicosia. Cyprus also shares land borders with Akrotiri and Dhekelia, a dependent territory of the United Kingdom. The northeast portion of the island is de facto governed by the self-declared Turkish Republic of Northern Cyprus. Cyprus was first settled by hunter-gatherers around 13,000 years ago, with farming settlements emerging a few thousand years later. During the late Bronze Age, Cyprus, known in contemporary sources as Alashiya, developed an urbanised society closely connected to the wider Mediterranean world. Cyprus experienced waves of settlement by Mycenaean Greeks at the end of the 2nd millennium BC. It was subsequently occupied by several major powers, including the empires of the Assyrians, Egyptians and Persians, from whom the island was seized in 333 BC by Alexander the Great. Subsequent rule by Ptolemaic Egypt, the Classical and Eastern Roman Empire, Arab caliphates for a short period, the French Lusignan dynasty and the Venetians was followed by over three centuries of Ottoman rule between 1571 and 1878 (de jure until 1914). Cyprus was placed under the United Kingdom's administration based on the Cyprus Convention in 1878 and was formally annexed by the UK in 1914. The future of the island became a matter of disagreement between the two prominent ethnic communities, Greek Cypriots and Turkish Cypriots. From the 19th century onwards, the Greek Cypriot population pursued enosis, union with Greece, which became a Greek national policy in",
    "Georgia": "Georgia most commonly refers to: Georgia (country), a country in the Caucasus region of southeastern Europe and West Asia Georgia (U.S. state), a state in the southeastern United States Georgia may also refer to:",
    "India": "India, officially the Republic of India, is a country in South Asia. It is the seventh-largest country in the world by area and the most populous country. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar, and Indonesia. Modern humans arrived on the Indian subcontinent from Africa no later than 55,000 years ago. Their long occupation, initially in varying forms of isolation as hunter-gatherers, has made the region highly diverse, second only to Africa in human genetic diversity. Settled life emerged on the subcontinent in the western margins of the Indus river basin 9,000 years ago, evolving gradually into the Indus Valley Civilisation of the third millennium BCE. By 1200 BCE, an archaic form of Sanskrit, an Indo-European language, had diffused into India from the northwest. Its evidence today is found in the hymns of the Rigveda. Preserved by an oral tradition that was resolutely vigilant, the Rigveda records the dawning of Hinduism in India. The Dravidian languages of India were supplanted in the northern and western regions. By 400 BCE, stratification and exclusion by caste had emerged within Hinduism, and Buddhism and Jainism had arisen, proclaiming social orders unlinked to heredity. Early political consolidations gave rise to the loose-knit Maurya and Gupta Empires based in the Ganges Basin. Their collective era was suffused with wide-ranging creativity, but also marked by the declining status of women, and the incorporation of untouchability into an organised system of belief.",
    "Indonesia": "Indonesia, officially the Republic of Indonesia, is a country in Southeast Asia and Oceania, between the Indian and Pacific oceans. It consists of over 17,000 islands, including Sumatra, Java, Sulawesi, and parts of Borneo and New Guinea. Indonesia is the world's largest archipelagic state and the 14th-largest country by area, at 1,904,569 square kilometres (735,358 square miles). With over 280 million people, Indonesia is the world's fourth-most-populous country and the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population. Indonesia is a presidential republic with an elected legislature. It has 38 provinces, of which nine have special autonomous status. The country's largest city, Jakarta, is the world's second-most-populous urban area. Indonesia shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia, as well as maritime borders with Singapore, Peninsular Malaysia, Vietnam, Thailand, the Philippines, Australia, Palau, and India. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support one of the world's highest levels of biodiversity. The Indonesian archipelago has been a valuable region for trade since at least the seventh century, when Sumatra's Srivijaya and later Java's Majapahit kingdoms engaged in commerce with entities from mainland China and the Indian subcontinent. Over the centuries, local rulers assimilated foreign influences, leading to the flourishing of Hindu and Buddhist kingdoms. Sunni traders and Sufi scholars later brought Islam, and European powers fought one another to monopolise trade in the Spice Islands of Maluku during the Age of Discovery. Following three and a half centuries of Dutch colonialism, Indonesia secured its independence after World War II. Indonesia's history has since been turbulent, with challenges posed by natural disasters, corruption, separatism, a democratisation process, and periods of rapid economic growth. Indonesia",
    "Iran": "Iran, officially the Islamic Republic of Iran (IRI), also known as Persia, is a country in West Asia. It borders Turkey to the northwest and Iraq to the west, Azerbaijan, Armenia, the Caspian Sea, and Turkmenistan to the north, Afghanistan to the east, Pakistan to the southeast, the Gulf of Oman and the Persian Gulf to the south. With a multi-ethnic population of almost 90 million in an area of 1,648,195 km2 (636,372 sq mi), Iran ranks 17th globally in both geographic size and population. It is the sixth-largest country entirely in Asia and one of the world's most mountainous countries. Officially an Islamic republic, Iran has a Muslim-majority population. The country is divided into five regions with 31 provinces. Tehran is the nation's capital, largest city and financial center. A cradle of civilization, Iran has been inhabited since the Lower Palaeolithic. The large part of Iran was first unified as a political entity by the Medes under Cyaxares in the seventh century BC, and reached its territorial height in the sixth century BC, when Cyrus the Great founded the Achaemenid Empire, one of the largest in ancient history. Alexander the Great conquered the empire in the fourth century BC. An Iranian rebellion established the Parthian Empire in the third century BC and liberated the country, which was succeeded by the Sasanian Empire in the third century AD. Ancient Iran saw some of the earliest developments of writing, agriculture, urbanisation, religion and central government. Muslims conquered the region in the seventh century AD, leading to Iran's Islamization. The blossoming literature, philosophy, mathematics, medicine, astronomy and art became major elements for Iranian civilization during the Islamic Golden Age. A series of Iranian Muslim dynasties ended Arab rule, revived the Persian language and ruled the country until the Seljuk and Mongol conquests",
    "Iraq": "Iraq, officially the Republic of Iraq, is a country in West Asia and a core country in the geopolitical region known as the Middle East. With a population exceeding 46 million, it is the 35th-most populous country. It consists of 18 governorates. The country is bordered by Turkey to the north, Saudi Arabia to the south, Iran to the east, the Persian Gulf and Kuwait to the southeast, Jordan to the southwest, and Syria to the west. The capital and largest city is Baghdad. Iraqi people are diverse; mostly Arabs, as well as Kurds, Turkmen, Yazidis, Assyrians, Armenians, Mandaeans, Persians and Shabakis with similarly diverse geography and wildlife. Most Iraqis are Muslims – minority faiths include Christianity, Yazidism, Zoroastrianism, Mandaeism, Yarsanism and Judaism. The official languages of Iraq are Arabic and Kurdish; others also recognized in specific regions are Assyrian, Turkish, Assyrian, and Armenian. Starting as early as the 6th millennium BC, the fertile alluvial plains between Iraq's Tigris and Euphrates Rivers, referred to as the region of Mesopotamia, gave rise to some of the world's earliest cities, civilizations, and empires. It was known as a \"Cradle of Civilisation\" that saw the inventions of a writing system, mathematics, timekeeping, a calendar, astrology, and a law code. Following the Muslim conquest, Baghdad became the capital and the largest city of the Abbasid Caliphate. During the time of the Islamic Golden Age, the city evolved into a significant cultural and intellectual center, and garnered a worldwide reputation for its academic institutions, including the House of Wisdom. It was largely destroyed at the hands of the Mongol Empire in 1258 during the siege of Baghdad, resulting in a decline that would linger through many centuries due to frequent plagues and multiple successive empires. Iraq remained under Ottoman rule until the end of World",
    "Israel": "Israel, officially the State of Israel, is a country in the Southern Levant region of West Asia. It is bordered by Lebanon and Syria to the north, the West Bank and Jordan to the east, the Gaza Strip and Egypt to the southwest, and the Mediterranean Sea to the west. The country also has a small coastline on the Red Sea at its southernmost point, and part of the Dead Sea lies along its eastern border. Israel's proclaimed capital is in Jerusalem, while Tel Aviv is the country's largest urban area and economic center. Israel is located in a region known to Jews as the Land of Israel, synonymous with the Palestine region, the Holy Land, and Canaan. In antiquity, it was home to the Canaanite civilization followed by the kingdoms of Israel and Judah. Situated at a continental crossroad, the region experienced demographic changes under the rule of various empires from the Romans to the Ottomans. European antisemitism in the late 19th century galvanized Zionism, which sought a Jewish homeland in Palestine and gained British support. After World War I, Britain occupied the region and established Mandatory Palestine in 1920. Increased Jewish immigration in the leadup to the Holocaust and British colonial policy led to intercommunal conflict between Jews and Arabs, which escalated into a civil war in 1947 after the United Nations (UN) proposed partitioning the land between them. The State of Israel declared its establishment on 14 May 1948. The armies of neighboring Arab states invaded the area of the former Mandate the next day, beginning the First Arab–Israeli War. Subsequent armistice agreements established Israeli control over 77 percent of the former Mandate territory. The majority of Palestinian Arabs were either expelled or fled in what is known as the Nakba, with those remaining becoming the new",
    "Japan": "Japan is an island country in East Asia. It is located in the Pacific Ocean off the northeast coast of the Asian mainland, and is bordered on the west by the Sea of Japan and extends from the Sea of Okhotsk in the north to the East China Sea in the south. The Japanese archipelago consists of four major islands—Hokkaido, Honshu, Shikoku, and Kyushu—and thousands of smaller islands, covering 377,975 square kilometres (145,937 sq mi). Japan has a population of nearly 124 million as of 2024, and is the eleventh-most populous country. Its capital and largest city is Tokyo; the Greater Tokyo Area is the largest metropolitan area in the world, with more than 38 million inhabitants as of 2016. Japan is divided into 47 administrative prefectures and eight traditional regions. About three-quarters of the country's terrain is mountainous and heavily forested, concentrating its agriculture and highly urbanized population along its eastern coastal plains. The country sits on the Pacific Ring of Fire, making its islands prone to destructive earthquakes and tsunamis. The first known habitation of the archipelago dates to the Upper Paleolithic, with the beginning Japanese Paleolithic dating to c. 36,000 BC. Between the fourth and sixth centuries, its kingdoms were united under an emperor in Nara, and later Heian-kyō. From the 12th century, actual power was held by military dictators (shōgun) and feudal lords (daimyō), and enforced by warrior nobility (samurai). After rule by the Kamakura and Ashikaga shogunates and a century of warring states, Japan was unified in 1600 by the Tokugawa shogunate, which implemented an isolationist foreign policy. In 1853, a United States fleet forced Japan to open trade to the West, which led to the end of the shogunate and the restoration of imperial power in 1868. In the Meiji period, the Empire of",
    "Jordan": "Jordan, officially the Hashemite Kingdom of Jordan, is a country in the Southern Levant region of West Asia. Jordan is bordered by Syria to the north, Iraq to the east, Saudi Arabia to the south, and Israel and the occupied Palestinian territories to the west. The Jordan River, flowing into the Dead Sea, is located along the country's western border. Jordan has a small coastline along the Red Sea in its southwest, separated by the Gulf of Aqaba from Egypt. Amman is the country's capital and largest city, as well as the most populous city in the Levant. Modern-day Jordan has been inhabited by humans since the Paleolithic period. Three kingdoms emerged in Transjordan at the end of the Bronze Age: Ammon, Moab and Edom. In the third century BC, the Arab Nabataeans established their kingdom centered in Petra. Later rulers of the Transjordan region include the Assyrian, Babylonian, Roman, Byzantine, Rashidun, Umayyad, Abbasid, and the Ottoman empires. After the 1916 Great Arab Revolt against the Ottomans during World War I, the greater Syria region was partitioned, leading to the establishment of the Emirate of Transjordan in 1921, which became a British protectorate. In 1946, the country gained independence and became officially known as the Hashemite Kingdom of Jordan. The country captured and annexed the West Bank during the 1948 Arab–Israeli War until it was occupied by Israel in 1967. Jordan renounced its claim to the territory to the Palestinians in 1988 and signed a peace treaty with Israel in 1994. Jordan is a semi-arid country, covering an area of 89,342 km2 (34,495 sq mi) with a population of 11.5 million, making it the eleventh-most populous Arab country. The dominant majority, or around 95% of the country's population, is Sunni Muslim, with the rest being mostly Arab Christian. Jordan was",
    "Kazakhstan": "Kazakhstan, officially the Republic of Kazakhstan, is a landlocked country primarily in Central Asia, with a small portion of its territory in Eastern Europe. It borders Russia to the north and west, China to the east, Kyrgyzstan to the southeast, Uzbekistan to the south, and Turkmenistan to the southwest, with a coastline along the Caspian Sea. Its capital is Astana, while the largest city and leading cultural and commercial hub is Almaty. Kazakhstan is the world's ninth-largest country by land area and the largest landlocked country. It has a population of 20 million and one of the lowest population densities in the world, at fewer than 6 people per square kilometre (16 people/sq mi). Ethnic Kazakhs constitute a majority, while ethnic Russians form a significant minority. Officially secular, Kazakhstan is a Muslim-majority country with a sizeable Christian community. Kazakhstan has been inhabited since the Paleolithic era. In antiquity, various nomadic Iranian peoples such as the Saka, Massagetae, and Scythians dominated the territory, with the Achaemenid Persian Empire expanding towards the southern region. Turkic nomads entered the region from as early as the sixth century. In the 13th century, the area was subjugated by the Mongol Empire under Genghis Khan. Following the disintegration of the Golden Horde in the 15th century, the Kazakh Khanate was established over an area roughly corresponding with modern Kazakhstan. By the 18th century, the Kazakh Khanate had fragmented into three jüz (tribal divisions), which were gradually absorbed and conquered by the Russian Empire; by the mid-19th century, all of Kazakhstan was nominally under Russian rule. Following the 1917 Russian Revolution and subsequent Russian Civil War, the territory was reorganized several times. In 1936, its modern borders were established with the formation of the Kazakh Soviet Socialist Republic within the Soviet Union. Kazakhstan was the last constituent",
    "Kuwait": "Kuwait, officially the State of Kuwait, is a country in West Asia. It is situated in the northern edge of the Arabian Peninsula at the tip of the Persian Gulf, bordering Iraq to the north and Iran with the Persian Gulf and Saudi Arabia to the south. With a coastline of approximately 500 km (311 mi), Kuwait also shares a maritime border with Iran. Most of the country's population reside in the urban agglomeration of Kuwait City, the capital and largest city. As of 2023, Kuwait has a population of 4.82 million, of which 1.53 million are Kuwaiti citizens while the remaining 3.29 million are foreign nationals from over 100 countries. In 2024 the population of Kuwait has risen to 4.93 million which is a population increase of 1.98% from 2023. Before the discovery of oil reserves in 1938, the country was a regional trade port; from 1946 to 1982, the country underwent large-scale modernization, largely based on income from oil production. In the 1980s, Kuwait experienced a period of geopolitical instability and an economic crisis following the stock market crash. In 1990, Kuwait was invaded and subsequently annexed by Iraq under the leadership of Saddam Hussein following disputes over oil production. The Iraqi occupation of Kuwait ended on 26 February 1991, following an American–British–French–Saudi–Egyptian-led international coalition culminating in the expulsion of Iraqi forces. Like most other Arab states in the Persian Gulf, Kuwait is an emirate; the emir is the head of state and the ruling Al Sabah family dominates the country's political system. Kuwait's official state religion is Islam, specifically the Maliki school of Sunni Islam. Kuwait is a high-income economy, backed by the world's sixth largest oil reserves. Kuwait is considered to be a pioneer in the region when it comes to the arts and popular culture,",
    "Kyrgyzstan": "Kyrgyzstan, officially the Kyrgyz Republic, is a landlocked country in eastern Central Asia, lying in the Tian Shan and Pamir mountain ranges. Bishkek is the capital and largest city. Kyrgyzstan is bordered by Kazakhstan to the north, Uzbekistan to the west, Tajikistan to the south, and China to the east and southeast. Ethnic Kyrgyz make up the majority of the country's over 7 million people, followed by significant minorities of Uzbeks and Russians. Kyrgyzstan's history spans a variety of cultures and empires. Although geographically isolated by its highly mountainous terrain, Kyrgyzstan has been at the crossroads of several great civilizations as part of the Silk Road along with other commercial routes. Inhabited by a succession of tribes and clans, Kyrgyzstan has periodically fallen under larger domination, for example the Turkic nomads, who trace their ancestry to many Turkic states. It was first established as the Yenisei Kyrgyz Khaganate. Later, in the 13th century, Kyrgyzstan was conquered by the Mongol Empire and under several Mongol dynasties; it regained independence, but was later invaded by the Dzungar Khanate. After the fall of Dzhungars, Kyrgyz and Kipchaks were an integral part of Kokand Khanate. In 1876, Kyrgyzstan became part of the Russian Empire, and in 1936, the Kirghiz Soviet Socialist Republic was formed to become a constituent republic of the Soviet Union. Following Mikhail Gorbachev's democratic reforms in the USSR, in 1990 pro-independence candidate Askar Akayev was elected president. On 31 August 1991, Kyrgyzstan declared independence from the USSR and a democratic government was established. Kyrgyzstan attained sovereignty as a nation state after the breakup of the Soviet Union in 1991. After independence, Kyrgyzstan was officially a unitary presidential republic. After the Tulip Revolution it became a unitary parliamentary republic; however, it gradually developed an executive president and was governed as a semi-presidential",
    "Laos": "Laos, officially the Lao People's Democratic Republic (LPDR), is the only landlocked country in Southeast Asia. It is bordered by Myanmar and China to the northwest, Vietnam to the east, Cambodia to the southeast, and Thailand to the west and southwest. Its capital and most populous city is Vientiane. Laos traces its historic and cultural identity to Lan Xang, a kingdom which existed from the 13th century to the 18th century. Because of its geographical location, the kingdom became a hub for overland trade. After a period of internal conflict, Lan Xang broke into the Kingdom of Luang Phrabang, the Kingdom of Vientiane and the Kingdom of Champasak. In 1893, the 3 kingdoms were united under a French protectorate. Laos was occupied by Japan during World War II and regained independence in 1945 as a Japanese puppet state and was re-colonised by France, until it won autonomy in 1949. It gained independence in 1953 as the Kingdom of Laos, with a constitutional monarchy under Sisavang Vong. A civil war began in 1959, which saw the communist Pathet Lao, supported by North Vietnam and the Soviet Union, fight against the Royal Lao Armed Forces, supported by the United States. After the Vietnam War ended in 1975, the Lao People's Revolutionary Party established a one-party socialist republic espousing Marxism-Leninism, ending the civil war and monarchy, and beginning a period of alignment with the Soviet Union until the dissolution of the Soviet Union in 1991. Laos's strategies for development are based on generating electricity from rivers and selling the power to its neighbours, namely Thailand, China and Vietnam, and its initiative to become a \"land-linked\" nation, as evidenced by the construction of 4 railways connecting Laos and neighbours. Laos has been referred to as one of Southeast Asia and Pacific's fastest growing economies",
    "Lebanon": "Lebanon ( LEB-ə-non, -⁠nən; Arabic: لُبْنَان, romanized: Lubnān, local pronunciation: [lɪbˈneːn]), officially the Republic of Lebanon, is a country in the Levant region of West Asia, bordered by Syria to the north and east, Israel to the south, and the Mediterranean Sea to the west; Cyprus lies a short distance from the country's coastline. It is at the crossroads of the Mediterranean Basin and the Arabian Peninsula. Lebanon has a population of more than five million and an area of 10,452 square kilometres (4,036 sq mi). Beirut is the country's capital and largest city. Human habitation in Lebanon dates to 5000 BC. From 3200 to 539 BC, it was part of Phoenicia, a maritime empire that stretched the Mediterranean Basin. In 64 BC, the region became part of the Roman Empire, and later the Byzantine Empire. After the 7th century, it came under the rule of different caliphates, including the Rashidun, Umayyad and Abbasid Caliphate. The 11th century saw the establishment of Crusader states, which fell to the Ayyubids and the Mamluks, and eventually the Ottomans. Under Ottoman ruler Abdulmejid I, the first Lebanese proto-state, the Mount Lebanon Mutasarrifate, was established in the 19th century as a home for Maronite Christians, in the Tanzimat period. After the dissolution of the Ottoman Empire following World War I, Lebanon came under the Mandate for Syria and the Lebanon, administered by France, which established Greater Lebanon. French rule weakened significantly after the German invasion of France in 1940. By 1943, Lebanon had gained independence from Free France and established a distinct form of confessionalist government, with the state's major religious groups being apportioned specific political powers. The new Lebanese state was relatively stable after independence, but this was ultimately shattered by the outbreak of the Lebanese Civil War (1975–1990). Lebanon was also subjugated",
    "Malaysia": "Malaysia is a country in Southeast Asia. A federal constitutional monarchy, it consists of 13 states and three federal territories, separated by the South China Sea into two regions: Peninsular Malaysia and Borneo's East Malaysia. Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land borders with Brunei and Indonesia, as well as a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital, the country's largest city, and the seat of the legislative branch of the federal government. Putrajaya is the administrative centre, which represents the seat of both the executive branch (the Cabinet, federal ministries, and federal agencies) and the judicial branch of the federal government. With a population of over 34 million, the country is the world's 43rd-most populous country. Malaysia is tropical and is one of 17 megadiverse countries; it is home to numerous endemic species. Tanjung Piai in the Malaysian state of Johor is the southernmost point of continental Eurasia. The country has its origins in the Malay kingdoms, which, from the 18th century on, became subject to the British Empire, along with the British Straits Settlements protectorate. During World War Two, British Malaya, along with other nearby British and American colonies, was occupied by the Empire of Japan. Following three years of occupation, Peninsular Malaysia was briefly unified as the Malayan Union in 1946 until 1948 when it was restructured as the Federation of Malaya. The country achieved independence on 31 August 1957. On 16 September 1963, independent Malaya united with the then British crown colonies of North Borneo, Sarawak, and Singapore to become Malaysia. In August 1965, Singapore was expelled from the federation and became a separate, independent country. The country is multiethnic and multicultural, which has a",
    "Maldives": "The Maldives, officially the Republic of Maldives, and historically known as the Maldive Islands, is a country and archipelagic state in South Asia in the Indian Ocean. The Maldives is southwest of Sri Lanka and India, about 750 kilometres (470 miles; 400 nautical miles) from the Asian continent's mainland. The Maldives' chain of 26 atolls stretches across the equator from Ihavandhippolhu Atoll in the north to Addu Atoll in the south. The Maldives is the smallest country in Asia. Including the sea, the territory spans roughly 90,000 square kilometres (35,000 sq mi), with a land area of 298 square kilometres (115 sq mi). The Maldives is one of the world's most geographically dispersed sovereign states, and the smallest Muslim country by land area. With a population of 515,132 in the 2022 census, it is the 2nd least populous country in Asia and the ninth-smallest country in the world by area, but also one of the most densely populated countries in the world. Malé is the capital and the most populated city, traditionally called the \"King's Island\", where the ancient royal dynasties ruled from its central location. The Maldivian Archipelago is located on the Chagos–Laccadive Ridge, a vast submarine mountain range in the Indian Ocean; this also forms a terrestrial ecoregion with the Chagos Archipelago and Lakshadweep. The Maldives has an average ground-level elevation of 1.5 metres (4 ft 11 in) above sea level, and a highest natural point of only 2.4 metres (7 ft 10 in), making it the world's lowest-lying country. Some sources state the highest point, Mount Villingili, as 5.1 metres or 17 feet. The Maldives has been inhabited for over 2,500 years. Documented contact with the outside world began around 947 AD when Arab travelers began visiting the islands. In the 12th century, partly due to the",
    "Mongolia": "Mongolia is a landlocked country in East Asia, bordered by Russia to the north and China to the south. It covers an area of 1,564,116 square kilometres (603,909 square miles), with a population of 3.5 million, making it the world's most sparsely populated sovereign state. Mongolia is the world's largest landlocked country that does not border a closed sea, and much of its area is covered by grassy steppe, with mountains to the north and west and the Gobi Desert to the south. Ulaanbaatar, the capital and largest city, is home to roughly half of the country's population. The territory of modern-day Mongolia has been ruled by various nomadic empires, including the Xiongnu, the Xianbei, the Rouran, the First Turkic Khaganate, the Second Turkic Khaganate, the Uyghur Khaganate and others. In 1206, Genghis Khan founded the Mongol Empire, which became the largest contiguous land empire in history. His grandson Kublai Khan conquered China proper and established the Yuan dynasty. After the collapse of the Yuan, the Mongols retreated to Mongolia and resumed their earlier pattern of factional conflict, except during the era of Dayan Khan and Tumen Zasagt Khan. In the 16th century, Tibetan Buddhism spread to Mongolia, being further led by the Manchu-founded Qing dynasty, which absorbed the country in the 17th century. By the early 20th century, almost one-third of the adult male population were Buddhist monks. After the collapse of the Qing dynasty in 1911, Mongolia declared independence, and achieved actual independence from the Republic of China in 1921. Shortly thereafter, the country became a satellite state of the Soviet Union. In 1924, the Mongolian People's Republic was founded as a socialist state. After the anti-communist revolutions of 1989, Mongolia conducted its own peaceful democratic revolution in early 1990. This led to a multi-party system, a new",
    "Myanmar": "Myanmar, officially the Republic of the Union of Myanmar and also rendered Burma (the official English form until 1989), is a country in northwest Southeast Asia. It is the largest country by area in Mainland Southeast Asia and has a population of about 55 million. It is bordered by India to its west, Bangladesh to its southwest, China to its northeast, Laos and Thailand to its east and southeast, and the Andaman Sea and the Bay of Bengal to its south and southwest. The country's capital city is Naypyidaw, and its largest city is Yangon (formerly Rangoon). Early civilisations in the area included the Tibeto-Burman-speaking Pyu city-states in Upper Myanmar and the Mon kingdoms in Lower Myanmar. In the 9th century, the Bamar people entered the upper Irrawaddy valley, and following the establishment of the Pagan Kingdom in the 1050s, the Burmese language, culture, and Theravada Buddhism slowly became dominant in the country. The Pagan Kingdom fell to Mongol invasions, and several warring states emerged. In the 16th century, reunified by the Taungoo dynasty, the country became the largest empire in the history of Southeast Asia for a short period. The early 19th-century Konbaung dynasty ruled over an area that included modern Myanmar and briefly controlled Manipur and Assam as well. The British East India Company seized control of the administration of Myanmar after three Anglo-Burmese Wars in the 19th century, and the country became a British colony. After a brief Japanese occupation, Myanmar was reconquered by the Allies. On 4 January 1948, Myanmar declared independence under the terms of the Burma Independence Act 1947. Myanmar's post-independence history has been checkered by continuing unrest and conflict to this day. The coup d'état in 1962 resulted in a military dictatorship under the Burma Socialist Programme Party. On 8 August 1988, the",
    "Nepal": "Nepal, officially the Federal Democratic Republic of Nepal, is a landlocked country in South Asia. It is mainly situated in the Himalayas, but also includes parts of the Indo-Gangetic Plain. It borders the Tibet Autonomous Region of China to the north, and India to the south, east, and west, while it is narrowly separated from Bangladesh by the Siliguri Corridor, and from Bhutan by the Indian state of Sikkim. Nepal has a diverse geography, including fertile plains, subalpine forested hills, and eight of the world's ten tallest mountains, including Mount Everest, the highest point on Earth. Kathmandu is the nation's capital and the largest city. Nepal is a multi-ethnic, multi-lingual, multi-religious and multi-cultural state, with Nepali as the official language. The name \"Nepal\" is first recorded in texts from the Vedic period of the Indian subcontinent, the era in ancient Nepal when Hinduism was founded, the predominant religion of the country. In the middle of the first millennium BC, Gautama Buddha, the founder of Buddhism, was born in Lumbini in southern Nepal. Parts of northern Nepal were intertwined with the culture of Tibet. The centrally located Kathmandu Valley is intertwined with the culture of Indo-Aryans, and was the seat of the prosperous Newar confederacy known as Nepal Mandala. The Himalayan branch of the ancient Silk Road was dominated by the valley's traders. The cosmopolitan region developed distinct traditional art and architecture. By the 18th century, the Gorkha Kingdom achieved the unification of Nepal. The Shah dynasty established the Kingdom of Nepal and later formed an alliance with the British Empire, under its Rana dynasty of premiers. The country was never colonised but served as a buffer state between Imperial China and British India. Parliamentary democracy was introduced in 1951 but was twice suspended by Nepalese monarchs, in 1960 and 2005.",
    "North Korea": "North Korea, officially the Democratic People's Republic of Korea (DPRK), is a country in East Asia. It constitutes the northern half of the Korean Peninsula and borders China and Russia to the north at the Yalu (Amnok) and Tumen rivers, and South Korea to the south at the Korean Demilitarized Zone. The country's western border is formed by the Yellow Sea, while its eastern border is defined by the Sea of Japan. North Korea, like its southern counterpart, claims to be the sole legitimate government of the entire peninsula and adjacent islands. Pyongyang is the capital and largest city. The Korean Peninsula was first inhabited as early as the Lower Paleolithic period. Its first kingdom was noted in Chinese records in the early 7th century BCE. Following the unification of the Three Kingdoms of Korea into Silla and Balhae in the late 7th century, Korea was ruled by the Goryeo dynasty (918–1392) and the Joseon dynasty (1392–1897). The succeeding Korean Empire (1897–1910) was annexed in 1910 into the Empire of Japan. In 1945, after the Japanese surrender at the end of World War II, Korea was divided into two zones along the 38th parallel, with the north occupied by the Soviet Union and the south occupied by the United States. In 1948, separate governments were formed in Korea: the socialist and Soviet-aligned Democratic People's Republic of Korea in the north, and the capitalist, Western-aligned Republic of Korea in the south. North Korean invasion of South Korea in 1950 started the Korean War. In 1953, the Korean Armistice Agreement brought about a ceasefire and established a demilitarized zone (DMZ), but no formal peace treaty has ever been signed. Post-war North Korea benefited greatly from economic aid and expertise provided by other Eastern Bloc countries. However, Kim Il Sung, North Korea's first",
    "Oman": "Oman, officially the Sultanate of Oman, is a country on the southeastern coast of the Arabian Peninsula in West Asia. It overlooks the mouth of the Persian Gulf. It shares land borders with Saudi Arabia, the United Arab Emirates, and Yemen. The capital and largest city is Muscat. Oman has a population of about 5.28 million as of 2024, which is a 4.60% population increase from 2023. and is the 123rd most-populous country. The coast faces the Arabian Sea on the southeast, and the Gulf of Oman on the northeast. The Madha and Musandam exclaves are surrounded by United Arab Emirates on their land borders, with the Strait of Hormuz (which it shares with Iran) and the Gulf of Oman forming Musandam's coastal boundaries. From the 17th century, the Omani Sultanate was an empire, vying with the Portuguese and British empires for influence in the Persian Gulf and the Indian Ocean. At its peak in the 19th century, Omani influence and control extended across the Strait of Hormuz to Iran and Pakistan, and as far south as Zanzibar. In the 20th century, the sultanate came under the influence of the United Kingdom. For over 300 years, the relations built between the two empires were based on mutual benefit. The UK recognized Oman's geographical importance as a trading hub that secured British trading-lanes in the Persian Gulf and Indian Ocean and protected London's interests in the Indian sub-continent. Oman is an absolute monarchy led by a sultan, with power passed down through the male line. Qaboos bin Said was the Sultan from 1970 until his death on 10 January 2020. Qaboos, who died childless, had named his cousin, Haitham bin Tariq, as his successor in a letter, and the ruling family confirmed him as the new Sultan of Oman. Formerly a",
    "Pakistan": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the fifth-most populous country, with a population of over 241.5 million, having the second-largest Muslim population as of 2023. Islamabad is the nation's capital, while Karachi is its largest city and financial centre. Pakistan is the 33rd-largest country by area. Bounded by the Arabian Sea on the south, the Gulf of Oman on the southwest, and the Sir Creek on the southeast, it shares land borders with India to the east; Afghanistan to the west; Iran to the southwest; and China to the northeast. It shares a maritime border with Oman in the Gulf of Oman, and is separated from Tajikistan in the northwest by Afghanistan's narrow Wakhan Corridor. Pakistan is the site of several ancient cultures, including the 8,500-year-old Neolithic site of Mehrgarh in Balochistan, the Indus Valley Civilisation of the Bronze Age, and the ancient Gandhara civilisation. The regions that compose the modern state of Pakistan were the realm of multiple empires and dynasties, including the Gandhāra, the Achaemenid, the Maurya, the Kushan, the Parthian, the Paratarajas, the Gupta; the Umayyad Caliphate in its southern regions, the Hindu Shahis, the Ghaznavids, the Delhi Sultanate, the Samma, the Shah Miris, the Mughals, the Durranis, the Sikhs and most recently, the British Raj from 1858 to 1947. Spurred by the Pakistan Movement, which sought a homeland for the Muslims of British India, and election victories in 1946 by the All-India Muslim League, Pakistan gained independence in 1947 after the Partition of the British Indian Empire, which awarded separate statehood to its Muslim-majority regions and was accompanied by an unparalleled mass migration and loss of life. Initially a Dominion of the British Commonwealth, Pakistan officially drafted its constitution in 1956, and emerged as a declared Islamic",
    "Palestine": "Palestine, officially the State of Palestine, is a country in the southern Levant region of West Asia recognized by 146 out of 193 UN member states. It encompasses the Israeli-occupied West Bank, including East Jerusalem, and the Gaza Strip, collectively known as the occupied Palestinian territories, within the broader geographic and historical Palestine region. Palestine shares most of its borders with Israel, and it borders Jordan to the east and Egypt to the southwest. It has a total land area of 6,020 square kilometres (2,320 sq mi) while its population exceeds five million people. Its proclaimed capital is Jerusalem, while Ramallah serves as its administrative center. Gaza City was its largest city prior to evacuations in 2023. Situated at a continental crossroad, the region of Palestine was ruled by various empires and experienced various demographic changes from antiquity to the modern era. Being a bridge between Asia and Africa, it was treading ground for the Nile and Mesopotamian armies and merchants from North Africa, China and India. The region is known for its religious significance. The ongoing Israeli–Palestinian conflict dates back to the rise of the Zionist movement, supported by the United Kingdom during World War I. The war saw Britain occupying Palestine from the Ottoman Empire, where it set up Mandatory Palestine under the auspices of the League of Nations. During this period, large-scale Jewish immigration allowed by the British authorities led to increased tensions and violence with the local Palestinian Arab population. In 1947, Britain handed the issue to the United Nations, which proposed a partition plan, for two independent Arab and Jewish states and an independent entity for Jerusalem, but a civil war broke out, and the plan was not implemented. The 1948 Palestine war saw the forcible displacement of most of its predominantly Arab population, and",
    "Philippines": "The Philippines, officially the Republic of the Philippines, is an archipelagic country in Southeast Asia. In the western Pacific Ocean, it consists of 7,641 islands, with a total area of roughly 300,000 square kilometers, which are broadly categorized in three main geographical divisions from north to south: Luzon, Visayas, and Mindanao. The Philippines is bounded by the South China Sea to the west, the Philippine Sea to the east, and the Celebes Sea to the south. It shares maritime borders with Taiwan to the north, Japan to the northeast, Palau to the east and southeast, Indonesia to the south, Malaysia to the southwest, Vietnam to the west, and China to the northwest. It is the world's twelfth-most-populous country, with diverse ethnicities and cultures. Manila is the country's capital, and its most populated city is Quezon City. Both are within Metro Manila. Negritos, the archipelago's earliest inhabitants, were followed by waves of Austronesian peoples. The adoption of animism, Hinduism with Buddhist influence, and Islam established island-kingdoms ruled by datus, rajas, and sultans. Extensive overseas trade with neighbors such as the late Tang or Song empire brought Chinese people to the archipelago as well, which would also gradually settle in and intermix over the centuries. The arrival of Ferdinand Magellan, a Portuguese explorer leading a fleet for Castile, marked the beginning of Spanish colonization. In 1543, Spanish explorer Ruy López de Villalobos named the archipelago Las Islas Filipinas in honor of King Philip II of Castile. Spanish colonization via New Spain, beginning in 1565, led to the Philippines becoming ruled by the Crown of Castile, as part of the Spanish Empire, for more than 300 years. Catholic Christianity became the dominant religion, and Manila became the western hub of trans-Pacific trade. Hispanic immigrants from Latin America and Iberia would also selectively colonize.",
    "Qatar": "Qatar, officially the State of Qatar, is a country in West Asia. It occupies the Qatar Peninsula on the northeastern coast of the Arabian Peninsula in the Middle East; it shares its sole land border with Saudi Arabia to the south, with the rest of its territory surrounded by the Persian Gulf. The Gulf of Bahrain, an inlet of the Persian Gulf, separates Qatar from nearby Bahrain. The capital is Doha, home to over 80% of the country's inhabitants. Most of the land area is made up of flat, low-lying desert. Qatar has been ruled as a hereditary monarchy by the House of Thani since Mohammed bin Thani signed \"an agreement, not a formal treaty\" with Britain in 1868 that recognised its separate status. Following Ottoman rule, Qatar became a British protectorate in 1916 and gained independence in 1971. The current emir is Tamim bin Hamad Al Thani, who holds nearly all executive, legislative, and judicial authority in an autocratic manner under the Constitution of Qatar. He appoints the prime minister and cabinet. The partially-elected Consultative Assembly can block legislation and has a limited ability to dismiss ministers. In early 2017, the population of Qatar was 2.6 million, although only 313,000 of them are Qatari citizens and 2.3 million being expatriates and migrant workers. Its official religion is Islam. The country has the fourth-highest GDP (PPP) per capita in the world and the eleventh-highest GNI per capita (Atlas method). It ranks 42nd in the Human Development Index, the third-highest HDI in the Arab world. It is a high-income economy, backed by the world's third-largest natural gas reserves and oil reserves. Qatar is one of the world's largest exporters of liquefied natural gas and the world's largest emitter of carbon dioxide per capita. In the 21st century, Qatar emerged as both",
    "Russia": "Russia, or the Russian Federation, is a country spanning Eastern Europe and North Asia. It is the largest country in the world by area, extending across eleven time zones and sharing land borders with fourteen countries. It is the world's ninth-most populous country and Europe's most populous country. Russia is a highly urbanised country including 16 population centres with over a million inhabitants. Its capital and largest city is Moscow. Saint Petersburg is Russia's second-largest city and its cultural capital. The East Slavs emerged as a recognised group in Europe between the 3rd and 8th centuries CE. The first East Slavic state, Kievan Rus', arose in the 9th century, and in 988, it adopted Orthodox Christianity from the Byzantine Empire. Kievan Rus' ultimately disintegrated; the Grand Duchy of Moscow led the unification of Russian lands, leading to the proclamation of the Tsardom of Russia in 1547. By the early 18th century, Russia had vastly expanded through conquest, annexation, and the efforts of Russian explorers, developing into the Russian Empire, which remains the third-largest empire in history. However, with the Russian Revolution in 1917, Russia's monarchic rule was abolished and eventually replaced by the Russian SFSR—the world's first constitutionally socialist state. Following the Russian Civil War, the Russian SFSR established the Soviet Union with three other Soviet republics, within which it was the largest and principal constituent. At the expense of millions of lives, the Soviet Union underwent rapid industrialisation in the 1930s and later played a decisive role for the Allies in World War II by leading large-scale efforts on the Eastern Front. With the onset of the Cold War, it competed with the United States for ideological dominance and international influence. The Soviet era of the 20th century saw some of the most significant Russian technological achievements, including the",
    "Saudi Arabia": "Saudi Arabia, officially the Kingdom of Saudi Arabia (KSA), is a country in West Asia. Located in the centre of the Middle East, it is one of the countries situated in the Gulf region. It covers the bulk of the Arabian Peninsula and has a land area of about 2,150,000 km2 (830,000 sq mi), making it the fifth-largest country in Asia, the largest in the Middle East, and the 12th-largest in the world. It is bordered by the Red Sea to the west; Jordan, Iraq, and Kuwait to the north; the Persian Gulf, Bahrain, Qatar and the United Arab Emirates to the east; Oman to the southeast; and Yemen to the south. The Gulf of Aqaba in the northwest separates Saudi Arabia from Egypt and Israel. Saudi Arabia is the only country with a coastline along both the Red Sea and the Persian Gulf, and most of its terrain consists of arid desert, lowland, steppe, and mountains. The capital and largest city is Riyadh; other major cities include Jeddah and the two holiest cities in Islam, Mecca and Medina. With a population of almost 32.2 million, Saudi Arabia is the fourth most populous country in the Arab world. Pre-Islamic Arabia, the territory that constitutes modern-day Saudi Arabia, was the site of several ancient cultures and civilizations; the prehistory of Saudi Arabia shows some of the earliest traces of human activity outside Africa. Islam, the world's second-largest religion, emerged in what is now Saudi Arabia in the early seventh century. Islamic prophet Muhammad united the population of the Arabian Peninsula and created a single Islamic religious polity. Following his death in 632, his followers expanded Muslim rule beyond Arabia, conquering territories in North Africa, Central, South Asia and Iberia within decades. Arab dynasties originating from modern-day Saudi Arabia founded the Rashidun",
    "Singapore": "Singapore, officially the Republic of Singapore, is an island country and city-state in maritime Southeast Asia. The country's territory comprises one main island, 63 satellite islands and islets, and one outlying islet. It is about one degree of latitude (137 kilometres or 85 miles) north of the equator, off the southern tip of the Malay Peninsula, bordering the Strait of Malacca to the west, the Singapore Strait to the south along with the Riau Islands in Indonesia, the South China Sea to the east, and the Straits of Johor along with the State of Johor in Malaysia to the north. Singapore's history dates back at least eight hundred years, having been a maritime emporium known as Temasek and subsequently a major constituent part of several successive thalassocratic empires. Its contemporary era began in 1819, when Stamford Raffles established Singapore as an entrepôt trading post of the British Empire. In 1867, Singapore came under the direct control of Britain as part of the Straits Settlements. During World War II, Singapore was occupied by Japan in 1942 and returned to British control as a separate Crown colony following Japan's surrender in 1945. Singapore gained self-governance in 1959 and, in 1963, became part of the new federation of Malaysia, alongside Malaya, North Borneo, and Sarawak. Ideological differences led to Singapore's expulsion from the federation two years later; Singapore became an independent sovereign country in 1965. After early years of turbulence and despite lacking natural resources and a hinterland, the nation rapidly developed to become one of the Four Asian Tigers. As a highly developed country, it has one of the highest GDP per capita (PPP) in the world. It is also identified as a tax haven. Singapore is the only country in Asia with a AAA sovereign credit rating from all major rating",
    "South Korea": "South Korea, officially the Republic of Korea (ROK), is a country in East Asia. It constitutes the southern part of the Korean Peninsula and borders North Korea along the Korean Demilitarized Zone; though it also claims the land border with China and Russia. The country's western border is formed by the Yellow Sea, while its eastern border is defined by the Sea of Japan. South Korea claims to be the sole legitimate government of the entire peninsula and adjacent islands. It has a population of 51.96 million, of which half live in the Seoul Capital Area, the ninth most populous metropolitan area in the world. Other major cities include Busan, Daegu, and Incheon. The Korean Peninsula was inhabited as early as the Lower Paleolithic period. Its first kingdom was noted in Chinese records in the early 7th century BCE. After the unification of the Three Kingdoms of Korea into Silla and Balhae in the late 7th century, Korea was ruled by the Goryeo dynasty (918–1392) and the Joseon dynasty (1392–1897). The succeeding Korean Empire (1897–1910) was annexed in 1910 into the Empire of Japan. Japanese rule ended following Japan's surrender in World War II, after which Korea was divided into two zones: a northern zone, which was occupied by the Soviet Union, and a southern zone, which was occupied by the United States. After negotiations on reunification failed, the southern zone became the Republic of Korea in August 1948, while the northern zone became the communist Democratic People's Republic of Korea the following month. In 1950, a North Korean invasion began the Korean War, which ended in 1953 after extensive fighting involving the American-led United Nations Command and the People's Volunteer Army from China with Soviet assistance. The war left 3 million Koreans dead and the economy in ruins. The",
    "Sri Lanka": "Sri Lanka, historically known as Ceylon, and officially the Democratic Socialist Republic of Sri Lanka, is an island country in South Asia. It lies in the Indian Ocean, southwest of the Bay of Bengal, separated from the Indian peninsula by the Gulf of Mannar and the Palk Strait. It shares a maritime border with the Maldives in the southwest and India in the northwest. Sri Lanka has a population of approximately 22 million and is home to several cultures, languages and ethnicities. The Sinhalese people form the majority of the population, followed by the Sri Lankan Tamils, who are the largest minority group and are concentrated in northern Sri Lanka; both groups have played an influential role in the island's history. Other long-established groups include the Moors, Indian Tamils, Burghers, Malays, Chinese, and Vedda. Sri Lanka's documented history goes back 3,000 years, with evidence of prehistoric human settlements dating back 125,000 years. The earliest known Buddhist writings of Sri Lanka, known collectively as the Pali Canon, date to the fourth Buddhist council, which took place in 29 BCE. Also called the Pearl of the Indian Ocean, or the Granary of the East, Sri Lanka's geographic location and deep harbours have made it of great strategic importance, from the earliest days of the ancient Silk Road trade route to today's so-called maritime Silk Road. Because its location made it a major trading hub, it was already known to both East Asians and Europeans as long ago as the Anuradhapura period. During a period of great political crisis in the Kingdom of Kotte, the Portuguese arrived in Sri Lanka and sought to control its maritime trade, with a part of Sri Lanka subsequently becoming a Portuguese possession. After the Sinhalese-Portuguese war, the Dutch colonial empire and the Kingdom of Kandy took control",
    "Syria": "Syria, officially the Syrian Arab Republic, is a country in West Asia located in the Eastern Mediterranean and the Levant. It is bounded by the Mediterranean Sea to the west, Turkey to the north, Iraq to the east and southeast, Jordan to the south, and Israel and Lebanon to the southwest. It is a republic that consists of 14 governorates as subdivisions. Damascus is Syria's capital and largest city. With a population of 25.0 million, it is the 57th most populous country in the world and 8th most populuous in the Arab world. Syria is spread across an area of 185,180 square kilometres (71,500 sq mi), making it 87th largest country in the world. A country of fertile plains, high mountains, and deserts, Syria is home to diverse ethnic and religious groups. Arabs are the largest ethnic group, and Sunni Muslims are the largest religious group. The name \"Syria\" historically referred to a wider region, broadly synonymous with the Levant, and known in Arabic as al-Sham. The modern state encompasses the sites of several ancient kingdoms and empires, including the Eblan civilization of the 3rd millennium BC. Damascus and Aleppo are cities of great cultural significance. During the Islamic rule, Damascus was the seat of the Umayyad Caliphate and a provincial capital for the Mamluk Sultanate in Egypt. The modern Syrian state was established in the mid-20th century after centuries of Ottoman rule, as a French Mandate. The newly created state represented the largest Arab state to emerge from the formerly Ottoman-ruled Syrian provinces. It gained de jure independence as a parliamentary republic in 1945 when the new Republic became a founding member of the United Nations, an act which legally ended the former French mandate. French troops departed in April 1946, granting de facto independence. The post-independence period was",
    "Taiwan": "Taiwan, officially the Republic of China (ROC), is a country in East Asia. The main island of Taiwan, also known as Formosa, lies between the East and South China Seas in the northwestern Pacific Ocean, with the People's Republic of China (PRC) to the northwest, Japan to the northeast, and the Philippines to the south. It has an area of 35,808 square kilometres (13,826 square miles), with mountain ranges dominating the eastern two-thirds and plains in the western third, where its highly urbanized population is concentrated. The combined territories under ROC control consist of 168 islands in total covering 36,193 square kilometres (13,974 square miles). The largest metropolitan area is formed by Taipei (the capital), New Taipei City, and Keelung. With around 23.9 million inhabitants, Taiwan is among the most densely populated countries. Taiwan has been settled for at least 25,000 years. Ancestors of Taiwanese indigenous peoples settled the island around 6,000 years ago. In the 17th century, large-scale Han Chinese immigration began under a Dutch colony and continued under the Kingdom of Tungning, the first predominantly Han Chinese state in Taiwanese history. The island was annexed in 1683 by the Qing dynasty of China and ceded to the Empire of Japan in 1895. The Republic of China, which had overthrown the Qing in 1912 under the leadership of Sun Yat-sen, took control following the surrender of Japan in 1945. The immediate resumption of the Chinese Civil War resulted in the loss of the Chinese mainland to Communist forces, who established the People's Republic of China and the flight of the ROC central government to Taiwan in 1949. The effective jurisdiction of the ROC has since been limited to Taiwan, Penghu, and smaller islands. The early 1960s saw rapid economic growth and industrialization called the \"Taiwan Miracle\". In the late",
    "Tajikistan": "Tajikistan, officially the Republic of Tajikistan, is a landlocked country in Central Asia. Dushanbe is the capital and most populous city. Tajikistan is bordered by Afghanistan to the south, Uzbekistan to the west, Kyrgyzstan to the north, and China to the east. It is separated from Pakistan by Afghanistan's Wakhan Corridor. It has a population of approximately 10.6 million people. The territory was previously home to cultures of the Neolithic and the Bronze Age, including the city of Sarazm, and was later home to kingdoms ruled by people of various faiths and cultures including the Oxus civilization, Andronovo culture, Buddhism, Nestorian Christianity, Hinduism, Zoroastrianism, Manichaeism, and Islam. The area has been ruled by empires and dynasties including the Achaemenid Empire, Sasanian Empire, Hephthalite Empire, Samanid Empire, and Mongol Empire. After being ruled by the Timurid Empire and Khanate of Bukhara, the Timurid Renaissance flourished. The region was later conquered by the Russian Empire, before becoming part of the Soviet Union. Within the Soviet Union, the country's borders were drawn when it was part of Uzbekistan as an autonomous republic before becoming a constituent republic of the Soviet Union on 5 December 1929. On 9 September 1991, Tajikistan declared itself an independent sovereign nation as the Soviet Union was disintegrating. A civil war was fought after independence, lasting from May 1992 to June 1997. Since the end of the war, newly established political stability and foreign aid have allowed the country's economy to grow. The country has been led since 1994 by Emomali Rahmon, who heads an authoritarian regime and whose human rights record has been criticised. Tajikistan is a presidential republic consisting of four provinces. Tajiks form the ethnic majority in the country, and their national language is Tajik. Russian is used as the official inter-ethnic language. While the state",
    "Thailand": "Thailand, officially the Kingdom of Thailand and historically known as Siam (the official name until 1939), is a country in Southeast Asia on the Indochinese Peninsula. With a population of almost 66 million, it spans 513,115 square kilometres (198,115 sq mi). Thailand is bordered to the northwest by Myanmar, to the northeast and east by Laos, to the southeast by Cambodia, to the south by the Gulf of Thailand and Malaysia, and to the southwest by the Andaman Sea; it also shares maritime borders with Vietnam to the southeast and Indonesia and India to the southwest. Bangkok is the state capital and largest city. Thai peoples migrated from southwestern China to mainland Southeast Asia from the 6th to 11th centuries. Indianised kingdoms such as the Mon, Khmer Empire, and Malay states ruled the region, competing with Thai states such as the Kingdoms of Ngoenyang, Sukhothai, Lan Na, and Ayutthaya, which also rivalled each other. European contact began in 1511 with a Portuguese diplomatic mission to Ayutthaya, which became a regional power by the end of the 15th century. Ayutthaya reached its peak during the 18th century, until it was destroyed in the Burmese–Siamese War. King Taksin the Great quickly reunified the fragmented territory and established the short-lived Thonburi Kingdom (1767–1782), of which he was the only king. He was succeeded in 1782 by Phutthayotfa Chulalok (Rama I), the first monarch of the current Chakri dynasty. Throughout the era of Western imperialism in Asia, Siam remained the only state in the region to avoid colonization by foreign powers, although it was often forced to make territorial, trade, and legal concessions in unequal treaties. The Siamese system of government was centralised and transformed into a modern unitary absolute monarchy during the 1868–1910 reign of Chulalongkorn (Rama V). In World War I, Siam",
    "Timor-Leste": "East Timor, also known as Timor-Leste, officially the Democratic Republic of Timor-Leste, is a country in Southeast Asia. It comprises the eastern half of the island of Timor, the exclave of Oecusse on the island's north-western half, and the minor islands of Atauro and Jaco. The western half of the island of Timor is administered by Indonesia. Australia is the country's southern neighbour, separated by the Timor Sea. The country's size is 14,950 square kilometres (5,770 sq mi). Dili, on the north coast of Timor, is its capital and largest city. Timor was settled by Papuan and Austronesian peoples, which are reflected in the country's diverse mix of cultures and languages, displaying links to Southeast Asia and Melanesia. East Timor came under Portuguese influence in the sixteenth century, remaining a Portuguese colony until 1975. Internal conflict preceded a unilateral declaration of independence and an Indonesian invasion and annexation. Resistance continued throughout Indonesian rule and in 1999, a United Nations–sponsored act of self-determination led to Indonesia relinquishing control of the territory. On 20 May 2002, as Timor-Leste, it became the first new sovereign state of the 21st century. That same year, relations with Indonesia were established and normalized, with Indonesia also supporting East Timor's accession into ASEAN. The national government runs on a semi-presidential system, with the popularly elected president sharing power with a prime minister appointed by the National Parliament. Power is centralised under the national government, although many local leaders have informal influence. The country maintains a policy of international cooperation, and is a member of the Community of Portuguese Language Countries, an observer of the Pacific Islands Forum, and an applicant for ASEAN membership. The country remains relatively poor, with an economy that relies heavily on natural resources, especially oil, and foreign aid. The total population is over",
    "Turkey": "Turkey, officially the Republic of Türkiye, is a country mainly located in Anatolia in West Asia, with a smaller part called East Thrace in Southeast Europe. It borders the Black Sea to the north; Georgia, Armenia, Azerbaijan, and Iran to the east; Iraq, Syria, and the Mediterranean Sea to the south; and the Aegean Sea, Greece, and Bulgaria to the west. Turkey is home to over 85 million people; most are ethnic Turks, while ethnic Kurds are the largest ethnic minority. Officially a secular state, Turkey has a Muslim-majority population. Ankara is Turkey's capital and second-largest city, while Istanbul is its largest city and economic and financial center. Other major cities include İzmir, Bursa, and Antalya. Turkey was first inhabited by modern humans during the Late Paleolithic. Home to important Neolithic sites like Göbekli Tepe and some of the earliest farming areas, present-day Turkey was inhabited by various ancient peoples. The Hattians were assimilated by the Anatolian peoples, such as the Hittites. Classical Anatolia transitioned into cultural Hellenization following the conquests of Alexander the Great; Hellenization continued during the Roman and Byzantine eras. The Seljuk Turks began migrating into Anatolia in the 11th century, starting the Turkification process. The Seljuk Sultanate of Rum ruled Anatolia until the Mongol invasion in 1243, when it disintegrated into Turkish principalities. Beginning in 1299, the Ottomans united the principalities and expanded; Mehmed II conquered Istanbul in 1453. During the reigns of Selim I and Suleiman the Magnificent, the Ottoman Empire became a global power. From 1789 onwards, the empire saw a major transformation, reforms, and centralization while its territory declined. In the 19th and early 20th centuries, persecution of Muslims during the Ottoman contraction and in the Russian Empire resulted in large-scale loss of life and mass migration into modern-day Turkey from the Balkans,",
    "Turkmenistan": "Turkmenistan is a landlocked country in Central Asia bordered by Kazakhstan to the northwest, Uzbekistan to the north, east and northeast, Afghanistan to the southeast, Iran to the south and southwest and the Caspian Sea to the west. Ashgabat is the capital and largest city. It is one of the six independent Turkic states. With a population over 7 million, Turkmenistan is the 35th most-populous country in Asia and has the lowest population of the Central Asian republics while being one of the most sparsely populated nations on the Asian continent. Turkmenistan has long served as a thoroughfare for several empires and cultures. Merv is one of the oldest oasis-cities in Central Asia, and was once among the biggest cities in the world. It was also one of the great cities of the Islamic world and an important stop on the Silk Road. Annexed by the Russian Empire in 1881, Turkmenistan figured prominently in the anti-Bolshevik movement in Central Asia. In 1925, Turkmenistan became a constituent republic of the Soviet Union, the Turkmen Soviet Socialist Republic (Turkmen SSR); it became independent after the dissolution of the Soviet Union in 1991. The country is widely criticized for its poor human rights, including for its treatment of minorities, and its lack of press and religious freedoms. Since the independence declared from the Soviet Union in 1991, Turkmenistan has been ruled by repressive totalitarian regimes: that of President for Life Saparmurat Niyazov (also known as Türkmenbaşy or \"Head of the Turkmens\") until his death in 2006; Gurbanguly Berdimuhamedow, who became president in 2007 after winning a non-democratic election (he had been vice-president and then acting president previously); and his son Serdar, who won a subsequent 2022 presidential election described by international observers as neither free nor fair, and now shares power with his",
    "United Arab Emirates": "The United Arab Emirates (UAE), or simply the Emirates, is a country in West Asia, in the Middle East, at the eastern end of the Arabian Peninsula. It is a federal, elective monarchy composed of seven emirates, with Abu Dhabi as its capital. It shares land borders with Oman to the east and northeast, and with Saudi Arabia to the southwest; as well as maritime borders in the Persian Gulf with Qatar and Iran, and with Oman in the Gulf of Oman. As of 2024, the UAE has an estimated population of over 10 million, of which 11% are Emiratis; Dubai is the most populous city and is an international hub. Islam is the official religion and Arabic is the official language, while English is the most spoken language and the language of business. The United Arab Emirates' oil and natural gas reserves are the world's seventh and seventh-largest, respectively. Zayed bin Sultan Al Nahyan, ruler of Abu Dhabi and the country's first president, oversaw the development of the Emirates by investing oil revenues into healthcare, education, and infrastructure. The country has the most diversified economy among the members of the Gulf Cooperation Council (GCC). In the 21st century, the UAE has become less reliant on oil and gas and is economically focusing on tourism and business. The UAE is considered a middle power. It is also a member of the United Nations, Arab League, Organisation of Islamic Cooperation, OPEC, Non-Aligned Movement, World Trade Organization, and BRICS. The UAE is also a dialogue partner of the Shanghai Cooperation Organisation. Human rights organisations consider the UAE substandard on human rights, ranking only 6.06 in the human freedom index, citing reports of government critics being imprisoned and tortured, families harassed by the state security apparatus, and cases of forced disappearances. Individual rights",
    "Uzbekistan": "Uzbekistan, officially the Republic of Uzbekistan, is a doubly landlocked country located in Central Asia. It is surrounded by five countries: Kazakhstan to the north, Kyrgyzstan to the northeast, Tajikistan to the southeast, Afghanistan to the south, and Turkmenistan to the southwest, making it one of only two doubly landlocked countries on Earth, the other being Liechtenstein. Uzbekistan is part of the Turkic world, as well as a member of the Organization of Turkic States. Uzbek, spoken by the Uzbek people, is the official language and spoken by the majority of its inhabitants, while Russian and Tajik are significant minority languages. Islam is the predominant religion, and most Uzbeks are Sunni Muslims. The first recorded settlers in the land of what is modern Uzbekistan were Eastern Iranian nomads, known as Scythians, who founded kingdoms in Khwarazm, Bactria, and Sogdia in the 8th–6th centuries BC, as well as Fergana and Margiana in the 3rd century BC – 6th century AD. The area was incorporated into the Achaemenid Empire and, after a period of Greco-Bactrian rule and later by the Sasanian Empire, until the Muslim conquest of Persia in the seventh century. The early Muslim conquests and the subsequent Samanid Empire converted most of the people into adherents of Islam. During this period, cities began to grow rich from the Silk Road, and became a center of the Islamic Golden Age. The local Khwarazmian dynasty was destroyed by the Mongol invasion in the 13th century, leading to a dominance by Mongol peoples. Timur (Tamerlane) in the 14th century established the Timurid Empire. Its capital was Samarkand, which became a centre of science under the rule of Ulugh Beg, giving birth to the Timurid Renaissance. The territories of the Timurid dynasty were conquered by Kipchak Shaybanids in the 16th century. Conquests by Emperor",
    "Vietnam": "Vietnam, officially the Socialist Republic of Vietnam, is a country at the eastern edge of mainland Southeast Asia, with an area of about 331,000 square kilometres (128,000 sq mi) and a population of over 100 million, making it the world's fifteenth-most populous country. One of the two Marxist–Leninist states in Southeast Asia, Vietnam shares land borders with China to the north, and Laos and Cambodia to the west. It shares maritime borders with Thailand through the Gulf of Thailand, and the Philippines, Indonesia, and Malaysia through the South China Sea. Its capital is Hanoi and its largest city is Ho Chi Minh City (commonly known as Saigon). Vietnam was inhabited by the Paleolithic age, with states established in the first millennium BC on the Red River Delta in modern-day northern Vietnam. The Han dynasty annexed Northern and Central Vietnam, which were subsequently under Chinese rule from 111 BC until the first dynasty emerged in 939. Successive monarchical dynasties absorbed Chinese influences through Confucianism and Buddhism, and expanded southward to the Mekong Delta, conquering Champa. During most of the 17th and 18th centuries, Vietnam was effectively divided into two domains of Đàng Trong and Đàng Ngoài. The Nguyễn—the last imperial dynasty—surrendered to France in 1883. In 1887, its territory was integrated into French Indochina as three separate regions. In the immediate aftermath of World War II, the nationalist coalition Viet Minh, led by the communist revolutionary Ho Chi Minh, launched the August Revolution and declared Vietnam's independence from the Empire of Japan in 1945. Vietnam went through prolonged warfare in the 20th century. After World War II, France returned to reclaim colonial power in the First Indochina War, from which Vietnam emerged victorious in 1954. As a result of the treaties signed between the Viet Minh and France, Vietnam was also",
    "Yemen": "Yemen, officially the Republic of Yemen, is a country in West Asia. Located in southern Arabia, it borders Saudi Arabia to the north, Oman to the northeast, the Red Sea to the west, and the Indian Ocean to the south, sharing maritime borders with Eritrea, Djibouti and Somalia across the Horn of Africa. Covering roughly 528,000 square kilometres (203,861 square miles), with a coastline of approximately 2,000 kilometres (1,200 miles), Yemen is the second largest country on the Arabian Peninsula. Sanaa is its constitutional capital and largest city. Yemen's estimated population is 34.7 million, mostly Arab Muslims. It is a member of the Arab League, the United Nations, the Non-Aligned Movement and the Organisation of Islamic Cooperation. Owing to its geographic location, Yemen has been at the crossroads of many civilisations for over 7,000 years. In 1200 BCE, the Sabaeans formed a thriving commercial kingdom that included parts of modern Ethiopia and Eritrea. In 275 CE, it was succeeded by the Himyarite Kingdom, which spanned much of Yemen's present-day territory and was heavily influenced by Judaism. Christianity arrived in the fourth century, followed by the rapid spread of Islam in the seventh century. Yemenite troops played a crucial role in early Islamic conquests. Various dynasties emerged between the 9th and 16th centuries. During the 19th century, the country was divided between the Ottoman and British empires. After World War I, the Kingdom of Yemen was established, which in 1962 became the Yemen Arab Republic (North Yemen) following a coup. In 1967, the British Aden Protectorate became the independent People's Democratic Republic of Yemen (South Yemen), the first and only officially socialist state in the Arab world. In 1990, the two Yemeni states united to form the modern Republic of Yemen, with Ali Abdullah Saleh serving as the first president until"
}