{
    "Australia": "Australia, officially the Commonwealth of Australia, is a country comprising the mainland of the Australian continent, the island of Tasmania and numerous smaller islands. Australia has a total area of 7,688,287 km2 (2,968,464 sq mi), making it the sixth-largest country in the world and the largest country by area in Oceania. It is the world's oldest, flattest, and driest inhabited continent, with some of the least fertile soils. It is a megadiverse country, and its size gives it a wide variety of landscapes and climates including deserts in the interior and tropical rainforests along the coast. The ancestors of Aboriginal Australians began arriving from south-east Asia 50,000 to 65,000 years ago, during the last glacial period. They settled on the continent and formed approximately 250 distinct language groups by the time of European settlement, maintaining some of the longest known continuing artistic and religious traditions in the world. Australia's written history commenced with Dutch exploration of most of the coastline in the 17th-century. British colonisation began in 1788 with the establishment of the penal colony of New South Wales. By the mid-19th century, most of the continent had been explored by European settlers and five additional self-governing British colonies were established, each gaining responsible government by 1890. The colonies federated in 1901, forming the Commonwealth of Australia. This continued a process of increasing autonomy from the United Kingdom, highlighted by the Statute of Westminster Adoption Act 1942, and culminating in the Australia Acts of 1986. Australia is a federal parliamentary democracy and constitutional monarchy comprising six states and ten territories. Its population of more than 27 million is highly urbanised and heavily concentrated on the eastern seaboard. Canberra is the nation's capital, while its most populous cities are Sydney and Melbourne, both with a population of more than 5 million.",
    "New Zealand": "New Zealand is an island country in the southwestern Pacific Ocean. It consists of two main landmasses—the North Island (Te Ika-a-Māui) and the South Island (Te Waipounamu)—and over 700 smaller islands. It is the sixth-largest island country by area and lies east of Australia across the Tasman Sea and south of the islands of New Caledonia, Fiji, and Tonga. The country's varied topography and sharp mountain peaks, including the Southern Alps, owe much to tectonic uplift and volcanic eruptions. New Zealand's capital city is Wellington, and its most populous city is Auckland. The islands of New Zealand were the last large habitable land to be settled by humans. Between about 1280 and 1350, Polynesians began to settle in the islands and then subsequently developed a distinctive Māori culture. In 1642, the Dutch explorer Abel Tasman became the first European to sight and record New Zealand. In 1769 the British explorer Captain James Cook became the first European to set foot on and map New Zealand. In 1840, representatives of the United Kingdom and Māori chiefs signed the Treaty of Waitangi which paved the way for Britain's declaration of sovereignty later that year and the establishment of the Crown Colony of New Zealand in 1841. Subsequently, a series of conflicts between the colonial government and Māori tribes resulted in the alienation and confiscation of large amounts of Māori land. New Zealand became a dominion in 1907; it gained full statutory independence in 1947, retaining the monarch as head of state. Today, the majority of New Zealand's population of 5.25 million is of European descent; the indigenous Māori are the largest minority, followed by Asians and Pasifika. Reflecting this, New Zealand's culture is mainly derived from Māori and early British settlers, with recent broadening of culture arising from increased immigration to the",
    "Papua New Guinea": "Papua New Guinea, officially the Independent State of Papua New Guinea, is a country in Oceania that comprises the eastern half of the island of New Guinea and its offshore islands in Melanesia (a region of the southwestern Pacific Ocean north of Australia). It shares its only land border with Indonesia to the west and its other close neighbours are Australia to the south and the Solomon Islands to the east. Its capital, located on its southern coast, is Port Moresby. The country is the world's third largest island country, with an area of 462,840 km2 (178,700 sq mi). Split in the 1880s between German New Guinea in the North and the British Territory of Papua in the South, all of present-day Papua New Guinea came under Australian control following World War I, with the legally distinct Territory of New Guinea being established out of the former German colony as a League of Nations mandate. The nation was the site of fierce fighting during the New Guinea campaign of World War II. Papua New Guinea became an independent Commonwealth realm in 1975 with Elizabeth II as its Queen. Since Elizabeth II's death in 2022, Charles III has been the King. There are 840 known languages of Papua New Guinea (including English), making it the most linguistically diverse country in the world. It is also one of the most rural countries, with only 13.25% of its population living in urban centres in 2019. Most of its people live in customary communities. Although government estimates reported the country's population to be 11.8 million, it was reported in December 2022 that its population was in fact closer to 17 million. Papua New Guinea is the most populous Pacific island country. The country is believed to be the home of many undocumented species of",
    "Nauru": "Nauru ( nah-OO-roo or NOW-roo; Nauruan: Naoero), officially the Republic of Nauru (Nauruan: Repubrikin Naoero) and formerly known as Pleasant Island, is an island country and microstate in Micronesia, part of the Oceania region in the Central Pacific. Its nearest neighbour is Banaba of Kiribati, about 300 km (190 mi) to the east. It lies northwest of Tuvalu, 1,300 km (810 mi) northeast of the Solomon Islands, east-northeast of Papua New Guinea, southeast of the Federated States of Micronesia and south of the Marshall Islands. With an area of only 21 km2 (8.1 sq mi), Nauru is the third-smallest country in the world, larger than only Vatican City and Monaco, making it the smallest republic and island nation, as well as the smallest member state of the Commonwealth of Nations by area. Its population of about 10,800 is the world's third-smallest (not including colonies or overseas territories). Nauru is a member of the United Nations, the Commonwealth of Nations, and the Organization of African, Caribbean, and Pacific States. Settled by Micronesians circa 1000 BCE, Nauru was annexed and claimed as a colony by the German Empire in the late 19th century. After World War I, Nauru became a League of Nations mandate administered by Australia, New Zealand, and the United Kingdom. During World War II, Nauru was occupied by Japanese troops, and was bypassed by the Allied advance across the Pacific. After the war ended, the country entered into United Nations trusteeship. Nauru gained its independence in 1968. At various points since 2001, it has accepted aid from the Australian Government in exchange for hosting the Nauru Regional Processing Centre, a controversial offshore Australian immigration detention facility. As a result of heavy dependence on Australia, some sources have identified Nauru as a client state of Australia. Nauru is a phosphate-rock",
    "Palau": "Palau, officially the Republic of Palau, is an island country in the Micronesia subregion of Oceania in the western Pacific. The republic consists of approximately 340 islands and connects the western chain of the Caroline Islands with parts of the Federated States of Micronesia. It has a total area of 466 square kilometers (180 sq mi), making it the fourth smallest country in the world. The most populous island is Koror, home to the country's most populous city of the same name. The capital, Ngerulmud, is located on the largest island of Babeldaob, in Melekeok State. Palau shares maritime boundaries with international waters to the north, the Federated States of Micronesia to the east, Indonesia to the south, and the Philippines to the northwest. The country was originally settled approximately 3,000 years ago by migrants from Maritime Southeast Asia. Palau was first drawn on a European map by the Bohemian missionary Paul Klein based on a description given by a group of Palauans shipwrecked on the Philippine coast on Samar. Palau islands were made part of the Spanish East Indies in 1885. Following Spain's defeat in the Spanish–American War in 1898, the islands were sold to Germany in 1899 under the terms of the German–Spanish Treaty, where they were administered as part of German New Guinea. After World War I, the islands were made a part of the Japanese-ruled South Seas Mandate by the League of Nations. During World War II, skirmishes including the major Battle of Peleliu were fought between American and Japanese troops as part of the Mariana and Palau Islands campaign. Along with other Pacific Islands, Palau was made a part of the United States-governed Trust Territory of the Pacific Islands in 1947. Having voted in a referendum against joining the Federated States of Micronesia in 1978,",
    "MicronesiaSolomon Islands": "No information available for MicronesiaSolomon Islands.",
    "Vanuatu": "Vanuatu (English: VAH-noo-AH-too or van-WAH-too; Bislama and French pronunciation [vanuatu]), officially the Republic of Vanuatu (French: République de Vanuatu; Bislama: Ripablik blong Vanuatu), is an island country in Melanesia, located in the South Pacific Ocean. The archipelago, which is of volcanic origin, is 1,750 km (1,090 mi) east of northern Australia, 540 km (340 mi) northeast of New Caledonia, east of New Guinea, southeast of Solomon Islands, and west of Fiji. Vanuatu was first inhabited by Melanesian people. The first Europeans to visit the islands were a Spanish expedition led by Portuguese navigator Fernandes de Queirós, who arrived on the largest island, Espíritu Santo, in 1606. Queirós claimed the archipelago for Spain, as part of the colonial Spanish East Indies and named it La Austrialia del Espíritu Santo. In the 1880s, France and the United Kingdom claimed parts of the archipelago, and in 1906, they agreed on a framework for jointly managing the archipelago as the New Hebrides through an Anglo-French condominium. An independence movement arose in the 1970s, and the Republic of Vanuatu was founded in 1980. Since independence, the country has become a member of the United Nations, Commonwealth of Nations, Organisation internationale de la Francophonie, and the Pacific Islands Forum.",
    "Fiji": "Fiji ( FEE-jee, fee-JEE; Fijian: Viti, [ˈβitʃi]; Fiji Hindi: फ़िजी, Fijī), officially the Republic of Fiji, is an island country in Melanesia, part of Oceania in the South Pacific Ocean. It lies about 1,100 nautical miles (2,000 km; 1,300 mi) north-northeast of New Zealand. Fiji consists of an archipelago of more than 330 islands—of which about 110 are permanently inhabited—and more than 500 islets, amounting to a total land area of about 18,300 square kilometres (7,100 sq mi). The most outlying island group is Ono-i-Lau. About 87% of the total population of 924,610 live on the two major islands, Viti Levu and Vanua Levu. About three-quarters of Fijians live on Viti Levu's coasts, either in the capital city of Suva, or in smaller urban centres such as Nadi (where tourism is the major local industry) or Lautoka (where the sugar-cane industry is dominant). The interior of Viti Levu is sparsely inhabited because of its terrain. The majority of Fiji's islands were formed by volcanic activity starting around 150 million years ago. Some geothermal activity still occurs today on the islands of Vanua Levu and Taveuni. The geothermal systems on Viti Levu are non-volcanic in origin and have low-temperature surface discharges (of between roughly 35 and 60 degrees Celsius (95 and 140 °F)). Humans have lived in Fiji since the second millennium BC—first Austronesians and later Melanesians, with some Polynesian influences. Europeans first visited Fiji in the 17th century. In 1874, after a brief period in which Fiji was an independent kingdom, the British established the Colony of Fiji. Fiji operated as a Crown colony until 1970, when it gained independence and became known as the Dominion of Fiji. In 1987, following a series of coups d'état, the military government that had taken power declared it a republic. In a 2006",
    "Tuvalu": "Tuvalu ( too-VAH-loo) is an island country in the Polynesian subregion of Oceania in the Pacific Ocean, about midway between Hawaii and Australia. It lies east-northeast of the Santa Cruz Islands (which belong to the Solomon Islands), northeast of Vanuatu, southeast of Nauru, south of Kiribati, west of Tokelau, northwest of Samoa and Wallis and Futuna, and north of Fiji. Tuvalu is composed of three reef islands and six atolls spread out between the latitude of 5° and 10° south and between the longitude of 176° and 180°. They lie west of the International Date Line. The 2017 census determined that Tuvalu had a population of 10,645, making it the second-least populous country in the world, behind Vatican City, and the least populous country where English is an official language. Tuvalu's total land area is 26 square kilometres (10 sq mi). The first inhabitants of Tuvalu were Polynesians, arriving as part of the migration of Polynesians into the Pacific that began about three thousand years ago. Long before European contact with the Pacific islands, Polynesians frequently voyaged by canoe between the islands. Polynesian navigation skills enabled them to make elaborately planned journeys in either double-hulled sailing canoes or outrigger canoes. Scholars believe that the Polynesians spread out from Samoa and Tonga into the Tuvaluan atolls, which then served as a stepping stone for further migration into the Polynesian outliers in Melanesia and Micronesia. In 1568, Spanish explorer and cartographer Álvaro de Mendaña became the first European known to sail through the archipelago, sighting the island of Nui during an expedition he was making in search of Terra Australis. The island of Funafuti was named Ellice's Island in 1819. Later, the whole group was named Ellice Islands by English hydrographer Alexander George Findlay. In the late 19th century, Great Britain claimed",
    "Samoa": "Samoa, officially the Independent State of Samoa and known until 1997 as Western Samoa (Samoan: Sāmoa i Sisifo), is an island country in Polynesia, consisting of two main islands (Savai'i and Upolu); two smaller, inhabited islands (Manono and Apolima); and several smaller, uninhabited islands, including the Aleipata Islands (Nuʻutele, Nuʻulua, Fanuatapu and Namua). Samoa is located 64 km (40 mi) west of American Samoa, 889 km (552 mi) northeast of Tonga, 1,152 km (716 mi) northeast of Fiji, 483 km (300 mi) east of Wallis and Futuna, 1,151 km (715 mi) southeast of Tuvalu, 519 km (322 mi) south of Tokelau, 4,190 km (2,600 mi) southwest of Hawaii, and 610 km (380 mi) northwest of Niue. The capital and largest city is Apia. The Lapita people discovered and settled the Samoan Islands around 3,500 years ago. They developed a Samoan language and Samoan cultural identity. Samoa is a unitary parliamentary democracy with 11 administrative divisions. It is a sovereign state and a member of the Commonwealth of Nations. Western Samoa was admitted to the United Nations on 15 December 1976. Because of the Samoans' seafaring skills, pre-20th-century European explorers referred to the entire island group, including American Samoa, as the \"Navigator Islands\". The country was a colony of the German Empire from 1899 to 1915, then came under a joint British and New Zealand colonial administration until 1 January 1962, when it became independent.",
    "Kiribati": "Kiribati ( KIRR-i-bass, Gilbertese: [kiɾibas]), officially the Republic of Kiribati (Gilbertese: Ribaberiki Kiribati), is an island country in the Micronesia subregion of Oceania in the central Pacific Ocean. Its permanent population is over 119,000 as of the 2020 census, with more than half living on Tarawa atoll. The state comprises 32 atolls and one remote raised coral island, Banaba. Its total land area is 811 km2 (313 sq mi) dispersed over 3,441,810 km2 (1,328,890 sq mi) of ocean. The islands' spread straddles the equator and the 180th meridian, making Kiribati the only country in the world located simultaneously in all four hemispheres: the Northern, Southern, Western, and Eastern hemispheres. The International Date Line goes around Kiribati and swings far to the east, almost reaching 150°W. This brings Kiribati's easternmost islands, the southern Line Islands south of Hawaii, into the same day as the Gilbert Islands and places them in the most advanced time zone on Earth: UTC+14. Kiribati gained its independence from the United Kingdom, becoming a sovereign state in 1979. The capital, South Tarawa, now the most populated area, consists of a number of islets, connected by a series of causeways. These comprise about half the area of Tarawa Atoll. Prior to its independence, the country had exported phosphate, but those mines are no longer viable. Fisheries and export of copra drive much of the economy. Kiribati is one of the least developed countries in the world and is highly dependent on international aid for its economy. Kiribati is a member of the Pacific Community, Commonwealth of Nations, the International Monetary Fund, the World Bank, and the Organisation of African, Caribbean and Pacific States, and became a full member of the United Nations in 1999. As an island nation, the islands are vulnerable to climate change and tsunamis. Addressing",
    "Marshall Islands": "The Marshall Islands (Marshallese: Ṃajeḷ), officially the Republic of the Marshall Islands (Marshallese: Aolepān Aorōkin Ṃajeḷ), is an island country west of the International Date Line and north of the equator in the Micronesia region in the Northwestern Pacific Ocean. The territory consists of 29 coral atolls and five islands, divided across two island chains: Ratak in the east and Ralik in the west. 97.87% of its territory is water, the largest proportion of water to land of any sovereign state. The country shares maritime boundaries with Wake Island to the north, Kiribati to the southeast, Nauru to the south, and the Federated States of Micronesia to the west. The capital and largest city is Majuro, home to approximately half of the country's population. Austronesian settlers reached the Marshall Islands as early as the 2nd millennium BC and introduced Southeast Asian crops, including coconuts, giant swamp taro, and breadfruit, as well as domesticated chickens, which made the islands permanently habitable. Several Spanish expeditions visited the islands in the mid-16th century, but Spanish galleons usually sailed a Pacific route farther north and avoided the Marshalls. European maps and charts named the group for British captain John Marshall, who explored the region in 1788. American Protestant missionaries and Western business interests began arriving in the 1850s. German copra traders dominated the economy in the 1870s and 1880s, and the German Empire annexed the Marshalls as a protectorate in 1885. The Empire of Japan occupied the islands in the autumn of 1914 at the beginning of World War I. After the war, the Marshalls and other former German Pacific colonies north of the equator became the Japanese South Seas Mandate. The United States occupied the islands during World War II and administered them as part of the Trust Territory of the Pacific Islands"
}