{
    "Canada": "Canada is a country in North America. Its ten provinces and three territories extend from the Atlantic Ocean to the Pacific Ocean and northward into the Arctic Ocean, making it the world's second-largest country by total area, with the world's longest coastline. Its border with the United States is the world's longest international land border. The country is characterized by a wide range of both meteorologic and geological regions. With a population of just over 41 million people, it has widely varying population densities, with the majority residing in urban areas and large areas of the country being sparsely populated. Canada's capital is Ottawa and its three largest metropolitan areas are Toronto, Montreal, and Vancouver. Indigenous peoples have continuously inhabited what is now Canada for thousands of years. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories resulting in the displacement of Indigenous populations, and a process of increasing autonomy from the United Kingdom. This increased sovereignty was highlighted by the Statute of Westminster, 1931, and culminating in the Canada Act 1982, which severed the vestiges of legal dependence on the Parliament of the United Kingdom. Canada is a parliamentary democracy and a constitutional monarchy in the Westminster tradition. The country's head of government is the prime minister, who holds office by virtue of their ability to command the confidence of the elected House of Commons and is appointed by the governor general, representing the monarch of Canada, the ceremonial head of",
    "United States": "The United States of America (USA), commonly known as the United States (U.S.) or America, is a country primarily located in North America. It is a federal union of 50 states and a federal capital district, Washington, D.C. The 48 contiguous states border Canada to the north and Mexico to the south, with the states of Alaska to the northwest and the archipelagic Hawaii in the Pacific Ocean. The United States also asserts sovereignty over five major island territories and various uninhabited islands. The country has the world's third-largest land area, largest exclusive economic zone, and third-largest population, exceeding 334 million. Its three largest metropolitan areas are New York, Los Angeles, and Chicago, and its three most populous states are California, Texas, and Florida. Paleo-Indians migrated across the Bering land bridge more than 12,000 years ago, and went on to form various civilizations and societies. British colonization led to the first settlement of the Thirteen Colonies in Virginia in 1607. Clashes with the British Crown over taxation and political representation sparked the American Revolution, with the Second Continental Congress formally declaring independence on July 4, 1776. Following its victory in the 1775–1783 Revolutionary War, the country continued to expand across North America. As more states were admitted, a North-South division over slavery led to the secession of the Confederate States of America, which fought the remaining Union states in the 1861–1865 American Civil War. With the Union's victory and preservation, slavery was abolished nationally. By 1900, the U.S. had established itself as a great power, which was solidified after its involvement in World War I. After Japan's attack on Pearl Harbor in December 1941, the U.S. entered World War II. Its aftermath left the U.S. and the Soviet Union as the world's two superpowers and led to the Cold War,",
    "Mexico": "Mexico, officially the United Mexican States, is a country in the southern portion of North America. Covering 1,972,550 km2 (761,610 sq mi), it is the world's 13th largest country by area; with a population of almost 130 million, it is the 10th most populous country and has the most Spanish speakers in the world. Mexico is a constitutional republic comprising 31 states and Mexico City, its capital and largest city, which is among the world's most populous metropolitan areas. The country shares land borders with the United States to the north, with Guatemala and Belize to the southeast; as well as maritime borders with the Pacific Ocean to the west, the Caribbean Sea to the southeast, and the Gulf of Mexico to the east. Human presence in Pre-Columbian Mexico dates back to 8,000 BC as one of six cradles of civilization. Mesoamerica hosted civilizations including the Olmec, Maya, Zapotec, Teotihuacan, and Purepecha. Aztec domination of the area preceded Spanish conquest of the Aztec Empire, which established the colony of New Spain centered in the former capital, Tenochtitlan (now Mexico City). The Mexican War of Independence in the early 19th century was followed by political and socioeconomic upheaval. The Mexican–American War resulted in significant territorial losses in 1848. Liberal reforms introduced in the Constitution of 1857 prompted domestic conflict, French intervention, and the establishment of an Empire, countered by the Republican resistance led by Benito Juárez. The rise of Porfirio Díaz's dictatorship in the 19th century sparked the Mexican Revolution in 1910, which led to profound changes, such as the 1917 Constitution. Over the 20th century, Mexico experienced significant economic growth; as well as issues of repression and electoral fraud. The late 20th century saw a shift towards neoliberal policies, exemplified by the signing of the North American Free Trade Agreement",
    "Belize": "Belize ( , bih-LEEZ, beh-; Belize Kriol English: Bileez) is a country on the north-eastern coast of Central America. It is bordered by Mexico to the north, the Caribbean Sea to the east, and Guatemala to the west and south. It also shares a water boundary with Honduras to the southeast. Belize is a member of the Caribbean Community (CARICOM), and is considered part of the Caribbean region and the historical British West Indies. The Maya civilization spread into the area of Belize between 1500 BC and AD 300 and flourished until about 1200. European contact began in 1502–04 when Christopher Columbus sailed along the Gulf of Honduras. European exploration was begun by English settlers in 1638. Spain and Britain both laid claim to the land until Britain defeated the Spanish in the Battle of St. George's Caye (1798). It became a British colony in 1840, and a Crown colony in 1862. Belize achieved its independence from the United Kingdom on 21 September 1981. It is the only mainland Central American country which is a Commonwealth realm, with King Charles III as its monarch and head of state, represented by a governor-general. Belize's abundance of terrestrial and marine plants and animals and its diversity of ecosystems, including extensive coral reefs, give it a key place in the globally significant Mesoamerican Biological Corridor. It is considered a Central American and Caribbean nation with strong ties to both the American and Caribbean regions. It has an area of 22,970 square kilometres (8,867 sq mi) and a population of 397,483 (2022). Its mainland is about 290 km (180 mi) long and 110 km (68 mi) wide. It is the least populated and least densely populated country in Central America. Its population growth rate of 1.87% per year (2018 estimate) is the second-highest in",
    "Guatemala": "Guatemala, officially the Republic of Guatemala, is a country in Central America. It is bordered to the north and west by Mexico, to the northeast by Belize, to the east by Honduras, and to the southeast by El Salvador. It is hydrologically bordered to the south by the Pacific Ocean and to the northeast by the Gulf of Honduras. The territory of modern Guatemala hosted the core of the Maya civilization, which extended across Mesoamerica; in the 16th century, most of this was conquered by the Spanish and claimed as part of the viceroyalty of New Spain. Guatemala attained independence from Spain and Mexico in 1821. From 1823 to 1841, it was part of the Federal Republic of Central America. For the latter half of the 19th century, Guatemala suffered instability and civil strife. From the early 20th century, it was ruled by a series of dictators backed by the United States. In 1944, authoritarian leader Jorge Ubico was overthrown by a pro-democratic military coup, initiating a decade-long revolution that led to social and economic reforms. In 1954, a US-backed military coup ended the revolution and installed a dictatorship. From 1960 to 1996, Guatemala endured a bloody civil war fought between the US-backed government and leftist rebels, including genocidal massacres of the Maya population perpetrated by the Guatemalan military. The United Nations negotiated a peace accord, resulting in economic growth and successive democratic elections. Guatemala's abundance of biologically significant and unique ecosystems includes many endemic species and contributes to Mesoamerica's designation as a biodiversity hotspot. Although rich in export goods, around a quarter of the population (4.6 million) face food insecurity. Other extant major issues include poverty, crime, corruption, drug trafficking, and civil instability. With an estimated population of around 17.6 million, Guatemala is the most populous country in Central",
    "Honduras": "Honduras, officially the Republic of Honduras, is a country in Central America. It is bordered to the west by Guatemala, to the southwest by El Salvador, to the southeast by Nicaragua, to the south by the Pacific Ocean at the Gulf of Fonseca, and to the north by the Gulf of Honduras, a large inlet of the Caribbean Sea. Its capital and largest city is Tegucigalpa. Honduras was home to several important Mesoamerican cultures, most notably the Maya, before Spanish colonization in the sixteenth century. The Spanish introduced Catholicism and the now predominant Spanish language, along with numerous customs that have blended with the indigenous culture. Honduras became independent in 1821 and has since been a republic, although it has consistently endured much social strife and political instability, and remains one of the poorest countries in the Western Hemisphere. In 1960, the northern part of what was the Mosquito Coast was transferred from Nicaragua to Honduras by the International Court of Justice. The nation's economy is primarily agricultural, making it especially vulnerable to natural disasters such as Hurricane Mitch in 1998. The lower class is primarily agriculturally based while wealth is concentrated in the country's urban centers. Honduras has a Human Development Index of 0.625, classifying it as a nation with medium development. When adjusted for income inequality, its Inequality-adjusted Human Development Index is 0.443. Honduran society is predominantly Mestizo; however, there are also significant Indigenous, black, and white communities in Honduras. The nation had a relatively high political stability until a 2009 military coup and controversy arising from claims of electoral fraud in the 2017 presidential election. Honduras spans about 112,492 km2 (43,433 sq mi) and has a population exceeding 10 million. Its northern portions are part of the western Caribbean zone, as reflected in the area's demographics and",
    "El Salvador": "El Salvador, officially the Republic of El Salvador, is a country in Central America. It is bordered on the northeast by Honduras, on the northwest by Guatemala, and on the south by the Pacific Ocean. El Salvador's capital and largest city is San Salvador. The country's population in 2024 was estimated to be 6 million according to a government census. Among the Mesoamerican nations that historically controlled the region are the Mayans, and then the Cuzcatlecs. Archaeological monuments also suggest an early Olmec presence around the first millennium BC. In the beginning of the 16th century, the Spanish Empire conquered the Central American territory, incorporating it into the Viceroyalty of New Spain ruled from Mexico City. However the Viceroyalty of New Spain had little to no influence in the daily affairs of the isthmus, which was colonized in 1524. In 1609, the area was declared the Captaincy General of Guatemala by the Spanish, which included the territory that would become El Salvador until its independence from Spain in 1821. It was forcibly incorporated into the First Mexican Empire, then seceded, joining the Federal Republic of Central America in 1823. When the federation dissolved in 1841, El Salvador became a sovereign state, then formed a short-lived union with Honduras and Nicaragua called the Greater Republic of Central America, which lasted from 1896 to 1898. From the late 19th to the mid-20th century, El Salvador endured chronic political and economic instability characterized by coups, revolts, and a succession of authoritarian rulers. Persistent socioeconomic inequality and civil unrest culminated in the Salvadoran Civil War from 1979 to 1992, fought between the military-led government backed by the United States, and a coalition of left-wing guerrilla groups. The conflict ended with the Chapultepec Peace Accords. This negotiated settlement established a multiparty constitutional republic, which remains",
    "Nicaragua": "Nicaragua, officially the Republic of Nicaragua, is the geographically largest country in Central America, comprising 130,370 km2 (50,340 sq mi). With a population of 7,142,529 as of 2024, it is the third-most populous country in Central America after Guatemala and Honduras. Nicaragua is bordered by Honduras to the north, the Caribbean Sea to the east, Costa Rica to the south, and the Pacific Ocean and shares maritime borders with El Salvador to the west and Colombia to the east. The country's largest city and national capital is Managua, the fourth-largest city in Central America, with a population of 1,055,247 as of 2020. Nicaragua is known as \"the breadbasket of Central America\" due to having the most fertile soil and arable land in all of Central America. Nicaragua's multiethnic population includes people of mestizo, indigenous, European, and African heritage. The country's most spoken language is Spanish, though indigenous tribes on the Mosquito Coast speak their own languages and English. Originally inhabited by various indigenous cultures since ancient times, the region was conquered by the Spanish Empire in the 16th century. Nicaragua gained independence from Spain in 1821. The Mosquito Coast followed a different historical path, being colonized by the English in the 17th century and later coming under British rule. It became an autonomous territory of Nicaragua in 1860 and its northernmost part was transferred to Honduras in 1960. Since its independence, Nicaragua has undergone periods of political unrest, dictatorship, occupation and fiscal crisis, including the Nicaraguan Revolution of the 1960s and 1970s and the Contra War of the 1980s. The mixture of cultural traditions has generated substantial diversity in folklore, cuisine, music, and literature, including contributions by Nicaraguan poets and writers such as Rubén Darío. Known as the \"land of lakes and volcanoes\", Nicaragua is also home to the Bosawás",
    "Costa Rica": "Costa Rica (UK: , US: ; Spanish: [ˈkosta ˈrika]; literally \"Rich Coast\"), officially the Republic of Costa Rica, is a country in the Central American region of North America. It borders Nicaragua to the north, the Caribbean Sea to the northeast, Panama to the southeast, and the Pacific Ocean to the southwest, as well as maritime border with Ecuador to the south of Cocos Island. It has a population of around five million in a land area of nearly 51,180 km2 (19,760 sq mi). An estimated 352,381 people live in the capital and largest city, San José, with around two million people in the surrounding metropolitan area. The sovereign state is a presidential republic. It has a long-standing and stable constitutional democracy and a highly educated workforce. The country spends roughly 6.9% of its budget (2016) on education, compared to a global average of 4.4%. Its economy, once heavily dependent on agriculture, has diversified to include sectors such as finance, corporate services for foreign companies, pharmaceuticals, and ecotourism. Many foreign manufacturing and services companies operate in Costa Rica's Free Trade Zones (FTZ) where they benefit from investment and tax incentives. Costa Rica was inhabited by indigenous peoples before coming under Spanish rule in the 16th century. It remained a peripheral colony of the empire until independence as part of the First Mexican Empire, followed by membership in the Federal Republic of Central America, from which it formally declared independence in 1847. Following the brief Costa Rican Civil War in 1948, it permanently abolished its army in 1949, becoming one of only a few sovereign nations without a standing army. The country has consistently performed favorably in the Human Development Index (HDI), placing 58th in the world as of 2022, and fifth in Latin America. It has also been cited by",
    "Panama": "Panama, officially the Republic of Panama, is a country in Latin America at the southern end of Central America, bordering South America. It is bordered by Costa Rica to the west, Colombia to the southeast, the Caribbean Sea to the north, and the Pacific Ocean to the south. Its capital and largest city is Panama City, whose metropolitan area is home to nearly half of the country's over 4 million inhabitants. Before the arrival of Spanish colonists in the 16th century, Panama was inhabited by a number of different indigenous tribes. It broke away from Spain in 1821 and joined the Republic of Gran Colombia, a union of Nueva Granada, Ecuador, and Venezuela. After Gran Colombia dissolved in 1831, Panama and Nueva Granada eventually became the Republic of Colombia. With the backing of the United States, Panama seceded from Colombia in 1903, allowing the construction of the Panama Canal to be completed by the United States Army Corps of Engineers between 1904 and 1914. The 1977 Torrijos–Carter Treaties agreed to transfer the canal from the United States to Panama on December 31, 1999. The surrounding territory was returned first, in 1979. Revenue from canal tolls has continued to represent a significant portion of Panama's GDP, especially after the Panama Canal expansion project (finished in 2016) doubled its capacity. Commerce, banking, and tourism are major sectors. Panama is regarded as having a high-income economy. In 2019, Panama ranked 57th in the world in terms of the Human Development Index. In 2018, Panama was ranked the seventh-most competitive economy in Latin America, according to the World Economic Forum's Global Competitiveness Index. Panama was ranked 82rd in the Global Innovation Index in 2024. Covering around 40 percent of its land area, Panama's jungles are home to an abundance of tropical plants and animals",
    "Cuba": "Cuba, officially the Republic of Cuba, is an island country, comprising the island of Cuba (largest island), Isla de la Juventud, and 4,195 islands, islets and cays surrounding the main island. It is located where the northern Caribbean Sea, Gulf of Mexico, and Atlantic Ocean meet. Cuba is located east of the Yucatán Peninsula (Mexico), south of both Florida and the Bahamas, west of Hispaniola (Haiti/Dominican Republic), and north of Jamaica and the Cayman Islands. Havana is the largest city and capital. Cuba is the third-most populous country in the Caribbean after Haiti and the Dominican Republic, with about 10 million inhabitants. It is the largest country in the Caribbean by area. The territory that is now Cuba was inhabited as early as the 4th millennium BC, with the Guanahatabey and Taíno peoples inhabiting the area at the time of Spanish colonization in the 15th century. It was then a colony of Spain, through the abolition of slavery in 1886, until the Spanish–American War of 1898, when Cuba was occupied by the United States and gained independence in 1902. In 1940, Cuba implemented a new constitution, but mounting political unrest culminated in the 1952 Cuban coup d'état and the subsequent dictatorship of Fulgencio Batista. The Batista government was overthrown in January 1959 by the 26th of July Movement during the Cuban Revolution. That revolution established communist rule under the leadership of Fidel Castro. The country was a point of contention during the Cold War between the Soviet Union and the United States, and the Cuban Missile Crisis of 1962 is widely considered the closest the Cold War came to escalating into nuclear war. Following the dissolution of the Soviet Union, Cuba faced a severe economic downturn in the 1990s, known as the Special Period. In 2008, Fidel Castro retired after",
    "Jamaica": "Jamaica ( jə-MAY-kə; Jamaican Patois: Jumieka [dʒʌˈmie̯ka]) is an island country in the Caribbean Sea and the West Indies. At 10,990 square kilometres (4,240 sq mi), it is the third-largest island—after Cuba and Hispaniola—of the Greater Antilles and the Caribbean. Jamaica lies about 145 km (78 nmi) south of Cuba, 191 km (103 nmi) west of Hispaniola (the island containing Haiti and the Dominican Republic), and 215 km (116 nmi) southeast of the Cayman Islands (a British Overseas Territory). The indigenous Taíno peoples of the island gradually came under Spanish rule after the arrival of Christopher Columbus in 1494. Many of the indigenous people either were killed or died of diseases, after which the Spanish brought large numbers of Africans to Jamaica as slaves. The island remained a possession of Spain, under the name Santiago, until 1655, when England (part of what would become the Kingdom of Great Britain) conquered it and named it Jamaica. It became an important part of the colonial British West Indies. Under Britain's colonial rule, Jamaica became a leading sugar exporter, with a plantation economy dependent on continued importation of African slaves and their descendants. The British fully emancipated all slaves in 1838, and many freedmen chose to have subsistence farms rather than to work on plantations. Beginning in the 1840s, the British began using Chinese and Indian indentured labourers for plantation work. Jamaicans achieved independence from the United Kingdom on 6 August 1962. With 2.8 million people, Jamaica is the third most populous Anglophone country in the Americas (after the United States and Canada), and the fourth most populous country in the Caribbean. Kingston is the country's capital and largest city. Most Jamaicans are of Sub-Saharan African ancestry, with significant European, East Asian (primarily Chinese), Indian, Lebanese, and mixed-race minorities. Because of a high",
    "The Bahamas": "The Bahamas ( bə-HAH-məz), officially the Commonwealth of The Bahamas, is an island country within the Lucayan Archipelago of the Atlantic Ocean. It contains 97% of the Lucayan Archipelago's land area and 88% of its population. The archipelagic country consists of more than 3,000 islands, cays, and islets in the Atlantic Ocean, and is located north of Cuba and northwest of the island of Hispaniola (split between the Dominican Republic and Haiti) and the Turks and Caicos Islands, southeast of the U.S. state of Florida, and east of the Florida Keys. The capital is Nassau on the island of New Providence. The Royal Bahamas Defence Force describes the Bahamas' territory as encompassing 470,000 km2 (180,000 sq mi) of ocean space. The Bahama islands were inhabited by the Arawak and Lucayans, a branch of the Arawakan-speaking Taíno, for many centuries. Christopher Columbus was the first European to see the islands, making his first landfall in the \"New World\" in 1492 when he landed on the island of San Salvador. Later, the Spanish shipped the native Lucayans to Hispaniola and enslaved them there, after which the Bahama islands were mostly deserted from 1513 until 1648, as nearly all native Bahamians had been forcibly removed for enslavement or had died of diseases which Europeans had brought with them from Europe. In 1649, English colonists from Bermuda, known as the Eleutheran Adventurers, settled on the island of Eleuthera. The Bahamas became a British crown colony in 1718, when the British clamped down on piracy. After the American Revolutionary War, the Crown resettled thousands of American Loyalists to the Bahamas; they took enslaved people with them and established plantations on land grants. Enslaved Africans and their descendants constituted the majority of the population from this period on. The slave trade was abolished by the British",
    "Haiti": "Haiti, officially the Republic of Haiti, is a country on the island of Hispaniola in the Caribbean Sea, east of Cuba and Jamaica, and south of The Bahamas. It occupies the western three-eighths of the island, which it shares with the Dominican Republic. Haiti is the third largest country in the Caribbean, and with an estimated population of 11.4 million, is the most populous Caribbean country. The capital and largest city is Port-au-Prince. Haiti was originally inhabited by the Taíno people. In 1492, Christopher Columbus established the first European settlement in the Americas, La Navidad, on its northeastern coast. The island was part of the Spanish Empire until 1697, when the western portion was ceded to France and became Saint-Domingue, dominated by sugarcane plantations worked by enslaved Africans. The Haitian Revolution (1791–1804) led by Toussaint Louverture and later Jean-Jacques Dessalines, made Haiti the first sovereign state in the Caribbean, the second republic in the Americas, the first country in the Americas to officially abolish slavery, and the only country in history established by a slave revolt. The 19th century saw political instability, international isolation, debt to France, and a costly war with the neighboring Dominican Republic. U.S. forces occupied Haiti from 1915 to 1934, followed by dicatorial rule of the Duvalier family (1957–1986). After a coup d'état in 2004, the United Nations intervened. In 2010, a catastrophic earthquake and a deadly cholera outbreak devastated the country. By 2024, Haiti has faced severe economic and political crises, gang activity, and the collapse of its government. With no elected officials remaining, Haiti has been described as a failed state. Haiti is a founding member of the United Nations, Organization of American States (OAS), Association of Caribbean States, and the Organisation internationale de la Francophonie. In addition to CARICOM, it is a member",
    "Dominican Republic": "The Dominican Republic is a North American country located on the island of Hispaniola in the Greater Antilles of the Caribbean Sea in the North Atlantic Ocean. It shares a maritime border with Puerto Rico to the east and a land border with Haiti to the west, occupying the eastern five-eighths of Hispaniola which, along with Saint Martin, is one of only two islands in the Caribbean shared by two sovereign states. In the Antilles, the country is the second-largest nation by area after Cuba at 48,671 square kilometers (18,792 sq mi) and second-largest by population after Haiti with approximately 11.4 million people in 2024, of whom 3.6 million reside in the metropolitan area of Santo Domingo, the capital city. The native Taíno people had inhabited Hispaniola prior to European contact, dividing it into five chiefdoms. Christopher Columbus claimed the island for Castile, landing there on his first voyage in 1492. The colony of Santo Domingo became the site of the first permanent European settlement in the Americas. In 1697, Spain recognized French dominion over the western third of the island, which became the independent First Empire of Haiti in 1804. A group of Dominicans deposed the Spanish governor and declared independence from Spain in November 1821, but were annexed by Haiti in February 1822. Independence came 22 years later in 1844, after victory in the Dominican War of Independence. The next 72 years saw several civil wars, failed invasions by Haiti, and a brief return to Spanish colonial status, before permanently ousting the Spanish during the Dominican Restoration War of 1863–1865. From 1930, the dictatorship of Rafael Trujillo ruled until his assassination in 1961. Juan Bosch was elected president in 1962 but was deposed in a military coup in 1963. The Dominican Civil War of 1965 preceded the authoritarian",
    "St Chritopher and Nevis": "No information available for St Chritopher and Nevis.",
    "Antigua and Barbuda": "Antigua and Barbuda (UK: , US: ) is a sovereign archipelagic country in the Caribbean. It lies at the conjuncture of the Caribbean Sea and the Atlantic Ocean in the Leeward Islands part of the Lesser Antilles. The country consists of two major islands, Antigua and Barbuda, which are approximately 40 km (25 mi) apart, and several smaller islands, including Great Bird, Green, Guiana, Long, Maiden, Prickly Pear, York, and Redonda. The permanent population is approximately 97,120 (2019 estimates), with 97% residing in Antigua. St. John's, Antigua, is the country's capital, major city, and largest port. Codrington is Barbuda's largest town. In 1493, Christopher Columbus surveyed the island of Antigua, which he named for the Church of Santa María La Antigua. Great Britain colonized Antigua in 1632 and Barbuda in 1678. A part of the Federal Colony of the Leeward Islands from 1871, Antigua and Barbuda joined the West Indies Federation in 1958. With the breakup of the federation in 1962, it became one of the West Indies Associated States in 1967. Following a period of internal self-governance, it gained full independence from the United Kingdom on 1 November 1981. Antigua and Barbuda is a member of the Commonwealth and a Commonwealth realm; it is a constitutional monarchy with Charles III as its head of state. The economy of Antigua and Barbuda is largely dependent on tourism, which accounts for 80% of its GDP. Like other island nations, Antigua and Barbuda is vulnerable to the effects of climate change, such as sea level rise, and increased intensity of extreme weather like hurricanes. These cause coastal erosion, water scarcity, and other challenges. Antigua and Barbuda offers a citizenship by investment program. The country levies no personal income tax.",
    "Dominica": "Dominica (locally dom-in-EE-kə; UK: US: or ; Dominican Creole French: Dominik; Kalinago: Waitukubuli), officially the Commonwealth of Dominica, is an island country in the Caribbean. It is part of the Windward Islands chain in the Lesser Antilles archipelago in the Caribbean Sea. The capital, Roseau, is located on the western side of the island. Dominica's closest neighbours are two constituent territories of the European Union, the overseas departments of France, Guadeloupe to the northwest and Martinique to the south-southeast. Dominica comprises a land area of 750 km2 (290 sq mi), and the highest point is Morne Diablotins, at 1,447 m (4,747 ft) in elevation. The population was 71,293 at the 2011 census. The island was settled by the Arawak arriving from South America in the fifth century. The Kalinago displaced the Arawak by the 15th century. Christopher Columbus is said to have passed the island on Sunday, 3 November 1493. It was later colonised by Europeans, predominantly by the French from the 1690s to 1763. The French trafficked slaves from West Africa to Dominica to work on coffee plantations. Great Britain took possession in 1763 after the Seven Years' War, and it gradually established English as its official language. The island gained independence as a republic in 1978. Dominica has been nicknamed the \"Nature Island of the Caribbean\" for its natural environment. It is the youngest island in the Lesser Antilles, and in fact it is still being formed by geothermal-volcanic activity, as evidenced by the world's second-largest hot spring, called Boiling Lake. The island has lush mountainous rainforests and is the home of many rare plants, animals, and bird species. There are xeric areas in some of the western coastal regions, but heavy rainfall occurs inland. The Sisserou parrot, also known as the Imperial amazon, is critically endangered and",
    "St. Lucia": "Saint Lucia is an island country of the West Indies in the eastern Caribbean. Part of the Windward Islands of the Lesser Antilles, it is located north/northeast of the island of Saint Vincent, northwest of Barbados and south of Martinique. It covers a land area of 617 km2 (238 square miles) with an estimated population of over 180,000 people as of 2018. The nation's capital and largest city is Castries. The first proven inhabitants of the island, the Arawaks, are believed to have first to settle on the island in 200–400 AD. In 800 AD, the island would be taken over by the Kalinago. The French were the first European colonists to settle on the island, and they signed a treaty with the native Caribs in 1660. The English took control of the island in 1663. In ensuing years, England and France fought 14 times for control of the island; consequently control over this immensely valuable geopolitical position changed frequently. Eventually, the British took complete control in 1814, shortly after the victory over French Emperor Napoleon I. Because the island switched so often between British and French control, Saint Lucia was also known as the \"Helen of the West\" after the Greek mythological character, Helen of Troy. Representative government was introduced in 1924 with universal suffrage being established in 1951. From 1958 to 1962, the island was a member of the West Indies Federation. On 22 February 1979, Saint Lucia became an independent state, while remaining as a Commonwealth realm. Saint Lucia is a member of the United Nations, the Organization of American States, the World Trade Organization, CARICOM and the Organisation of Eastern Caribbean States (OECS). It is also a member of Organisation internationale de la Francophonie.",
    "St. Vincent and the Grenadines": "Saint Vincent and the Grenadines ( GREH-nə-DEENZ) is an island country in the eastern Caribbean. It is located in the southeast Windward Islands of the Lesser Antilles, which lie in the West Indies, at the southern end of the eastern border of the Caribbean Sea, where the latter meets the Atlantic Ocean. Its 369 km2 (142 sq mi) territory consists of the main island of Saint Vincent and, south of that, two-thirds of the northern part of the Grenadines, a chain of 32 smaller islands. Some of the Grenadines are inhabited—Bequia, Mustique, Union Island, Canouan, Petit Saint Vincent, Palm Island, Mayreau, Young Island—while others are not: Tobago Cays, Baliceaux, Battowia, Quatre, Petite Mustique, Savan and Petit Nevis. To the north of Saint Vincent lies Saint Lucia, to the east is Barbados, and Grenada lies to the south. Saint Vincent and the Grenadines has a population density of over 300 inhabitants/km2 (700 per sq mi), with an estimated population of 110,872. Kingstown is the capital and main port. Saint Vincent has a British colonial history, and is now part of the Organisation of Eastern Caribbean States, CARICOM, the Commonwealth of Nations, the Bolivarian Alliance for the Americas, and the Community of Latin American and Caribbean States (CELAC). In April 2021, the La Soufrière volcano erupted several times with \"explosive events\" continuing for two weeks. By 12 April, 16,000 residents had evacuated the area. Assistance and emergency financial support was being provided by several nearby islands, the United Kingdom, and agencies such as the United Nations. The first significant offer of long-term funding, of US$20 million, was announced on 13 April 2021 by the World Bank.",
    "Barbados": "Barbados (UK: bar-BAY-doss; US: bar-BAY-dohss; locally bar-BAY-dəss) is an island country in the Lesser Antilles of the West Indies, in the Caribbean region next to North America and north of South America, and is the most easterly of the Caribbean islands. It lies on the boundary of the South American and Caribbean plates. Its capital and largest city is Bridgetown. Inhabited by Kalinago people since the 13th century, and prior to that by other Indigenous peoples, Spanish navigators took possession of Barbados in the late 15th century, claiming it for the Crown of Castile. It first appeared on a Spanish map in 1511. The Portuguese Empire claimed the island between 1532 and 1536, but abandoned it in 1620 with their only remnants being an introduction of wild boars for a good supply of meat whenever the island was visited. An English ship, the Olive Blossom, arrived in Barbados on 14 May 1625; its men took possession of the island in the name of King James I. In 1627, the first permanent settlers arrived from England, and Barbados became an English and later British colony. During this period, the colony operated on a plantation economy, relying on the labour of African slaves who worked on the island's plantations. Slavery continued until it was phased out through most of the British Empire by the Slavery Abolition Act 1833. On 30 November 1966, Barbados moved towards political independence and assumed the status of a Commonwealth realm, becoming a separate jurisdiction with Elizabeth II as the Queen of Barbados. On 30 November 2021, Barbados transitioned to a republic within the Commonwealth, replacing its monarchy with a ceremonial president. Barbados's population is predominantly of African ancestry. While it is technically an Atlantic island, Barbados is closely associated with the Caribbean and is ranked as one",
    "Grenada": "Grenada ( grə-NAY-də; Grenadian Creole French: Gwenad, [ɡweˈnad]) is an island country of the West Indies in the eastern Caribbean Sea. The southernmost of the Windward Islands, Grenada is directly south of Saint Vincent and the Grenadines and about 100 miles (160 km) north of Trinidad and the South American mainland. Grenada consists of the island of Grenada itself, two smaller islands, Carriacou and Petite Martinique, and several small islands which lie to the north of the main island and are a part of the Grenadines. Its size is 348.5 square kilometres (134.6 sq mi), with an estimated population of 114,621 in 2024. Its capital is St. George's. Grenada is also known as the \"Island of Spice\" due to its production of nutmeg and mace crops. Before the arrival of Europeans in the Americas, Grenada was inhabited by the indigenous peoples from South America. Christopher Columbus sighted Grenada in 1498 during his third voyage to the Americas. Following several unsuccessful attempts by Europeans to colonise the island due to resistance from resident Island Caribs, French settlement and colonisation began in 1649 and continued for the next century. On 10 February 1763, Grenada was ceded to the British under the Treaty of Paris. British rule continued until 1974 (except for a brief French takeover between 1779 and 1783). However, on 3 March 1967, it was granted full autonomy over its internal affairs as an Associated State, and from 1958 to 1962, Grenada was part of the Federation of the West Indies, a short-lived federation of British West Indian colonies. Independence was granted on 7 February 1974 under the leadership of Eric Gairy, who became the first prime minister of Grenada as a sovereign state. The new country became a member of the Commonwealth of Nations, with Queen Elizabeth II as head",
    "Trinidad and Tobago": "Trinidad and Tobago, officially the Republic of Trinidad and Tobago, is the southernmost island country in the Caribbean. Consisting of the main islands Trinidad and Tobago and numerous much smaller islands, it is situated 11 kilometres (6 nautical miles) off the coast of northeastern Venezuela and 130 kilometres (70 nautical miles) south of Grenada. It shares maritime boundaries with Barbados to the east, Grenada to the northwest and Venezuela to the south and west. Trinidad and Tobago is generally considered to be part of the West Indies. The island country's capital is Port of Spain, while its largest and most populous municipality is Chaguanas. The island of Trinidad was inhabited for centuries by Indigenous peoples before becoming a colony in the Spanish Empire, following the arrival of Christopher Columbus, in 1498. Spanish governor José María Chacón surrendered the island to a British fleet under the command of Sir Ralph Abercromby in 1797. Trinidad and Tobago were ceded to Britain in 1802 under the Treaty of Amiens as separate states and unified in 1889. Trinidad and Tobago obtained independence in 1962, and became a republic in 1976. Unlike most Caribbean nations and territories, which rely heavily on tourism, the economy is primarily industrial with an emphasis on petroleum and petrochemicals; much of the nation's wealth is derived from its large reserves of oil and natural gas. Trinidad and Tobago is well known for its African and Indian cultures, reflected in its large and famous Carnival, Diwali, and Hosay celebrations, as well as being the birthplace of the steelpan, the limbo, and music styles such as calypso, soca, rapso, parang, chutney, and chutney soca music. The country gets fewer hurricanes than most of the Caribbean because it is farther south."
}